{
  "id": "461f7c3a-d7e1-4b9b-9df6-5505b63436c8",
  "description": "Comedy that follows two brothers from London's rough Peckham estate as they wheel and deal through a number of dodgy deals and search for the big score that'll make them millionaires.",
  "title": "Only Fools and Horses",
  "image": "https://m.media-amazon.com/images/M/MV5BYmI1NGIwNzYtOTVlMS00ZGYwLWE0ZTktYzVmMGVlMmRmN2QxXkEyXkFqcGdeQXVyNTA4NzY1MzY@.jpg",
  "genres": [
    18
  ],
  "seasons": [
    {
      "id": "c75e1f08-15c3-4e47-a990-ec3d7befe3dc",
      "season": 1,
      "episodes": [
        {
          "id": "846f3b14-06d5-47bc-bf10-c8372512e3c1",
          "title": "Big Brother",
          "episode": 1,
          "description": "Del employs younger brother Rodney as a member of Trotters' Independent Traders, despite warnings from his business colleagues. When Rodney decides to become the Trotters' financial adviser - monitoring the accounts and keeping Del's dodgy dealings in check - Del has second thoughts about their partnership. Cracks show in the partnership when Rodney inadvertently bungles a deal with Trigger. But despite Del's anger, it turns out that Rodder's advice would have prevented the purchase of 25 briefcases that are locked with the serial number inside. Del and Rodney have yet another row and 'Little Bruv' plans a career change. Desperate to make his mark on the world, Rodney decides to leave for Hong Kong - a great plan, if only he'd remembered his passport.",
          "date": "1981-09-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYWY0NDZkMjAtOTI0YS00ZmQ0LWExNzItOWQwYmJhZmJiODYzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "6230e6eb-13f5-465b-80c4-473d40d620d8",
          "title": "Go West Young Man",
          "episode": 2,
          "description": "Del and Rodney are once again hunting for bargains. And after stopping off at Boycie's car lot they spy a Mark II Cortina that's being used as a part-exchange for a Vanden Plas. Del knocks the asking price down to £25, so long as he houses Boycie's E type jag for a week - Del hopes to use the Jag to impress his bit on the side. Del ups the price tag of the Cortina to £199 and gets interest from an Australian buyer. And with cash in their pockets, a Jag to drive, and both of them single, Rodney talks Del into heading off for a night on the tiles. The Trotters' night out doesn't start too well, as they are chatted up by a pair of transvestites in a nightclub. But their luck changes in the form of Nicky and Michelle, who they manage to chat up and persuade them to write their telephone numbers on Del's cigar pack, with the promise of a date next Friday. On their way home, Rodney accidentally throws the cigar pack out of the window of the Jag, and when Del makes an emergency stop, a car smashes into the back of Boycie's pristine E-type. To top it off, the car responsible for writing-off the Jag is none other than the clapped out Cortina.",
          "date": "1981-09-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOGI4ODllOTEtMTlkZS00YTk4LThkOGItMThmMmQ0ODI2YmY1XkEyXkFqcGdeQXVyNjU1Mzc5Mjc@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "43107aeb-cc76-4743-8674-5d6e0ee13a64",
          "title": "Cash and Curry",
          "episode": 3,
          "description": "Eager to forge new business contacts, Del befriends Vimmal Malik, a wealthy businessman who seems eager to work with Trotters Independent Traders. After a dance at the Camberwell Chamber of Trade, Del and Vimmal are cornered by Mr Ram and his heavy boys. It seems that Vimmal is holding onto a pricey porcelain family heirloom that belongs to the Ram family - and they want it back. In order to make an impression, Del offers to mediate between the two men, especially because Mr Ram is willing to pay four grand for the return of the statue to his family. Unluckily for Del the four grand is just a ruse and he ends up losing a fortune to Vimmal and Mr Ram, a couple of con men touring the country using the same scam on local businessmen wherever they go.",
          "date": "1981-09-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODI2MjNlYjAtOTk2MC00YjcwLTlkMGYtOTM2ZDU2MTU3YTkwXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "faa039f2-9771-497a-8dc6-e55edfab04cd",
          "title": "The Second Time Around",
          "episode": 4,
          "description": "Del meets Trigger in The Nag's Head, and he's stunned to hear that Pauline Harris, his ex-fiancée, is back in Peckham - twelve years after she left for America. Despite their engagement, Pauline left Del for another Mod with a faster scooter. But with her return, Del is willing to forgive and forget, and it's not long before they are engaged again - much to the disapproval of Rodney and Grandad. Things get worse when Pauline moves into the flat and refuses to do her share of the housework. As her behaviour becomes unbearable, Rodders and Gramps leave for Auntie Rose's cottage in Clacton. Del hears rumours about a recent police investigation into the death of Pauline's former husband (Bobby Finch), and when Pauline urges him to take out life insurance, a frightened Del heads for Clacton, leaving an eviction notice for his fiancée.",
          "date": "1981-09-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTVhZWZlMzgtOTJhYS00Zjg4LWE0MWItMjBiZjkwM2E4MmQ1XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "64c25577-f6cf-4e1c-bac3-753f2344e957",
          "title": "A Slow Bus to Chingford",
          "episode": 5,
          "description": "The trouble starts when Del persuades the local bus company to hand over one of their open-top buses in exchange for Rodney working as a Trainee Nocturnal Security Officer - part of their latest company, Trotter Watch. As part of the deal, Rodney has to suffer the nerve-jangling experience of patrolling the bus station on Tyler Street throughout the night. The next part of Del's scheme is the launch of Trotters' Ethnic Tours: a scenic tour around Chingford and Croydon, taking in such ethnic sights as the Lee Valley Viaduct. And despite a great deal of whinging from his family, Del persuades Rodney to drive the bus, whilst Grandad agrees to distribute the publicity leaflets. But when nobody turns up to the launch of Trotters' Ethnic Tours, it is revealed that Grandad shares the legendary Trotter business acumen and has posted the advertising leaflets through the dust chute of Mandela House.",
          "date": "1981-10-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMGNlYjZjNjAtMGIyMy00MTc3LWE1NTctYTlhMzUyZWQ3ZjM2L2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "c9f0d183-961d-4212-8d00-d9ccf7cb8440",
          "title": "The Russians Are Coming",
          "episode": 6,
          "description": "Another successful dodgy deal means Del has over a grand's worth of lead from a disused factory to get rid of. When Rodney points out the three tons of lead are in fact a D.I.Y nuclear fall-out shelter, Del refuses to believe him until he reads the accompanying brochure. With the threat of nuclear holocaust preying on Rodney's nerves he asks Del what he'd do if he heard the four minute warning. Without an answer, Del considers putting a survival plan into action that means reaching Grandad's allotment in time to take shelter. It's during a practice run for the Trotter counter-strike survival plan that they get stopped for speeding by the police - they never get to find out whether they'd make it in time.",
          "date": "1981-10-12T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNGNhMmRhZDUtYmRjNS00YTRmLWFkYTEtOGJmZjRjZmJiZjJkXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "42e8941f-b899-4cfb-b9d5-c72ae03274d9",
          "title": "Christmas Crackers",
          "episode": 7,
          "description": "Rodney has ran out of yuletide cheer, as the annual routing of the Trotter festivities are wearing thin. Burnt turkey, charred Christmas pudding, the same old things on television, and nothing but a book lent to him by Mickey Pierce: 'Body Language: The Lost Art.' When Grandad puts on his glad rags and heads to the OAPs' party at the community centre, the Trotter boys head to The Monte Carlo Club. Rodney puts his new-found knowledge of the unspoken language of love to use, but Del Boy has other ideas. As the brothers argue over who's technique is best, the objects of their affections are whisked away from under their noses.",
          "date": "1981-12-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BN2U5NDMzNDAtYTg5My00OWEzLThlMWItZTdjNTMxYzRkYjA3XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "ba649b14-295e-4bd1-a315-d5667b7d0d44",
      "season": 2,
      "episodes": [
        {
          "id": "3e6cf672-2492-405e-a97b-01437c1fb42c",
          "title": "The Long Legs of the Law",
          "episode": 1,
          "description": "Del and Grandad are horrified to hear that Rodney is dating a police officer called Sandra. But while Grandad is worried about Sandra knowing about the Trotters' sullied reputation, Del is sweating over the amount of dodgy gear stored in the flat. At the end of their date at the cinema, Rodders brings Sandra back to the flat for a nightcap. As soon as she arrives, Del spots her wearing a stolen watch that Rodney has given her as a gift. Thinking fast, he 'accidentally' pours gin over it and promises to buy her a replacement. Ever the gent, Rodney offers to walk her home, and everything appears to be forgiven. But as Sandra says goodbye, she tells Rodney he has 24 hours to empty the flat of stolen goods belonging to Trotters' Independent Traders before she notifies CID.",
          "date": "1982-10-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMmZhOTc4ZDMtMzE2YS00MjQ3LTk5YzktYTczOTQzMzliYjAwXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "4a420edc-ceb1-4e33-8918-65987a1037d7",
          "title": "Ashes to Ashes",
          "episode": 2,
          "description": "Trigger is feeling sad after the death of his grandmother, and the Trotters console him. Del, being ever-helpful and out to spot a potential 'earner', sees two old urns at the grandmother's house and persuades Trigger to part with them. When it later transpires that one of the urns actually contains the ashes of Trigger's late grandfather, they feel it's best to do the right thing and dispose of his mortal remains in the most appropriate manner possible - though this isn't as easy as they first thought.",
          "date": "1982-10-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYTA3NDliMTEtZThlYi00NGUzLTlmZTktNzhmNWYwYmQwZDJlXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "a051b791-4439-4a03-afb0-ae56ed4fe8ef",
          "title": "A Losing Streak",
          "episode": 3,
          "description": "Del is getting into financial trouble - even his double-headed coin can't help him win. He's gambling away his money with no sign of stopping, and he's already £150 down. Nevertheless, when Boycie challenges him to a winner-takes-all poker game, Del is eager to host it in his flat in Mandela House. As the night progresses, Del's luck goes from bad to worse as he ends up owing Boycie all his money, the TITCO van, Grandad's cash, jewellery and even a collection of loose change. But all is not lost, as Del finally turns the tables on Boycie in revenge for fixing all the previous card games in his favour.",
          "date": "1982-11-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNmY1YTU4MDQtM2Y5Ny00YjRlLWE2NDMtZTZhYWU5NTQ2OTdlL2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "6332716d-1226-4ef7-99a2-18e9946dbd1e",
          "title": "No Greater Love...",
          "episode": 4,
          "description": "Del becomes worried once more about Rodney's love life - and his latest dodgy 'bird'. This time though, Rodney has uncharacteristically fallen for Irene, a woman much older than him - and who just happens to be married. Worse still, her husband is a hardened-criminal who is soon to be released from prison. Del needs to think fast to 'rescue' Rodney - but will he get him out of harm's way in time?",
          "date": "1982-11-10T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMGQ0ODU3YzYtNDU4MS00ZmNkLWJhNjUtN2E2ZDMzNjRhNjgwXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "efb84eac-f571-4e09-b840-37ad4d857566",
          "title": "The Yellow Peril",
          "episode": 5,
          "description": "When Del arranges a job redecorating a Chinese Restaurant, he unwisely decides to employ the services of Rodney 'Leonardo' Trotter and buys some paint from Trigger. It's also nearing the anniversary of their mother's death, and in an attempt to save a bit of cash, Del swipes a bit of spare paint to spruce up her tombstone. While Del leaves Grandad and Rodney to paint the grease-filled Chinese kitchen with 'gold' paint, he heads off to decorate the tombstone. It's only when they've finished painting and get a call from the owner of the Chinese restaurant that they realise the paint was actually luminous yellow. Fine for the walls of a Chinese restaurant kitchen, and it certainly makes a gravestone stand out on a dark night.",
          "date": "1982-11-17T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjc0MDEyOWMtNWE3YS00MTUyLWI4MTAtYWY1NmRiNjJhYTQzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "7a499b2d-5192-4be6-98e2-9798f45f6867",
          "title": "It Never Rains....",
          "episode": 6,
          "description": "Trotters' Independent Trading Company has been forced off the market, with the continuing downpour keeping most of Peckham indoors. While drowning their sorrows in The Nag's Head, Alex the travel agent mentions that business is slow and he can't give holidays away at the moment. As a promotional gimmick, Del suggests offering an 80% discount on a holiday to the next customer in the shop - and who happens to walk by, but Derek Trotter. Having sold sun-hats in the rain, Rodders has managed to earn some travel cash, but he is dismayed to learn that the 80% discount only extends to a grotty hotel in Benidorm. And despite not being included in the bargain, the brothers reluctantly pay for Grandad to join them on their escape to the sun. During the whole holiday, Del and Rodney check out the local talent, while Grandad cramps their style. Especially when they bring two girls back to their apartment, only for the old man to scare them off with his dentures. Things get a bit more serious when Grandad gets himself arrested. Despite fearing that old history is returning to haunt him - in the form of an incident 'during the war' - it turns out that he was arrested for jay-walking and is released without charge. Much to Del's annoyance.",
          "date": "1982-11-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNGQ2NzU4ZDItOTdiNC00Mzk0LWIxMjctYmNmMzFkODY5OGM3XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "a94e73d9-d767-4d64-8fec-dd93d7cb11f1",
          "title": "A Touch of Glass",
          "episode": 7,
          "description": "Returning from an auction, the Trotters stop to help a woman whose car appears to have broken down. It turns out she is a posh sort. No less than Lady Ridgemere, wife of Lord Ridgemere who own the Ridgemere Hall Estate. Having towed the Lady to her stately home, Del overhears that the Lord of the Manor is having trouble with the firm he's hired to clean their chandeliers. He wastes no time in offering the Trotter's services as chandelier cleaners for a mere £350. With Rodney and Del up ladders, and an old sheet the only thing between the cut-glass chandelier and the floor, it is only natural that Grandad detaches the chandelier from the room behind them. Del's fast talking excuses are the Trotters' only chance they have of escape!",
          "date": "1982-12-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTBlM2EwY2YtMzZkMy00YmFlLThkZjQtZWM3ZTA5ZTM3YTQzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "3b210b16-eda3-435e-965e-b388db5d1318",
          "title": "Diamonds Are for Heather",
          "episode": 8,
          "description": "Derek Trotter has the Yuletide Blues, and drinks away his loneliness in Spanish night at The Nag's Head. There he meets Heather, who seems to be one friend short of company. Del Boy, ever the gentleman, entertains her and sees her home safely. At her flat he discovers that she has a young son, to a husband who seems to have joined a very long queue at the Job Centre 18 months ago and not come back. In no time at all their romance blossoms, and all is running so smoothly Del decides to propose. However, when he takes her for a candle-lit curry, she refuses his offer of marriage. Her husband has returned, employed as a department store Santa, and she wants to give it another go... leaving Del Boy without an angel for Christmas.",
          "date": "1982-12-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOWE3MWNjMjktN2FmOC00YzcxLTlhM2YtZmRmODIxYjk0MzNjXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "d04cc8c5-6335-4e66-86a5-e401d178df6d",
      "season": 3,
      "episodes": [
        {
          "id": "9f5b8d34-6cdf-4881-b9f1-30e6aab45ea9",
          "title": "Homesick",
          "episode": 1,
          "description": "The wear and tear of climbing twelve floors in Mandela House takes its toll as Grandad's legs finally give way. And after a visit to the Doctors' it is recommended that they seek some different housing for the Trotter family - on the ground floor! Rodney has just been elected Chairman of the Housing Committee, and with a little pressure from Del, he persuades housing and welfare co-ordinator Miss Mackenzie to move the Trotters into a three-bedroom bungalow in Herrington Road. All seems hunky dory, until Miss Mackenzie catches Del and Grandad sharing a celebratory dance and cancels the deal. An ashamed Rodney agrees to resign as Chairman of the Committee immediately.",
          "date": "1983-11-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZjQ5NjFjZTMtNzg0ZC00Y2Q0LWFhZmQtZTgyNDI2ZGU2YzgzL2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "33cf8d63-1020-476e-b9d9-8fd50233b3cf",
          "title": "Healthy Competition",
          "episode": 2,
          "description": "Rodney takes the bold decision to leave Trotters' Independent Traders to go it alone... with Mickey Pearce. But, without Del's financial assistance, he soon begins to struggle and needs a miracle to survive. However, when the chance comes to use all his available money to buy something potentially valuable at an auction - which might change his fortunes and prove Del wrong - he has a big decision to make.",
          "date": "1983-11-16T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZTJiZDRiN2MtMzJhZi00MTU1LTg4ZGItNjAzODYxODgzMWRhXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "a518386c-9877-48ab-b901-292e240e3ea2",
          "title": "Friday the 14th",
          "episode": 3,
          "description": "A fishing trip to Cornwall is on the cards for the Trotters, with a stay in Boycie's empty weekend cottage. However, on arriving on a dark, stormy night with powerlines in the area down, they are stopped in a police roadblock and informed that an escapee from the local hospital for the criminally insane is on the loose. Could this be the start of a horror story for the unwitting Trotters?",
          "date": "1983-11-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYzQ2NTM4NjEtYWYzZi00YzcxLWEzZDUtYWQ1ZDUyYTVjZmM4XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "c58444fa-4d2a-4276-9722-923bde69a2bf",
          "title": "Yesterday Never Comes",
          "episode": 4,
          "description": "Del Boy enters the world of fine art when he attempts to pull the wool over 'posh tart' antique dealer Miranda Davenport. He unsuccessfully tries to tell her a rickety old cabinet is in fact a 'Queen Anne' original, but wise to the ruse, she coolly declines. Her attitude towards Del does warm when she responds to an advertisement placed by the Trotters in the local paper. When a painting Del has in stock catches her eye, Miranda soon worms her way into Del's affections and in no time at all, he has given her the painting as a gift. Keen to see her again, Del pays a visit to her shop, and is informed that she's at the local auction house. Arriving at the auction, Miranda seems quite surprised to see him there, but not as half as surprised as Del Boy when Lot 24 is announced. The Lot turns out to be Del's painting - a valuable work by 19th century painter Joshua Blythe that Miranda is hoping to make a huge profit on. It seems like Miranda has stung Del good and proper, but as usual, he has the last laugh when he informs her that she's actually selling stolen property.",
          "date": "1983-11-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOGJmYWZlZmYtNjI2Ni00MGZiLWJkYjMtOWFlOWQyMDMxZmY0XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "fc559f96-ef2d-40ea-b03b-d4ad3b8d3433",
          "title": "May the Force Be with You",
          "episode": 5,
          "description": "Del Boy's arch-enemy from school turns up in Peckham, but this time he's known as Detective Inspector Slater from the Met Police. Having known Del and his wily ways since they were at school together, Slater knows exactly who to watch when he's on the trail of some stolen microwaves. Hapless Rodney has no idea who Slater is when he gets chatting to him in The Nags Head. It's only when he sees the horror on Del's face, after bringing Slater back to the flat for a reunion meal, that Rodney realises something is wrong Despite Rodney's best efforts, the game appears to be up - one of the microwaves in question is sitting on the sideboard in full view of everybody. Slater immediately begins to question Del, and after threatening Rodney with fictitious drug charges, he forces Del to turn snitch. Much against his better judgement, Del decides to protect his little brother and spills the beans, but only after bartering for immunity for the whole Trotter family.",
          "date": "1983-12-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjZhNjY2ZjctN2EyYi00NmI5LThlMmMtNjFiNWQzOWIwNjJlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "6dec40bd-cbbe-4eb9-b31f-477b4d8f7aa5",
          "title": "Wanted",
          "episode": 6,
          "description": "When Rodney helps a drunken woman on the street, he is stunned when she looks petrified, accuses him of man-handling her, and promptly cries \"rape!\" Without thinking straight, and fearing the consequences, Rodders decides to leg it. Del hears about the escapade and realises his naïve Little Bruv must have encountered Blossom, a psychologically unhinged woman who is allowed out in public on weekend breaks. Not wanting to prey on Rodney's nervous disposition, Del naturally does the humane thing and concocts a story about the police conducting a search for 'The Peckham Pouncer'. It's not long before Rodney disappears, believing he's a fugitive wanted for the worst of reasons. Regretting what he's done, Del Boy goes in search of his brother, and it's not long before the scent of 'funny fags' from the air vents of Mandela House leads him to Rodney's hiding place - in the water tank room of the same building.",
          "date": "1983-12-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOWYwZjQ2MDctNGEwMy00OWYwLWEyMDUtZjBjM2RkYTc3NjdiXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "9c922f64-2bf4-4bca-ae83-8835746d1109",
          "title": "Who's a Pretty Boy?",
          "episode": 7,
          "description": "Del is determined to get his revenge on big-headed Irish painter and decorator Brendan O'Shaughnessy for flogging him some dodgy paint. So, when he learns of Brendan's plans to redecorate Denzil and Corrine's living room, he convinces them of the Trotters' credentials to do the job better. Corrine isn't impressed, but the Trotters get the job anyway. Left alone in the flat to decorate, with only Corrine's beloved pet canary for company, what could possibly go wrong...",
          "date": "1983-12-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODllYWY2MTAtMzJmMC00YTk2LWIyZjctZWJjM2I4Yzc2MDc5XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "e21754c2-1126-4c9a-a408-73772823a3fe",
          "title": "Thicker Than Water",
          "episode": 8,
          "description": "When Del and Rodney's estranged father shows up on Christmas Day after an eighteen-year absence, the Trotter family is suddenly thrown into turmoil. Worse still, he claims he has an hereditary disease that could also affect Del and Rodney. However, following blood tests, it comes to light that this might not be the brothers' only problem...",
          "date": "1983-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDQxNjRjNjgtNjg1NC00MzcwLWI4YTAtYTMxNzFiYjg3OWQyXkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "6f755b17-8cd8-466e-a7a9-5d3e6a91a3a0",
      "season": 4,
      "episodes": [
        {
          "id": "8dd12faa-82cc-433a-919c-55452695fb8a",
          "title": "Happy Returns",
          "episode": 1,
          "description": "Derek stops a young boy, Jason, from running into the road, and strikes up a friendship with the lad. It's not long before Del discovers that Jason's mother, June, is an old flame who he last saw around nineteen years ago. While Del and June rekindle their romance, Rodders is dating a lovely girl from the newsagent called Debby - a fact that is seriously curtailing his dirty magazine fetish. It soon transpires that Debby is June's daughter, and it's almost her 19th birthday. Del and Rodney soon put two and two together, and decide that Debby may well be Del's daughter. It gets worse when Rodney realises that he has fallen for a girl who could be his niece. Everything comes to a head when Del finally confronts June to find out whether Debby is his daughter or not. It turns out that Debby was actually fathered by his friend Albie Littlewood, who tragically died in a cycling accident whilst he was seeing June behind Del's back.",
          "date": "1985-02-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjBhMWI5MjAtOWJhZC00OWNiLTlhODMtMmMxNTdiZTEzMDI5XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "c5c5a375-ddfc-4b52-af10-5422ba220f37",
          "title": "Strained Relations",
          "episode": 2,
          "description": "Grandad has suddenly and sadly died, and Del, Rodney and co attend his funeral - also attended by the north London branch of the Trotter family. Once the wake is over at the flat, it seems one member of the extended family has quietly stayed on incognito - their Grandad's brother, the navy veteran Uncle Albert. When it transpires that Albert is now homeless, the Trotter brothers are left in a moral dilemma that tests their resolve with this cunning old salty sea-dog.",
          "date": "1985-02-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzJmN2M0MTctMmJmYy00ODk4LWFkNDUtZDljNjFkNGU2YmU5XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "c0ff594f-9820-484d-a316-9f269f78ae57",
          "title": "Hole in One",
          "episode": 3,
          "description": "The Trotter's have fallen on hard times, largely due to Rodney's £500 investment in suntan lotion during one of the worst winters ever seen. To make things worse, the deep-fat fryer they sold to Mike, landlord of The Nag's Head, is on the blink and the tension brings Del and Rodney to boiling point. But throughout all this trouble, Uncle Albert, who Rodders blames for their bad luck, keeps telling them that something will turn up. As Albert leaves the pub, he accidentally falls through an open cellar door, and the Trotters' quickly come up with a way to get some cash - by suing the pub for damages. Albert's accident claim finally makes it to court, but to the shock of Del and Rodney, it appears that their Uncle has already sought 15 identical damages claims going back to 1944. Their case gets chucked out of court, and Albert admits he was using some of the tricks he learnt in parachute training to try and help Del and Rodney pay for Grandad's headstone.",
          "date": "1985-03-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNzBkZmQ4ODktNjg2Yy00MzlhLWIzMWQtMTllZTVjNzRmMzdhXkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "213c8534-7ec5-4b68-8f0f-c6a6ccebc698",
          "title": "It's Only Rock and Roll",
          "episode": 4,
          "description": "Rodney has joined a new band, and Del immediately capitalises on this by booking them into The Shamrock Club to play for the St Patrick's night festivities. Taking his place as the band's manager, Del winces his way through their rehearsals, and when the Shamrock gig results in a fight, the band are forced to leg it, leaving the instruments behind them. When Rodney finds out the musical equipment has vanished, he contacts the police and helps them with their enquiries. When tell sees Rodney with the constable, he quickly distracts the officer and pulls Rodney aside. It turns out that Del had the instruments on sale or return, and he'd taken them back because their band was so bad. Rodney's dreams of showbiz fame have been shattered, but he goes ballistic when he sees his group performing their old hit single on Top of the Pops and realises that without Del's interference he might have made it to number one.",
          "date": "1985-03-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDZjZDc3NGYtZjNmNy00OTQ1LWJmOGYtYzc1M2E4NzUwM2I4XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "2253741c-c797-4676-b9fd-6895997adcc5",
          "title": "Sleeping Dogs Lie",
          "episode": 5,
          "description": "In an attempt to earn an easy £60 a week, Del persuades Boycie and Marlene to entrust him with the care of their Great Dane puppy, Duke, while they are away on holiday. Whilst out on a walk, Rodney notices that the dog is a bit sluggish, and they decide to take it to the vets. Del and Rodney think that the dog may have eaten some reheated pork leftovers for breakfast, and the vet quickly informs them that Duke has probably caught Salmonella. It's only when they get home that they realise Albert has eaten the other half of the pork, and they quickly rush him to hospital. When Albert's gets discharged from hospital a few days later, with a clean bill of health, Del boy discovers that Rodney has been giving Albert's sleeping pills to Duke, and the dog's vitamin supplements to Albert.",
          "date": "1985-03-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDM3MzMzMGQtZjc2Ny00YmYzLTk3ZDMtMTIwZDY1NWI3ZThmXkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "5e0bbadf-930e-4a2b-b815-84e001bb10cf",
          "title": "Watching the Girls Go By",
          "episode": 6,
          "description": "Rodney is taking some stick from the lads down the pub about his 'imaginary' girlfriend, and Mickey Pearce bets him fifty that he won't bring a girl to the Saturday night bash in The Nag's Head. When Rodney admits to Del that he was lying about the girl he's going to bring on Saturday night, his big brother sets about trying to get him a date. On the Friday night, the two brothers head out clubbing, and despite trying almost every club in London, they end up in a seedy little bar in search of a date for Rodney. As luck would have it, Del boy spots Yvonne, an old flame who he knows isn't too picky who she goes out with, and he offers to pay her part of the winnings from Rodney's bet if she'll escort his little bruv the following night. When Rodney gets home from The Nag's Head on Saturday night he's in tears. Apparently, the date went well, until halfway through the evening when Yvonne takes centre stage in the pub and begins her act as a stripper - in front of all of Rodney's mates. Del boy tries to console Rodders with the thought of his £50 winnings, but it turns out the bet was for fifty pence, not pounds.",
          "date": "1985-03-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTNiYjM4YWMtYTE1Ny00NWYwLTkwMTYtN2E0OGIzMDE3MmViXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "2a8f41d6-1ff0-4159-bc86-0b04114c3273",
          "title": "As One Door Closes",
          "episode": 7,
          "description": "The trouble starts when Del agrees to provide painter and decorator Brendan O'Shaughnessy with enough louvre doors to refit an entire housing estate in Nunhead. Del's supplier, Teddy Cummings, only stocks and supplies in bulk, so it's up to the Trotters to find two grand by the next day or there's no chance of getting the doors. As usual, a solution turns up in the form of Denzil's redundancy money, which they somehow convince him to part with, only to be told by O'Shaughnessy that the doors he's bought aren't needed. And to make things worse, the doors turn out to be stolen. It's not long before Denzil and his five brothers come looking for their money, so with nowhere else to go, the Trotters visit their mother's grave - a favourite refuge for Del in times of trouble. At their mother's graveside, Rodney notices a rare butterfly from the cover of his magazine, that's worth about £3,000 to collectors.",
          "date": "1985-04-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYzkwY2Q4MTgtYmQ0Yy00NzY1LTgyMmQtNDMzNmFkMDkwYWMxXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "f84c10ec-54de-4f3e-84d4-299bcf8f2545",
          "title": "To Hull and Back",
          "episode": 8,
          "description": "Boycie and Abdul pitch a diamond scam to Del Boy, who immediately turns them down. That is until they offer him a £15,000 cut of the estimated £150,000 sale of the stone on the UK market. Del finds himself designated as the courier between Holland and Britain. No sooner has Del enlisted a reluctant Rodders, he hears his old foil Chief Inspector Slater is eyeing Boycie and Abdul as drug dealers. Del decides to hide undetected in the back of Denzil's van. Denzil then getting in and driving them to Hull (pursued by Rodney) was not part of the plan. Thinking quickly, they hire a boat, and let Uncle Albert guide them to Amsterdam. Overcoming counterfeit cash, Albert's amnesia, it's only the arrival of Slater that scuppers them. Despite this, it's Del who has the last laugh.",
          "date": "1985-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTdkMGZmMDQtMjMxZi00ODE0LTg0NzItOWU5ZWE3Yzc3ODkxXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "757199ec-9aaa-4462-91d1-3392cb758ebb",
      "season": 5,
      "episodes": [
        {
          "id": "a95816ab-9779-43f6-9d9c-042c82951892",
          "title": "From Prussia with Love",
          "episode": 1,
          "description": "It's closing time at The Nag's Head, and Mike the landlord is having problems clearing everyone out, particularly a young pregnant foreign girl who doesn't seem to speak Peckham English. Del and Rodney offer to help, and despite Del Boy's dodgy French, they work out that Anna is from Germany, and she's been chucked out on the street and was considering getting her child adopted. They leave Rodney to take Anna to a hotel, but he ends up bringing her back to the flat, where she explains that, Spencer, the son of the family she was working for as an au pair got her pregnant and then denied it all. After fuming about Rodney bringing another 'waif and stray' home, Del Boy considers what can be done with Anna's unwanted baby - and the first person he thinks of is Boycie. For year's Marlene and Boycie have been trying for a child, with no success, and now for a mere three grand, Del is offering them the chance to have their very own baby boy. The stress is clearly getting to Anna, and she begins to go into labour. Later on Del, Boycie and Marlene all gather round in the lounge waiting for Anna and Rodney return from hospital. All is well until Rodney lets Del Boy know that the Anna's baby is a girl... and that Spencer's parents were actually West Indian.",
          "date": "1986-08-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTliMTdjZTYtZDQyZS00N2EwLWFiNTgtM2JlOTNhNDZhZmYxXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "5bf3f91e-e2b9-49c2-997e-3591e128860b",
          "title": "The Miracle of Peckham",
          "episode": 2,
          "description": "Rodney and Uncle Albert are astonished when Del gets dressed up in his best suit, and announces he's going to church. While he's there, the parish priest is sad to tell him that the hospice connected with his church may be forced to close, unless a substantial amount of money can be raised. It seems only a miracle will be able to save it - but can divine intervention really strike in Peckham?",
          "date": "1986-09-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDExOTU1YzgtOWE1ZS00MGJhLWI3YWUtNjcwOWViYWVhZTZiXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "55fe257a-9436-421a-a083-1f404acf4cc5",
          "title": "The Longest Night",
          "episode": 3,
          "description": "Del, Rodney, and Albert are mistakenly apprehended as shoplifters by an overzealous security guard at the Top Buy Supermarket. And things get worse when they're taken to the manager's office and realise that they've lost their receipt for the goods. Shortly after, Tom the security guard brings a cocky shoplifter, Lennox Gilbey, into the manager's office, where he promptly pulls out a gun and demands money from the safe. Unluckily for Lennox the safe is on a time-lock and due to the dodgy watch he's wearing, he's 15 minutes later than he planned - and the safe doesn't open until 8am the next morning. After being held hostage throughout the night, Del realises that he sold the dodgy watch to Lennox, and that he also knew him as a kid. By preying on his guilty conscience, Del persuades Lennox to reveal that the plan was hatched by Tom and the supermarket manager to get at the £60,000 stored in the safe. The three accomplices beg Del not to go to the police, and instead, he arranges for Lennox to get a job as security guard at the supermarket after Tom's retirement, and then makes sure he wins a £1,000 prize as the millionth customer in the store.",
          "date": "1986-09-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODkyYTNmNTQtZDQ0My00OGRhLWFhYTctZWQ4NzdiZDc1ODk2XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "73d1e465-83d7-4fe2-82ed-4219236960ab",
          "title": "Tea for Three",
          "episode": 4,
          "description": "Trigger's young niece, Lisa, is staying with him for a while, and the scruffy young girl that Del and Rodney remember has now become a stunning 25 year-old woman. Both Trotter brothers think they are in with a chance, and immediately begin competing for Lisa's affections. Despite almost coming to blows, Del and Rodney manage to invite Lisa round to the flat for tea, and she seems more than happy to accept. In preparation for their date with Lisa, Del goes out to get some more 'Smash' and Rodney spends half-an-hour on the sunbed. Just before Del leaves for the shops, he notices Rodney has dozed off and whacks up the heat on the bed. Much to Rodney's annoyance, he spends most of the evening nursing his bright red face, which has burnt under the ultra-violet rays, whilst Del and Lisa seem to be getting on really well. To get his revenge, Rodders picks up on the fact that Lisa mentions she was going hang-gliding, and as a surprise for his 46th birthday, he arranges for Del to have a go. After offering to give her a left back home to Winchester, Del and Rodney head off to meet Lisa's friends for a spot of hang-gliding. Not wanting to loose face, Del reluctantly agrees to try it out, and after launching himself into the air, he disappears for over 12 hours.",
          "date": "1986-09-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYjRkOWQzMzYtYWRjMS00MTEyLTk5N2YtYmE0NzU1NWVjMTQ5XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "86f7e21a-4ddc-4c96-b5c1-004adfd721c6",
          "title": "Video Nasty",
          "episode": 5,
          "description": "Rodney's Art Class is given a £10,000 grant to make a film spotlighting the local community, but first he has to avoid the scheming intentions of Mickey Pearce and Del Boy. Whilst Rodders suffers from writer's block, Del provides him with inspiration and a tale of a killer Rhino escaping from London Zoo and laying waste to innocent victims on the streets of the city. Rodney immediately points out the flaws in the logic behind the plot, and Del leaves him to it. But without telling Rodney, Del has already arranged for Mickey to head down to the town hall to film different couples' weddings at £50 a time - and he has also managed to persuade half the neighbourhood to pay £10 for the opportunity of becoming an movie extra. To make things worse, Mickey arranges for the lovely Amanda to pop round the Trotters' flat in her nurse's uniform and begin filming a 'blue movie' called Night Nurse, which is due for its premiere in the back room of The Nag's Head.",
          "date": "1986-09-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMGZmMjVmNzAtMTcyYi00YWE0LWIyNGEtZTY3YTY0ZWI2ZTMwXkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "e1da3b80-221d-4626-970e-b036ebd65644",
          "title": "Who Wants to Be a Millionaire?",
          "episode": 6,
          "description": "Del Boy's old pal Jumbo Mills is back with tales of his booming business in Australia. What's more he wants Del to go back down under with him as his partner in the enterprise. Could Del really leave Peckham for good?",
          "date": "1986-10-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYzY3OTI4YWUtODk1MS00YzYyLTk2OWQtNzU1ZTg1NDUzY2QwXkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "f6be2d23-3c32-43ce-9d7b-7f8a4d67ba2e",
          "title": "A Royal Flush",
          "episode": 7,
          "description": "Rodney meets Vicky, a seemingly impoverished artist who it transpires is the daughter of the Duke of Maylebury. Having obtained a pair of tickets to the sold-out production of Carmen, Rodders seems to have deeply impressed Vicky. She is less taken by the presence of Del and his peroxide blonde dolly bird. Especially when they open the crisps. Vicky then invites Rodney to a party at the Duke's country home, and it seems romance may be on the cards. Then Del Boy turns up, hits the vino-plonko and ruins everything for his little brother.",
          "date": "1986-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BN2Y3ZDIyMGEtNjc4Yi00NGNhLTkxNGUtZTY5Mzg0MTdmNjAzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "f62b7d63-7bb5-4bb3-b494-5f78a96aae54",
          "title": "The Frog's Legacy",
          "episode": 8,
          "description": "Trotters Independent Trading is causing mayhem with their faulty RAJAH computers. Rodders gets a new job at a funeral directors, while Albert and Del hit the health market with their miracle cure body massagers. At the wedding of Trigger's niece, the Trotters hear the tale of Freddy the Frog, a bank robber and close friend of the boys' mother. He left everything in his will to their mum, including missing gold bullion. While Del hunts for treasure, Rodney puzzles over Freddy and his mother's 'friendship' - and a son who would by now be his own age.",
          "date": "1987-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNGRkN2Y5YzktODBhOC00YzA4LWI2NTAtNDVmYTQ0NjI3ZGIzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "27cb36c8-6cb7-441e-97aa-acb505709075",
          "title": "Dates",
          "episode": 9,
          "description": "After witnessing Trigger's unexpected success with his date from a local computer dating agency, Del fancies his chances of having some too. He duly enrolls, and sets out to meet his blind date at Waterloo Station. All seems to go well on their first date at a posh hotel - but have they both been entirely honest with each other?",
          "date": "1988-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTlmOTE5NzQtMzNiNS00MGE3LWEwOTctMmE5NjhlOTRjZjFhXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "3f1837bc-c1b5-4b84-ae0f-9bddabb9feab",
      "season": 6,
      "episodes": [
        {
          "id": "22b797ba-074f-4657-a8ed-80cab27a9c71",
          "title": "Yuppy Love",
          "episode": 1,
          "description": "After seeing the film 'Wall Street' Del fancies himself as Peckham's answer to Gordon Gecko and changes his image. He even - temporarily - gives up the Nag's Head for a trendy wine bar where he is just a little too casual for his own good. Rodney goes on a computer course and meets a nice girl called Cassandra. When she offers him a lift home, he is ashamed to tell her where he lives and gets her to drop him off in an upmarket suburban avenue. She eventually rumbles his deception, but agrees to go on a date anyway.",
          "date": "1989-01-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYzk0YzcwNzctMGU5My00NmQyLWFjZjctMDhkOTYzNjcwMjdjXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "34f2f214-8ae0-4d1c-839d-cd811e29df2c",
          "title": "Danger UXD",
          "episode": 2,
          "description": "Del buys a consignment of blow-up sex dolls to sell on to elderly Dirty Barry, who has a sex shop. Unfortunately, the dolls are filled with propane gas and will explode if they are exposed to heat. When two of the dolls self-inflate in the flat, Del dresses them in his late mother's clothes to get them into the van incognito. However, when he arrives at his destination, Dirty Barry is unable to oblige - as his licence has been revoked by the council.",
          "date": "1989-01-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDMxOWVlMWMtNTI4OC00ODg4LTg0ODMtNzEwYjJkZDRmMWJkXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "0b8132c4-4da2-438f-b25a-8b3a4221e732",
          "title": "Chain Gang",
          "episode": 3,
          "description": "Arnie, a jeweller who retired early on health grounds, sells Del and his mates some gold chains but then says he wants them back for a previous customer. However he will ensure that he gets double the price to satisfy Del and his friends. As he is selling the chains to the other customer, Mr. Stavros, he collapses with a heart attack and is taken away, along with the money and the chains, by two ambulance men. However, it is a con. They are not real ambulance drivers but Arnie's sons, helping him relieve punters of their money. But then Cassandra hears that Arnie is going to sell the chains to Denzil. Cue Del and Co. to pose as ambulance men and wait for Arnie's next 'heart attack.'",
          "date": "1989-01-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BN2M3NzI4NDMtZjNiNS00ODdkLTg4NGEtNGRmZDM2NzgwODA2XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "470fdbeb-ae02-4425-a582-bc7d92906776",
          "title": "The Unlucky Winner Is...",
          "episode": 4,
          "description": "Rodney wins a prize in a competition he didn't even know he'd entered, and he Cassandra are going to sunny Spain as a prize. However, Del Boy's coming too... and not as his brother.",
          "date": "1989-01-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTg0NTk5NDktODExOS00ZGUzLWFkYjQtZGRkZTIxYjE1MDljXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "67280dbb-d92d-44ee-836f-d241d086555b",
          "title": "Sickness & Wealth",
          "episode": 5,
          "description": "Del is having health problems - stomach aches - and the usual cash flow problem, so, to raise money, he organizes a series of séances run by Albert's psychic friend Elsie, who correctly predicts Marlene's pregnancy. When Elsie tells him his mother wants him to go to the doctor about his pains Del reluctantly agrees and ultimately finds he has Irritable Bowel Syndrome, which is not life threatening but requires a very strict health food diet. This is not really to his liking but a bigger shock comes when Rodney tells him he and Cassandra are getting married.",
          "date": "1989-02-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzJhYzU0YjQtNWRjMy00MGNhLTg0YTUtOTAzMDdkYzk2ZDk3XkEyXkFqcGdeQXVyMjc0ODQ0NzM@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "48270f5b-2c1d-436f-980b-6f0058f84aec",
          "title": "Little Problems",
          "episode": 6,
          "description": "Rodney's wedding day is approaching, and Del promises him £2000 as a present. However, Del also owes the Driscoll brothers the same amount - and they want their money. Later during the wedding ceremony, Rodney's middle name is revealed - and laughter ensues.",
          "date": "1989-02-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjMxMWNkZDktZjJiYi00MTczLWJlYjgtYTFkZThhYzU5ODI2XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "9a9b1b98-6933-473f-9ab4-c11680df587b",
          "title": "The Jolly Boys' Outing",
          "episode": 7,
          "description": "The Nag's Head regulars head to the seaside town of Margate for an eventful day trip.",
          "date": "1989-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZjlhOWU3ODMtMWEwZS00ZDliLTk3NmEtYjJiNjVhY2UwNzZiXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "71fa9ff4-93ec-48a9-af23-d3eb30e85078",
      "season": 7,
      "episodes": [
        {
          "id": "4223d916-b221-43a3-86e8-fab5ca4e325e",
          "title": "Rodney Come Home",
          "episode": 1,
          "description": "Rodney and Cassandra's marriage is in trouble - Cassy is ambitious and wants to better herself with her banking colleagues, while Rodney is set in his ways and expects her to be an old-fashioned housewife. After a bust-up, Rodney decides to leave and return to the Trotter household. He still yearns for her though, and is unwisely advised that making her jealous might be the key to winning back her affections. He asks another girl to join him on a date to the cinema - could this be a perfect Hollywood ending for Rodney, or could the curtain finally come down on his marriage?",
          "date": "1990-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDc1NmZjNzktMDNmZC00MGQ5LTg5NjQtYTIzN2UwMjRkYmU5XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "626cf5ee-982f-49a5-aa7f-0398b18b347d",
          "title": "The Sky's the Limit",
          "episode": 2,
          "description": "Boycie's lost a satellite dish and Delboy's come into possession of one. Rodney goes to meet Cassandra at Gatwick Airport but her plane's been diverted to Manchester. Could there be a link connecting these events?",
          "date": "1990-12-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTcxM2ExMGQtNGZlYS00ZDk3LWE5MmItMTI0ZjdiMjZiMzczXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "2c867a18-d574-4ef1-a67f-58b8d1148657",
          "title": "The Chance of a Lunchtime",
          "episode": 3,
          "description": "Del has a consignment of doorbells that play various National Anthems. He tries to help Rodney and Cassandra save their marriage after going round to fix rodneys front door but things don't quite go to plan. Raquel has an audition for a part in a play. She passes the audition but is unable to accept it as she has some news that leaves Del speechless...but not for long.",
          "date": "1991-01-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMDlmZWY0YjItYjU4OC00NmE1LWEwMWQtMGE2OTUwODgwYjBlXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "abeccf2f-8db6-4ce2-9d80-5e01f5ef44f2",
          "title": "Stage Fright",
          "episode": 4,
          "description": "Del tries his hand at being a showbiz manager, and one of his clients is his 3-months pregnant girlfriend Raquel. But will things go to plan?",
          "date": "1991-01-12T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNzE2YmEzYzItNGFkMS00NjZlLTg1YzYtNjdiODEyZjYzZTMzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "22e38d44-9329-4405-b18a-24d5920a457d",
          "title": "The Class of '62",
          "episode": 5,
          "description": "Del is invited to a school reunion with Boycie, Denzil and Trigger. The organiser remains a mystery until disgraced ex-policeman Roy Slater appears. After drinks in the Nag's Head they all repair to the flat where Del discovers that Slater is married to Raquel, who wants a divorce from him. Happily for Del he finds out that Slater is getting a rake-off from the diamond heist for which he served time and uses this to blackmail him into divorcing Raquel.",
          "date": "1991-01-19T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTRkZTBhOGYtZDZlYy00YTg1LWJhNWUtZjQ5Y2Y1MDY1MTZhXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "40da47a5-3c84-4585-bda6-33ce3739720e",
          "title": "He Ain't Heavy, He's My Uncle",
          "episode": 6,
          "description": "Whilst Del employs Rodney in the family firm, Uncle Albert starts going to the Over-60s Club but comes home one day, bruised and claiming that he was mugged. After refusing to go out for a week, he suddenly takes off, leaving a note to imply he has left home. Del and Rodney eventually find him at the new estate built on the street where he was born, and bring him home. When Albert's old mate Knock-Knock arrives at the flat it turns out that there was no mugging but the two old men got into a fight over an old lady, Dora, from their club.",
          "date": "1991-01-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzI4ODAtZWNjYy00NjlkLWE4NjQtNDI5MzJmNWUyOWYzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "053c1a55-6c0f-4c6d-b1a8-4555c76231ee",
          "title": "Three Men, a Woman, and a Baby",
          "episode": 7,
          "description": "Del is hoping to sell a load of wigs bought from Mustapha to the old ladies in the Nag's Head and is annoyed to find out that he has actually bought a box of mens' wigs. Cassandra leaves Rodney, claiming that he lacks drive. He turns vegetarian and sports a clip-on pony-tail to appear trendy but when Cassandra gets back in touch with him she tells him she prefers him just as he is. Raquel gives birth to a baby boy, which Rodney has jokingly suggested be called Damien, a name Del and Raquel are happy to give him. As dusk falls Del communes with his dead mother to tell her of his happiness.",
          "date": "1991-02-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZjczOWE3YzEtMmIyOS00N2QzLTgzYzYtMjUyYWI4YzQyZThjXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "0589c241-7c85-4b4a-8990-b526ca6830d5",
          "title": "Miami Twice: The American Dream",
          "episode": 8,
          "description": "At Damien's christening, Del does a deal with the vicar to supply 'pre-blessed' Romanian altar wine, only it turns out to be white. In an effort to get Rodney back with Cassandra Del suggests a trip to Miami, Del already having bought the tickets with Rodney's pension money. However, Cassandra has a heavy work load and is unable to get time off so the Trotter brothers do Miami together.",
          "date": "1991-12-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOWQ5Y2I1MWUtMTRkMy00MGY0LWIxMmItMjYzY2E2ODE1ZDZiXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "f9372955-0b86-4cb7-830f-79ed632376cd",
          "title": "Miami Twice",
          "episode": 9,
          "description": "The Trotters arrive in Miami, where they are spotted by Mafia Don Vincenzo Occhetti and his sons, the don just happening to be Del's exact double. The Occhettis welcome the brothers but they have a plan. Occhetti is to stand trial for several crimes. If Del is found dead and it is assumed that he is the Mafioso, the don will be in a position to start a new life. Several unsuccessful attempts to kill Del follow, as does an argument between Rodney and Occhetti, whom Rodney believes to be his brother. When Del and Rodney tumble to what is happening they go on the run but are saved by Marlene and Boycie, who are on holiday in Miami. They also supply evidence of the Occhettis' drug-dealing. Back home in Peckham Del finds the crates of wine stacked up in his flat but the television news tells him that, thanks to his efforts, Occhetti has been imprisoned.",
          "date": "1991-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZGM2YTk2ODktMzhlYS00NTVkLTg1N2EtZWMwMmQ1NmRjMTgwXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "1abed9f5-9270-4bfd-8af8-258d1eb4bf6f",
          "title": "Mother Nature's Son",
          "episode": 10,
          "description": "Strapped for cash as ever, Del is clearing Grandad's allotment, which has become a health hazard and where he finds some bottles of yellow liquid, which he dumps. He also finds a tap, hidden by rocks, but claims that there is an actual spring, yielding 'Peckham Spring Water'. Using a bottle of mineral water for the lab test he gets the water accepted and sold to a supermarket chain. Unfortunately he is unaware that it has been contaminated by the same yellow liquid he chucked in the reservoir and, as he turns out the light, the water starts to glow green.",
          "date": "1992-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYWFmZDRiNTMtOGRmYS00YjMyLWIyOGQtODYxMDViOWY1NjNjXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "79dd8428-6204-4c9b-8e9e-69a199bf5daf",
          "title": "Fatal Extraction",
          "episode": 11,
          "description": "After a visit to the dentist Del unwisely makes a date with the comely receptionist Beverley, but, on Rodney's advice, cancels it. After Del has got drunk and been responsible for causing a riot, he finds Beverley at his flat and fears that she has come for revenge, though she has only come to buy Damien's old high chair. In exchange she gives Del an answer-phone, and, come Christmas Day, he will live to regret this.",
          "date": "1993-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDE1YTdhNzctM2RmNS00ZWY4LWI5MjYtMGEyNGRhMjUwNTViXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "36c207ae-dbdb-4682-bcee-baf43af15787",
      "season": 8,
      "episodes": [
        {
          "id": "7994e035-4dc6-4ecc-a522-7872d6fcccbb",
          "title": "Heroes and Villains",
          "episode": 1,
          "description": "Del has applied for a council grant but been turned down. After giving Rodney a bracelet for his birthday inscribed 'Rooney', Del drives Rodney to a fancy dress party where they are dressed as Batman and Robin. However the Reliant Robin breaks down and, as the brothers are running through the fog in costume, they scare off a gang of muggers about to rob a female councillor. At the party they are the only guests in costume because the birthday boy has actually died and the party is now a wake. But there is good news next day when Del catches one of the muggers as he is about to rob an old lady and knocks him unconscious. He gets a medal AND his council grant as a reward for helping the female councillor. Good news for Rodney too as Cassandra announces that she is pregnant.",
          "date": "1996-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BY2UzNzYzNjctNjViOS00MmU4LTg2YzQtZWE1MDE3MTI4YjFiXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "0b18d73e-86e9-49d1-a0e0-79e002ee0328",
          "title": "Modern Men",
          "episode": 2,
          "description": "After reading a book entitled 'Modern Men', Del elects to have a vasectomy but backs out when he finds that the doctor concerned is still angry about the faulty paint he sold him. With Cassandra pregnant Rodney is seeking a better-paid job and answers a newspaper advertisement, only to discover that it is as Del's assistant. Cassandra is rushed to hospital but she miscarries and, whilst comforting Rodney, Del bursts into tears.",
          "date": "1996-12-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDViMmFhMzUtZTgyZS00MGI3LWEzMjQtMzQyNDQ2MGY5Y2QzXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "b4805207-2922-4d8c-b322-28ff4c14e403",
          "title": "Time on Our Hands",
          "episode": 3,
          "description": "Things aren't too good at Nelson Mandela house. Raquel's parents are due to visit for dinner and will be meeting Del for the first time, causing her to panic. Dinner is ultimately ruined after Albert unfortunately mixes up the gravy and coffee jars. Meanwhile, Rodney appears to be struggling to come to terms with Cassandra's miscarriage, causing Del to take extreme steps to get him talking about it. Things begin to look up however, in the shape of an antique watch. Is Del's vision of becoming millionaire finally going to come to pass?",
          "date": "1996-12-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTkwODlkNDItZDJhNS00YzZkLWJhMmYtMDIyM2VlZTQ0NGY0XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    },
    {
      "id": "e6f2132d-ce04-4038-9249-a16fbc18eaba",
      "season": 9,
      "episodes": [
        {
          "id": "0b7c7ae3-4d78-4eb6-b1ea-c1b758c5200b",
          "title": "If They Could See Us Now.....!",
          "episode": 1,
          "description": "Due to bad investment and the Central American stock market crash the Trotters lose all their money. Whilst Rodney and Cassandra spice up their love life by dressing up, Del decides to restore the family wealth by going on the quiz show 'Gold Rush', hosted by Jonathan Ross. He does very well but has to phone Rodney for the answer to the jackpot question, and Rodney gives the wrong answer. Back home Del gets a call from the show to say that Rodney's answer was actually correct so that Del has won the prize money after all. Unfortunately Del thinks it's pub regular Mickey playing a trick on him and tells Ross to give the \"winnings\" to charity...",
          "date": "2001-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYTYyMjI2MzMtZDVlYy00ZWI2LWFlOTItZDQ5ZDA3OThjMzAyXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "390f2d74-ab70-440b-873d-d2ea5d8d7af7",
          "title": "Strangers on the Shore...!",
          "episode": 2,
          "description": "Going to France to scatter the late Uncle Albert's ashes near the village where he spent part of the war, Del decides to kill two birds with one stone and organize a booze cruise. At the village they learn that Albert was a real ladies' man, which could be why most of the menfolk resemble him. Back in Peckham they discover a young man who seems to have stowed away in their van and can only answer \"Gary\" to everything asked of him. In fact he is called Rashid and he was loading the van when he got trapped behind the booze. He was carried to England against his wishes and Del and company get charged with kidnapping him.",
          "date": "2002-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNmU3MWVlNTktYzY1Yi00ODA2LTg4ZjEtODJjOTQyYzAxMzg3XkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        },
        {
          "id": "2eb867ca-3550-4128-b0ac-374fbcda6785",
          "title": "Sleepless in Peckham...!",
          "episode": 3,
          "description": "When Marlene vanishes and Boycie is secretive about her disappearance, people assume he has killed her, but she only went to have a boob job. The Trotters need money to stave off being evicted but are saved when it transpires that Uncle Albert invested his savings wisely and leaves them almost a quarter of a million pounds. Del tells Rodney that his real father was not Reg Trotter but a flash local crook called Freddie 'the Frog' Robdal. Cassandra goes into labour, this time successfully and her baby girl is named Joan after Del and Rodney's mother and with whose spirit the brothers go to commune.",
          "date": "2003-12-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BYWIxNDk3MGUtMTZmMi00N2Q5LWIwOTYtOTlmMmI2MmIxMzJmXkEyXkFqcGdeQXVyNTA4NzExMDg@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4",
          "duration": 12
        }
      ]
    }
  ]
}