{
  "id": "a0705f9a-dec5-4da3-bf11-94a1a34e1d34",
  "description": "Inside the lives of staffers in the West Wing of the White House.",
  "title": "The West Wing",
  "image": "https://m.media-amazon.com/images/M/MV5BNjk3ZWE3ZDctN2Q1YS00NzNhLWFjNmYtZTkwYWQxZmQ3NzM3XkEyXkFqcGdeQXVyNTE1NjY5Mg@@.jpg",
  "genres": [
    2
  ],
  "seasons": [
    {
      "id": "89e67c6f-7f28-45d4-acbd-3c27028a637a",
      "season": 1,
      "episodes": [
        {
          "id": "da92881d-88be-42c6-8cd2-694d0e5fccc4",
          "title": "Pilot",
          "episode": 1,
          "description": "The West Wing staffers are introduced as each learns via phone or pager that the President was in a cycling accident. Josh faces the possible loss of his job after an on-air insult of a political opponent, which Toby tries to prevent by having Josh make a personal apology. Sam's fling the previous night with Laurie, who unbeknownst to Sam is a call girl, puts him in hot water, which he compounds when ineptly lecturing a class of 4th-graders about the White House and then asking their teacher which child is Leo's daughter. Leo must deal with the fallout from Josh's blunder, as well as 137 Cuban refugees who escaped on rafts and are seeking asylum. The president walks in during Josh's apology, recites the First Commandment, and lambastes three Christian pols for not denouncing a fringe group.",
          "date": "1999-09-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjllYTQxNzUtM2VlYy00MjBlLWJmNTAtYTU3MWEzNzhkMTk4XkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "fbe93e8a-a49d-4498-9c22-ab8dfc8f6dda",
          "title": "Post Hoc, Ergo Propter Hoc",
          "episode": 2,
          "description": "Josh trumps a potential Democratic challenger in a masterful political move and then hires the challenger's chief of staff and ex-girlfriend Mandy Hampton. Toby tries to warn Sam away from his friendship with the call girl, but to Toby's horror, Sam seems intent on reforming her. CJ tries to spin the latest clash between President Bartlet and Vice President Hoynes. After an American plane is shot down carrying Bartlet's physician, Bartlet's response leaves Leo worried about the President's response.",
          "date": "1999-09-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzA2NzcxOTc3OV5BMl5BanBnXkFtZTgwMDMwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "9393b10e-d5c0-484b-bb13-2a3868176a0d",
          "title": "A Proportional Response",
          "episode": 3,
          "description": "After being offered \"a proportional response\" to the Syrian military's downing of a U.S. military plane on a medical mission (and carrying his newly named personal physician), the president demands an option that will have greater impact. Leo gradually must talk him down, while Bartlet snipes at everyone, including Abby. The president ultimately agrees to the initial option, but is not happy about it. Charlie Young is introduced as an applicant for a messenger job whom Josh decides to hire as President Bartlet's personal aide.",
          "date": "1999-10-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzQ0NzQ3MDkzMl5BMl5BanBnXkFtZTgwNTcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "3a0fae2e-196a-4e07-b51a-3a876246e53f",
          "title": "Five Votes Down",
          "episode": 4,
          "description": "After a speech touting the success of a gun control bill, the team learns they are actually five votes short. The fight to get them back puts a strain on Leo's marriage and Josh's relationship with numerous Senators. Toby finds out he may have accidentally participated in insider trading.",
          "date": "1999-10-12T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDEyODAyMTUxMF5BMl5BanBnXkFtZTgwMTYxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ccee22d8-8415-4614-9c93-1d02bb564a14",
          "title": "The Crackpots and These Women",
          "episode": 5,
          "description": "On the series' first \"Big Block of Cheese\" Day (nicknamed \"Total Crackpot Day\" by Josh), staffers meet with reps of various organizations causes, e.g., C.J. hosts a group that wants $900 million for a \"wolves only\" highway. The president has everyone to the residence for a homemade chili party, we learn about Mrs. Landingham's past, and Zoey is introduced to the group.",
          "date": "1999-10-19T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjQwNjg1MjI1NF5BMl5BanBnXkFtZTgwOTEwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bdec1869-d0e1-47e5-8588-21ccfd77ac80",
          "title": "Mr. Willis of Ohio",
          "episode": 6,
          "description": "In the first of several episodes throughout the series' run that portrays ordinary Americans and how they interact with and ultimately affect the W.H., an Ohio middle school social studies teacher, a widower who has recently filled the brief remaining term of his late wife in the House, joins two other reps to meet with Toby and Mandy about changes to unfair rules in the U.S. Census written into the latest federal budget. The other two, career politicians, are completely resistant to the changes, but Mr. Willis is swayed by a potent argument Toby makes regarding \"strict constructionism\" (generally conservative and libertarian belief that the U.S. Constitution is not a living document, and must be followed as written, unless officially amended through standard 38-state ratification) and the 14th Amendment. Toby is impressed with the man and his open-mindedness. Elsewhere, Sam tutors C.J. on the finer points of the census. Late in the episode, the staff meets for a late-night poker party.",
          "date": "1999-11-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNzU0OTA3ODM5Nl5BMl5BanBnXkFtZTgwNzAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6c7c7fcc-79ec-4561-897d-459282aaf21f",
          "title": "The State Dinner",
          "episode": 7,
          "description": "While preparing for (and enduring) a state dinner for the newly-elected president of Indonesia, staff deal with a multitude of other problems: Josh and Mandy argue over the best way to handle an FBI standoff with militants in Idaho; Leo (and eventually Bartlet) intervenes in a negotiations between the Teamsters Union and national reps for the trucking industry; Toby tries to convince an Indonesian cabinet member to release a friend of his, an activist or incites anti-government protests, from prison; Sam witnesses Laurie at work as a call girl, serving as the state dinner date for a big fund raiser; and a pre-season hurricane initially threatens the Atlantic Coast, and then moves out to sea, where it puts an entire naval fleet in peril.",
          "date": "1999-11-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjIxMTk2Mjk5N15BMl5BanBnXkFtZTgwNzQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "f367ead8-845d-4005-a000-077028917e6e",
          "title": "Enemies",
          "episode": 8,
          "description": "A crucial banking bill is at risk when political rivals of environmentally sensitive President Bartlet attach a land-use rider to it that would allow strip-mining some of the Montana wilderness. C.J. tries to stamp out rumors that the Chief Executive chastised the Vice President during a cabinet meeting. An overworked Leo isn't too keen on his independent daughter Mallory dating the handsome Sam. C.J. continues to fend-off the romantic charms of a perceptive reporter with a knack for sniffing out juicy stories. Former lovers Mandy and Josh clash over the administration's attempt to jettison the land-use rider that might also ruin passage of the more important banking bill.",
          "date": "1999-11-16T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjAwNzIyMTkxN15BMl5BanBnXkFtZTgwNjUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "274b8e82-dad6-4c2f-9e6b-55f3e6922168",
          "title": "The Short List",
          "episode": 9,
          "description": "When a Supreme Court justice retires, President Bartlet has a golden opportunity to impact the court's composition by nominating a favorite judge but when further study reveals the candidate's conflicting ideology, the President might change his mind and opt for another judge. In addition, a headline seeking congressman on the House Government Oversight Committee accuses the White House staff of substance abuse -- a dicey issue for one important member.",
          "date": "1999-11-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTgxODMwNTAwMF5BMl5BanBnXkFtZTgwMjQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b4174cc2-55cb-40e6-b07d-0f54630a4182",
          "title": "S1.E10 ∙ In Excelsis Deo",
          "episode": 10,
          "description": "When a homeless veteran dies on the National Mall and his body remains uncollected for hours, Toby becomes fixated on getting him a proper burial.",
          "date": "1999-12-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE5MjAzNjI3MV5BMl5BanBnXkFtZTgwODgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "dd485d19-3607-4a16-a71f-6246f1ea0175",
          "title": "S1.E11 ∙ Lord John Marbury",
          "episode": 11,
          "description": "When India sends troops into Kashmir, President Bartlett calls for a British former ambassador to India to help out - over Leo's strong objections.",
          "date": "2000-01-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTYyODI3Mjk5Ml5BMl5BanBnXkFtZTgwMjAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "63ff6134-10f0-457e-baf1-e544796f0c0f",
          "title": "S1.E12 ∙ He Shall, from Time to Time...",
          "episode": 12,
          "description": "When the President collapses on the eve of his State of the Union, it's diagnosed as the flu. But when the First Lady cancels a trip and rushes home to look after him, Leo suspects the first family is hiding something about Bartlett's medical condition.",
          "date": "2000-01-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDA0MTc4MjE3MV5BMl5BanBnXkFtZTgwMjExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "32d6f637-c619-4596-816c-88361e8dd1e1",
          "title": "S1.E13 ∙ Take Out the Trash Day",
          "episode": 13,
          "description": "In preparation for the Friday night briefing for the Saturday papers and news broadcasts -- nicknamed \"take out the trash day\" because it disposes of all the stories the White House doesn't want heavy coverage on, and because Saturday is the least read paper of the week -- the staff take on a variety of chores: C.J. prepares to meet with the family of a Matthew Shepard-type victim of murder just because he was gay, and discovers something unexpected about the young man's reticent father; Josh and Sam contend with an angry Republican house committee leader who wants to make a deal to avoid public hearings on Leo's alcoholism; the president must read and wince through a graphic report on sex education in public schools; Danny pesters C.J. about an aide to the v.p. living on high off of taxpayer dollars.",
          "date": "2000-01-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzQyODEyNzA4M15BMl5BanBnXkFtZTgwMTUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bdc68344-0754-479b-ac14-227add23f967",
          "title": "S1.E14 ∙ Take This Sabbath Day",
          "episode": 14,
          "description": "A drug dealer's appeal of the federal death penalty is rejected by the Supreme Court, which upholds the death sentence with execution scheduled for the following Monday. One of the defense lawyers on the case is Sam's old high school bully, and he appeals directly to Sam to involve the president. During a weekend in which he was supposed to be in a yacht race, Sam opts to stay at the W.H. and try to convince his fellow staffers and ultimately Bartlet that the president should commute the sentence. Meanwhile Josh, after a night of heavy drinking at a bachelor party, meets congressional campaign manager Joey Lucas while is hung over. She assails him for having the DNC cut off funding for her candidate, but the decision was deliberate, as the W.H. likes the conservative nutjob currently holding the Calif. seat. Opinions on the death penalty are exchanged throughout the weekend, including those of Quaker Joey Lucas and Toby's rabbi, and Bartlet winds up calling both the Pope and his old parish priest from N.H. for counsel.",
          "date": "2000-02-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc4MDI2OTM4N15BMl5BanBnXkFtZTgwMjUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "99d07b4e-ca32-412d-b4cc-c7e3ba495d23",
          "title": "S1.E15 ∙ Celestial Navigation",
          "episode": 15,
          "description": "In a lecture at Georgetown, Josh recalls the previous week at the White House, during which he replaced a dentally impaired C.J. in the press room and gave a memorably disastrous briefing, responding to a reporter's question (sarcastically, although taken quite seriously) that the White House had a secret plan to fight inflation. Meanwhile, he's intermittently on the phone with Toby and Sam, who have flown to Connecticut and are now lost in a rental car on the Connecticut Turnpike. They've gone on critical business: the president's nominee for the Supreme Court, Roberto Mendoza, was pulled over by the local police for \"driving while Hispanic\" and refused to take a drunk test, so he was incarcerated. Toby has to talk the judge down from making a big public issue of his arrest by fighting the charges in court.",
          "date": "2000-02-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzQ0Njg5MzkxMl5BMl5BanBnXkFtZTgwNzMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "cc771ea5-ca30-45e5-8342-5796d21cee79",
          "title": "S1.E16 ∙ 20 Hours in L.A.",
          "episode": 16,
          "description": "The President meets Zoey's new bodyguard on a 20-hour trip to California; Josh tries to keep a fund raiser from being canceled; Leo needs the VP to break a 50-50 tie in the Senate.",
          "date": "2000-02-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ5ODIxMDIwMF5BMl5BanBnXkFtZTgwMDgxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "63a8fcc8-a384-402a-af58-9c9196a5ace9",
          "title": "S1.E17 ∙ The White House Pro-Am",
          "episode": 17,
          "description": "When the Federal Reserve Chairman dies, Bartlet must quickly choose a successor in order to avoid financial chaos. However, he is reluctant to pick the obvious choice for Fed Chair, who used to be Abby's boyfriend. The matter is worsened when Danny Concanon receives a quote from the first lady saying she supports her ex-boyfriend, leaving Bartlett more irate. Meanwhile, Josh and Toby are courting congressman in order to get more votes for a bill they already won. However, a congresswoman, who felt 'betrayed' by Abby, poses a threat to the bill.",
          "date": "2000-03-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzM2MjU4M15BMl5BanBnXkFtZTgwMDYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "dcb11673-264a-485f-946d-f13352cabd5c",
          "title": "S1.E18 ∙ Six Meetings Before Lunch",
          "episode": 18,
          "description": "The morning after Mendoza's confirmation, various staff members are brought back to earth by difficult meetings.",
          "date": "2000-04-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTgwMDE4NDg3M15BMl5BanBnXkFtZTgwNjMwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "2faf81bb-3f48-4051-8503-ab16224cf0b3",
          "title": "S1.E19 ∙ Let Bartlet Be Bartlet",
          "episode": 19,
          "description": "The West Wing staff are feeling malaise as it seems they never get anything accomplished. Meanwhile, a leaked memo is a land mine that could embarrass the administration.",
          "date": "2000-04-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI1MjU1ODQ0N15BMl5BanBnXkFtZTgwMDIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "78947eb4-9c64-4bfc-ae60-396ecca28e04",
          "title": "S1.E20 ∙ Mandatory Minimums",
          "episode": 20,
          "description": "A newly energized administration prepares to take on soft money, increase addiction treatment, and remove mandatory minimum sentencing.",
          "date": "2000-05-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUyMzM1MTU2Ml5BMl5BanBnXkFtZTgwMzAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4845b3fb-e41f-40cc-9fdb-7850bef10acc",
          "title": "S1.E21 ∙ Lies, Damn Lies and Statistics",
          "episode": 21,
          "description": "The staff waits for a poll to tell them if their new, activist policies are moving them in the right direction. C.J. feels like her opinions are being discounted.",
          "date": "2000-05-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE5MTQ2NzY2OV5BMl5BanBnXkFtZTgwMDExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "c8c06b19-96a6-4ea7-99ce-007e902bfa28",
          "title": "S1.E22 ∙ What Kind of Day Has It Been",
          "episode": 22,
          "description": "A stealth fighter is shot down over Iraq, leading to Bartlet ordering a military rescue as Toby worries about his brother trapped on a space shuttle orbiting the Earth. CJ deals with the ramifications of misleading the press about the rescue as the staff prepares for a town hall meeting that night. The town hall meeting goes well until the President leaves...and shots ring out.",
          "date": "2000-05-16T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEzMzE2NjAzNF5BMl5BanBnXkFtZTgwNDEyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "03174a53-1397-44bc-9f98-5d4dfb12748c",
      "season": 2,
      "episodes": [
        {
          "id": "c488b16d-286e-4171-b45d-b57fd3d81549",
          "title": "In the Shadow of Two Gunmen: Part I",
          "episode": 1,
          "description": "The President is rushed to hospital following a shooting; staffers field questions on protection measures and executive authority. Flashbacks show how key staff members joined the Bartlet campaign.",
          "date": "2000-10-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ5MjgzNTA0NV5BMl5BanBnXkFtZTgwMzgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "142b5e29-e0ba-4f44-a737-b73bcafd2751",
          "title": "In the Shadow of Two Gunmen: Part II",
          "episode": 2,
          "description": "A suspect in the presidential shooting is caught; staffers anxiously await news on Bartlet and Josh's injuries; flashbacks show how C.J. and Donna joined Bartlet's campaign.",
          "date": "2000-10-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM0NTI0MzgwMV5BMl5BanBnXkFtZTgwMTgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "f9334790-817f-4349-93d3-9ce1fa23a908",
          "title": "The Midterms",
          "episode": 3,
          "description": "With the midterm elections coming up, Toby looks for a way to stop hate groups; Charlie and Zoey decide whether to continue their relationship; President Bartlet discovers the egg cream and is concerned about an ultra-right-wing candidate running for school board in his old district in New Hampshire; and Sam is asked to put White House help behind an old friend running for Congress. This episode includes the President's confrontation with a right-wing radio talk show host using a famous list of modern applications of Biblical laws. Oh, yes, and psychics at Cal Tech and the Fermi National Accelerator Lab ...",
          "date": "2000-10-17T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzc3MzY4NDM4M15BMl5BanBnXkFtZTgwMzMyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "588ad206-8c9d-4b18-8494-5ee7184f2786",
          "title": "In This White House",
          "episode": 4,
          "description": "After a Republican commentator trounces Sam on television, President Bartlett decides to hire her over the objections of the staff. Josh and Toby mediate a conference between U.S. drug companies and an African President whose country is dying of AIDS.",
          "date": "2000-10-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc2NTQwOTMzN15BMl5BanBnXkFtZTgwNjgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "d9d01486-8423-4c7f-b1f4-592f0942e545",
          "title": "And It's Surely to Their Credit",
          "episode": 5,
          "description": "Sam helps Josh battle his health insurance company; Ainsley Hayes encounters her firebrand boss and hostile colleagues; Abby gives the President some good news about his health; C.J. discovers a retiring General intends to publicly criticize the president.",
          "date": "2000-10-31T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzY2NTY5ODkyOV5BMl5BanBnXkFtZTgwOTcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "f69f9309-5877-41a0-80b9-a6cce6eb8414",
          "title": "The Lame Duck Congress",
          "episode": 6,
          "description": "The administration considers recalling Congress to pass a nuclear test ban treaty; a Ukranian politician arrives unannounced at the White House; Sam reluctantly asks Ainsley to summarize a position paper; C.J.'s personal and professional relationship with Danny becomes more complex.",
          "date": "2000-11-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQyOTMzNjI3NV5BMl5BanBnXkFtZTgwNzIyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "8f57e298-b67d-49e2-9b5b-6fb1ccd954a8",
          "title": "The Portland Trip",
          "episode": 7,
          "description": "C.J. joins the President on a flight to Portland after a wisecrack about Notre Dame; Josh seeks to defeat an anti-gay marriage bill; Sam wants to rewrite an education speech; an oil tanker appears to be violating UN sanctions; Josh teases Donna over her dating record.",
          "date": "2000-11-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA2OTkwMjA4MF5BMl5BanBnXkFtZTgwMzQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "91142b92-5c22-4a93-9973-eb81fb7076fb",
          "title": "Shibboleth",
          "episode": 8,
          "description": "Dozens of Chinese stowaways are discovered in a container ship in California; Toby looks to pick a fight over school prayer with a recess appointment; Thanksgiving at the White House sees C.J. in charge of turkeys and Charlie looking for the ultimate carving knife.",
          "date": "2000-11-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NTc0ODYxMF5BMl5BanBnXkFtZTgwODIwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4679822a-5fb4-49af-afcc-bd6cb0173fca",
          "title": "Galileo",
          "episode": 9,
          "description": "The President and NASA plan a TV event for a probe's landing on Mars; satellite photographs show a suspicious-looking fire in Russia; Leo asks Toby and Josh to decide on the next postage stamp; Sam and C.J. have personal reasons for not wanting to accompany the President to a concert.",
          "date": "2000-11-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzE4Nzk0MTExMl5BMl5BanBnXkFtZTgwODMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6bc11072-0a97-41ea-80c2-bd32b74a1e6b",
          "title": "Noël",
          "episode": 10,
          "description": "Josh speaks to a psychiatrist about the events of the last three weeks: Toby hired musicians for the foyer, an Air Force pilot disobeyed orders, Yo-Yo Ma performed at the White House, and Josh managed to cut his hand quite badly.",
          "date": "2000-12-19T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjMyNjYwMDQ2Nl5BMl5BanBnXkFtZTgwNDMwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "16f76860-e9e0-4438-aa93-0e16ea8e634c",
          "title": "The Leadership Breakfast",
          "episode": 11,
          "description": "Toby wants to use a bipartisan breakfast to discuss real issues instead of making it a staged event; Sam floats the idea of moving the press room across the street; Leo wants Josh to apologize to a columnist on his behalf; Leo and Toby realize they need to start thinking about reelection.",
          "date": "2001-01-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTk1ODg4MzcwOV5BMl5BanBnXkFtZTgwNzMyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b662aee8-0e0d-4082-9ff2-9658c7235404",
          "title": "The Drop In",
          "episode": 12,
          "description": "Sam meticulously prepares a speech for the President to give to the environmental lobby, but Toby wants to sneak in some criticism of their failure to condemn environmental terrorism. Leo tries to convince the President to support his pet project - a missile defense shield - despite its continued failure to produce results, and the fact that it likely contravenes an anti-ballistic missile treaty. Several countries including Great Britain have sent new ambassadors to Washington to be recognized by the White House. C.J. travels to New York on a delicate mission to ask for a political favor from a comedian.",
          "date": "2001-01-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTcwOTQ4MzI5MF5BMl5BanBnXkFtZTgwNjQwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6e4cf8c7-8ae8-4aeb-835a-b62a9e1546ec",
          "title": "Bartlet's Third State of the Union",
          "episode": 13,
          "description": "While a live TV show is broadcast from the West Wing following the State of the Union, the staff must covertly deal with a hostage situation in Colombia. CJ learns that a special guest at the state of the union has a black mark on his record that could taint the administration. Ainsley Hayes is afraid to meet the President in person.",
          "date": "2001-02-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjIyMzQxNzg5MV5BMl5BanBnXkFtZTgwNTMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4e18d5ae-a3c4-461f-a087-b5c15f546ea8",
          "title": "The War at Home",
          "episode": 14,
          "description": "President Bartlet is fighting a war on two fronts as he tries to rescue hostages in Colombia and deal with explaining to his wife why he's breaking his word to her by running for a 2nd term.",
          "date": "2001-02-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc4MDExNDcwNF5BMl5BanBnXkFtZTgwMDUyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e0649938-e87e-4e0a-9ca0-7f17482d1624",
          "title": "Ellie",
          "episode": 15,
          "description": "Comments made by Surgeon General Dr. Millicent Griffith concerning the medical effects of marijuana appear to reverse the President's stance on legalizing the drug.",
          "date": "2001-02-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQxOTIyODY0Ml5BMl5BanBnXkFtZTgwNDUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "caf92bdc-55e4-46dc-81c2-6b71dfc062c9",
          "title": "Somebody's Going to Emergency, Somebody's Going to Jail",
          "episode": 16,
          "description": "On this year's \"Big Block of Cheese Day\", a college friend of Donna's asks Sam to help her get her late grandfather, accused of being a Communist spy inside the U.S. government, a presidential pardon; dealing with the recent revelation that his father had been having an affair for the past 27 years, Sam faces off with an F.B.I. agent, and later with Nancy McNally, over the pardon. Elsewhere, a group of cartographers completely re-educates C.J. on her perception of the globe, and one-time protester Toby, with the help of a straight-talking female security guard, speaks for the w.h. at a rally to protest against U.S. participation in the WTO and various free trade agreements.",
          "date": "2001-02-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTk5MTI0MzQ1OV5BMl5BanBnXkFtZTgwNjYwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "70fd88d7-2c36-4220-9a1f-5a993e9b600c",
          "title": "The Stackhouse Filibuster",
          "episode": 17,
          "description": "Josh finalizes a $6B health care plan that has strong support from both parties in both houses and appears to be a slam dunk for passage, but 78-year-old Senator Howard Stackhouse pulls a last-minute surprise--he wants money added for autism research or he'll filibuster. Thinking it's just a bluff, Josh blows off the senator, who then filibusters for more than eight hours while the WW staff waits desperately to begin their weekend with the episode unfolding as staffers write e-mails to their family members describing the evening's action. Elsewhere, Sam tries to eliminate various costly government documents, for which he's taken to task by a very young intern.",
          "date": "2001-03-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTM4NDYyODk5OV5BMl5BanBnXkFtZTgwMTQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "2b081c86-f6ee-40aa-9532-f442b8e9378a",
          "title": "17 People",
          "episode": 18,
          "description": "Following the Vice-President's remarks to him, Toby realizes the truth behind the President's illness: multiple sclerosis. Toby, Leo, and Bartlet discuss the possible political implications of this if it goes public including possible jail time for the 17 people who now know about the illness. Meanwhile Sam, Josh, Donna and the rest of the staff, unaware of the illness, struggle with a speech the President is to give at the White House Correspondents Dinner.",
          "date": "2001-04-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM2NTc5MzUwOF5BMl5BanBnXkFtZTgwMzYxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "319bb8e4-7019-47eb-bea0-3d817ec9ac0c",
          "title": "Bad Moon Rising",
          "episode": 19,
          "description": "President Bartlett talks to the White House Counsel about the concealment of his MS. An enraged Toby has CJ grill the West Wing staff to find a leaker. Josh and Donna spar over a financial bailout of Mexico.",
          "date": "2001-04-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI4NTE1NjA5NV5BMl5BanBnXkFtZTgwNDMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b6cae0ff-a7b8-4b74-bcdd-9e55fb6a70df",
          "title": "The Fall's Gonna Kill You",
          "episode": 20,
          "description": "White House Counsel Oliver Babbish interviews CJ once she learns of the President's condition. The First Lady learns she may be legally vulnerable. Donna frets over news of a falling satellite.",
          "date": "2001-05-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjExMDQ4NTQ1NV5BMl5BanBnXkFtZTgwODIyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4225b2ef-41d4-4081-9187-c7af99562611",
          "title": "18th and Potomac",
          "episode": 21,
          "description": "With hypothetical polling numbers showing them it will be political suicide, staffers prepare to announce the President's condition. As they do, a military crisis flares up in Haiti and Josh faces off against two senators who are against the Government's tobacco industry suit. But as badly as the day seems to be going, a tragedy will come from a car wreck at 18th and Potomac that will affect everything.",
          "date": "2001-05-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTYwMjkyNTEzOF5BMl5BanBnXkFtZTgwMzgxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "909fe835-35b9-45e0-a0a5-47a0325b7043",
          "title": "Two Cathedrals",
          "episode": 22,
          "description": "As the Haitian army continues their seizure of the American embassy there, Bartlet and the staff prepare for the announcement that Bartlet has M.S. and the President must decide whether or he will seek re-election. As the funeral for Mrs. Landingham takes place and the announcement draws nearer, Bartlet thinks back to his past in search of the answer to the question everyone is asking: Will he seek re-election?",
          "date": "2001-05-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOWM5ODJkMzUtNjljZC00MmMxLWFjMzYtMmM3OGQwNzI3ZmM0XkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "cc01230f-c961-43c2-beac-4fa874b96489",
      "season": 3,
      "episodes": [
        {
          "id": "afabdeb0-c08b-49aa-915b-d635c3bcce03",
          "title": "Isaac and Ishmael",
          "episode": 1,
          "description": "The West Wing goes under lock down as a suspected terrorist is found to be working at the White House. Stuck with a group of high school students who were visiting the White House, the staffers, President Bartlet, and the First Lady all debate the issues regarding terrorism. Meanwhile, Leo sits in on the questioning of the terrorist suspect and learns a lesson about our perceptions of terrorists.",
          "date": "2001-10-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU4MjE5NzcyNV5BMl5BanBnXkFtZTgwNzcwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bcddcb84-a24e-4096-99b1-a103a56dd9f7",
          "title": "Manchester: Part I",
          "episode": 2,
          "description": "The staff is hunkered down in the Bartlets' hometown of Manchester, N.H., where they work with political consultants Bruno, Doug and Connie on the president's official announcement that he'll be seeking a second term; meanwhile, they all lament various W.H. events of the previous four weeks, including a huge strategic mistake by Josh, a pivotal FDA announcement scheduled for the same day as the president's speech, an ongoing battle between then president and first lady, and a major press room gaffe by C.J.",
          "date": "2001-10-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjA4MDU0MTQ2M15BMl5BanBnXkFtZTgwOTAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b9c54efa-c02f-401f-abe0-643206de2d03",
          "title": "Manchester: Part II",
          "episode": 3,
          "description": "With the staff all bickering with one another in Manchester, especially adversarial speech writers Toby and Doug, who angrily disagree about whether Bartlet should make a public apology for lying about his MS, and with the president sniping at everyone, the second-term announcement speech is locked. Abby ultimately forgives the president for deciding to run again without discussing it with her, and he ultimately apologizes to the staff in private for keeping his condition from them, which they expect will soon lead to a whole slew of grand jury subpoenas.",
          "date": "2001-10-16T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc2Mjk5MzQ5N15BMl5BanBnXkFtZTgwMTExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "86a05ce7-d956-4f56-af4c-60a1a359f3f6",
          "title": "Ways and Means",
          "episode": 4,
          "description": "Special prosecutor Clem Rollins announces the grand jury subpoenas in the case of president's failure to disclose his MS to the public, and the list includes pretty much every West Wing staffer and Bartlet family member; Sam and Connie meet with an important Latino activist from Calif. who is considering supporting a primary challenger to Bartlet; C.J. convinces everyone that the special prosecutor is too reasonable, and that the W.H. needs a \"better enemy\" in the investigation, prompting the staff to provoke a Congressional inquiry.",
          "date": "2001-10-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEwMjgzODExOV5BMl5BanBnXkFtZTgwOTYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "81947bc3-98d3-4ea3-8f65-d88ccf4f548d",
          "title": "On the Day Before",
          "episode": 5,
          "description": "While the W.H. is hosting a gala dinner for Nobel Prize winners, Leo and the president learn of a suicide bomb in an Israeli cafe that took the lives of two American students in Tel Aviv for a soccer match, and the staff attempts to manage the president's first veto, of a House bill eliminating the estate tax, and the threat of an override the same night. Sam and Toby first try to sway a contentious Dem. From Tennessee who wants a whole list of farming and ranching concessions in exchange for his vote and three proxies; after a pep talk from Leo, they devise a substitute plan that may prove even more effective, if it works. Josh takes the governor of Indiana into a private meeting to determine if the man plans to challenge Bartlet in Democratic primary. C.J. takes heat from a smarmy Dallas entertainment reporter who is in town for the Nobel dinner but winds up having to cover the veto and override vote, but after the reporter embarrasses her during a live stand-up, C.J. one ups the woman in front of the press corps. Later, Sam, Toby and Josh try to help the president decide what to say to the parents of the two murdered students.",
          "date": "2001-10-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU5NzA0OTg4NV5BMl5BanBnXkFtZTgwMTQwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "468b0113-c69a-4c7b-9c06-a5dcabc56ec8",
          "title": "War Crimes",
          "episode": 6,
          "description": "After a fatal shooting in Texas, the president asks Hoynes to go down there and speak out for gun control, in spite of his history opposing it. Donna makes a gaffe in front of the Congressional committee. Leo argues with an old friend about the creation of an international war crimes tribunal.",
          "date": "2001-11-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE0ODgwMDM0Ml5BMl5BanBnXkFtZTgwMTcyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "26a77b7b-a41d-4012-bbc0-adfa86de2ef4",
          "title": "Gone Quiet",
          "episode": 7,
          "description": "When the military loses contact with a submarine in hostile waters, the President must choose between risking the lives of the crew and provoking North Korea. CJ relishes the Majority Leader's flubbing of an interview. Babbish informs Abby that she is the weak link in the President's legal defense.",
          "date": "2001-11-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE0OTUwMzU1NV5BMl5BanBnXkFtZTgwNjMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "8f43f25f-3382-4774-b417-40ba3e6d1805",
          "title": "The Indians in the Lobby",
          "episode": 8,
          "description": "On the day before Thanksgiving, CJ has to deal with two Stockbridge-Munsee Indians who won't leave the lobby until they get an answer on an application their tribe submitted 15 years ago. Josh tries to arrange the extradition of an underage boy whose parents sent him to Italy after he killed his teacher. The President learns why Abby wants to have Thanksgiving at Camp David this year, and places an anonymous call to the Butterball Hotline.",
          "date": "2001-11-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MzQ4MTAyMV5BMl5BanBnXkFtZTgwNTIyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "281e9751-2f4c-4f80-b736-1d4cbe3e5b05",
          "title": "The Women of Qumar",
          "episode": 9,
          "description": "CJ cannot control her outrage when the US agrees to an arms sale to Qumar, a country that brutally abuses women. Josh meets with Amy Gardner, a leading women's group lobbyist. The content of a Smithsonian exhibit draws protest from a veteran's group. Leo and the President discuss options when the possibility of a Mad Cow infection strikes the US beef industry.",
          "date": "2001-11-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ2NjQ0NjE5OV5BMl5BanBnXkFtZTgwOTUyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "cb5132f5-70d2-47e2-9d79-6608c6475bb8",
          "title": "Bartlet for America",
          "episode": 10,
          "description": "In an episode dotted with flashbacks, Leo and his attorney Jordon Kendall (Joanna Gleason) face a Congressional inquiry into whether the president lied to the American people regarding his MS, but this particular day of hearings concerns itself more with Abby and her secretly medicating Jed, and later with Leo's having fallen off the wagon during the campaign (a politically motivated Republican rep on the committee witnessed Leo drunk in his room three days before the nomination); we see the meeting in which Leo talked N.H. Governor Bartlet into running for president, introducing his idea, \"Bartlet for America\", on a cocktail napkin, which the president later frames and returns to Leo as a gift in thanks for all he's done for the president over the years; Cliff Calley, Donna's boyfriend and special counsel to the judicial oversight committee, asks the committee chair to halt the inquiry before the rep can compel Leo to admit his personal transgression; Leo asks Jordon to Xmas Eve dinner.",
          "date": "2001-12-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTQ0MDg0MTQwM15BMl5BanBnXkFtZTgwMDQxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "adb13dcc-f324-4025-b61a-514f7ea1168a",
          "title": "H. Con-172",
          "episode": 11,
          "description": "In a private, late-night meeting, Cliff Calley informs Leo and Jordon he has negotiated a settlement in the Congressional witch hunt over Bartlet's MS: Bartlet can accept a joint congressional censure (House Concurrent Resolution 172, or H.Con. 172); Leo initially refuses to bring it to the president, insisting it will devastate the president and affect him for the rest of his life, but he does mull it over, and consults with Josh and repeatedly with Jordon about it; Josh begins his romantic pursuit of women's issues advocate Amy Gardner, but flubs it a couple of times while she continues dating other men.",
          "date": "2002-01-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjMyMTgzNjA2MV5BMl5BanBnXkFtZTgwNDQxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "737e1584-499f-41c4-8fd2-f51c5f2cd4e9",
          "title": "100,000 Airplanes",
          "episode": 12,
          "description": "On the night of the State of the Union, Sam has to explain the process of writing the speech and grading reaction to it to a magazine reporter (Traylor Howard) throughout the evening; C.J. arranged the coverage aware that the reporter, Lisa Sherbourn, is Sam's ex-fiancée; flashing back to the speechwriting process, we see the president dining with several of Abbey's medical colleagues, and they ponder the future of cancer research, motivating Bartlet to ask that a section be added to the SOTU in which he calls for U.S. scientists to find a cancer cure by 2012; the staff, convinced that the Congressional censure is weighing heavily on the president, tries to talk him out of this bold but risky proposal.",
          "date": "2002-01-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI3MDM2MjQxMV5BMl5BanBnXkFtZTgwOTYxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "503c799b-6b1c-484d-8483-9fe5b4f96599",
          "title": "The Two Bartlets",
          "episode": 13,
          "description": "Toby is concerned when President Bartlett forgoes an opportunity to speak out in favor of affirmative action during the Iowa caucuses and confronts the President on the real reasons underlying his Dr. Jekyl & Uncle Fluffy personality shifts. Meanwhile Josh makes plans for a vacation with Amy and then must cancel them.",
          "date": "2002-01-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEyMjMyNDUyNV5BMl5BanBnXkFtZTgwNzUyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "25ae1d56-0d6d-4f7a-9038-dadae0ffd6fc",
          "title": "Night Five",
          "episode": 14,
          "description": "Josh covertly brings a psychiatrist to the white house to meet with the President who has been unable to sleep for five days.",
          "date": "2002-02-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODUzNTA0OTU1Nl5BMl5BanBnXkFtZTgwNjAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "602d6f1f-3d4b-4014-90fe-366f4217fba7",
          "title": "Hartsfield's Landing",
          "episode": 15,
          "description": "A small town in N.H. is the site of the first presidential primary vote, and the results from Hartsfield's Landing, announced at 12:07 a.m., will dominate the news all day until the final tally. Josh wants favorable press for the president, prompting him to ask Donna to persuade a local couple she knows to reconsider their vote. Elsewhere, Bartlet has just returned from India with a collection of antique chess sets he gives as gifts to the staff. He plays Toby while they discuss their recent blow-up, Bartlet's insomnia and Toby's fervent belief that the president's enormous intellectual gravitas is an asset, not a liability, to the campaign. He also plays Sam as they discuss a critical detente standoff between China and Taiwan. And Charlie and C.J. stand off in a series of pranks over a missing copy of the president's private schedule.",
          "date": "2002-02-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUyNjg4MDI3Nl5BMl5BanBnXkFtZTgwNTkwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "aa29e595-bd02-4ccb-b478-e6ff6956fb0c",
          "title": "Dead Irish Writers",
          "episode": 16,
          "description": "A lavish W.H. party for Abbey's birthday the night before a N.H. medical board begins hearings on whether to suspend her license over her secret treatment of her husband's MS. Abbey returns to the residence with C.J. and Amy Gardener to get blitzed on wine and discuss her concerns about her medical career. Donna is restricted from joining the party because a decades-old cartography error puts her birthplace in Canada. Toby and U.K. Ambassador Lord John Marbury (Roger Rees) go to a nearby bar to share a bottle of very rare Scotch and to discuss a planned W.H. visit by an IRA political activist, which culminates in Marbury surprising Toby with his progressive vision. Later, Donna joins the women in the residence and makes an off-the-cuff remark that causes Abbey to rethink her stance on the issue of her license.",
          "date": "2002-03-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ1NzIzNjk5Ml5BMl5BanBnXkFtZTgwNjIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e8f23730-00ef-491d-86ad-a7c936ad1854",
          "title": "The U.S. Poet Laureate",
          "episode": 17,
          "description": "Poet laureate Tabitha Fortis visits D.C. to attend a White House dinner in her honor, and Toby develops a bit of a crush on her, but he also must admonish the somewhat flighty beauty against publicly criticizing the president for his refusal to sign an international anti-land mine treaty; Donna discovers a website devoted to Josh, and he soon becomes sucked into the online chat about his activities and ego; speaking via remote to a local morning show in Philadelphia and unaware that the mike is on, Bartlet makes a stray comment impugning opponent Robert Richie's intelligence, for which the staff, particularly C.J., takes a lot of heat from Richie campaign and the press.",
          "date": "2002-03-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ5ODY5MTIxMV5BMl5BanBnXkFtZTgwNTUyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "90378164-52b2-4586-821e-2dabccf45b4b",
          "title": "Stirred",
          "episode": 18,
          "description": "On a typical night in the west wing, Sam returns from a hockey game and Josh asks him to meet with V.P. Hoynes about saving an education bill. Back at the W.H., Josh, Toby, Leo, C.J., Larry and Ed all meet about the prospect of replacing Hoynes on the ticket in the next campaign. Bartlet helps Charlie do his federal taxes, and while both think Charlie should expect a refund, thanks to last year's so-called economic stimulus, he instead owes money to the IRS. A security emergency occurs when two trucks, one stolen and containing nuclear waste, crash in a tunnel in Idaho, threatening to explode and wipe out a nearby town. Donna asks Josh to ask the president for a special proclamation recognizing her favorite h.s. teacher. Bartlet can't oblige, but he comes up with a very uplifting consolation for Donna to let her teacher know how much she appreciated her. Episode title refers to James Bond's preference for \"shaken, not stirred,\" which Bartlet insists results in a weak martini; this ties into Hoynes and Leo making the president aware that Hoynes is a recovering alcoholic, just as the w.w. staff is considering bumping him.",
          "date": "2002-04-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjIyNDgyNjcxM15BMl5BanBnXkFtZTgwODYwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "9dec1429-f8d1-436d-a111-1b2e746128b3",
          "title": "Enemies Foreign and Domestic",
          "episode": 19,
          "description": "A meeting with the new Russian president becomes politically dangerous when surveillance photos show Russia building a nuclear reactor in Iran. C.J. is assigned Secret Service protection after receiving death threats.",
          "date": "2002-04-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjQwNTAwNTc0NV5BMl5BanBnXkFtZTgwMDUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "fd8af588-1263-4f66-808d-9cb6f921d794",
          "title": "The Black Vera Wang",
          "episode": 20,
          "description": "The President and Leo deal with reports of a planned terrorist attack, but more shocking is who is behind it. Sam receives an anonymous package with bad implications for the campaign. C.J. chafes under her Secret Service protection.",
          "date": "2002-05-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTExOTMyNjA4NzZeQTJeQWpwZ15BbWU4MDc1MDI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "5d3d2ccf-2fb2-4cc9-a96b-3e3dd0d04ab9",
          "title": "We Killed Yamamoto",
          "episode": 21,
          "description": "Bartlet and Leo debate on how to deal with the impending visit of the Qumari Defense Minister, whom U.S. intelligence officers have conclusively linked to terrorists. Sam dismisses an ingenious idea to trap Republican presidential opponent Robert Ritchie in an unsavory position over the Everglades, but comes around after talking to Toby. C.J. begins to develop a relationship with Secret Service agent assigned to her, Simon Donovan. Josh and Amy are locked into a battle over a welfare reform bill, which could end their relationship.",
          "date": "2002-05-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTkyMjg0MDA3NF5BMl5BanBnXkFtZTgwMTEyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ccb9153c-47e4-4aa5-a3c2-1934f859ec86",
          "title": "Posse Comitatus",
          "episode": 22,
          "description": "Bartlet, Leo, Sam, Toby, and C.J. travel to New York City for a Catholic fund raiser at a long Broadway play called \"The War of the Roses\". Josh steps up his efforts to beat his girlfriend, Amy, in their struggle over the welfare reform bill, which leads to her forced resignation. C.J. and Secret Service agent Simon Donavon have grown closer, but a tragic event cuts short their relationship. At the play, Bartlet comes face to face with Republican Presidential candidate Rob Ritchie and faces the decision of whether or not to assassinate the Qumari Defense Minister.",
          "date": "2002-05-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjAyNTE0MjQxMF5BMl5BanBnXkFtZTgwNjUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "6406a82a-21e9-4ea7-ac14-b708fda17507",
      "season": 4,
      "episodes": [
        {
          "id": "3c4e05de-abd7-4785-b386-4b9026716cd5",
          "title": "20 Hours in America: Part I",
          "episode": 1,
          "description": "After Bartlet gives a campaign speech at an Indiana farm, Josh, Toby and Donna are left behind by the presidential motorcade and must work their way across the state with the help of the farmer's daughter and, later, a teenage campaign volunteer, enduring many setbacks along the way. Josh and Toby obsess and bicker over how best to play the president's intellectualism, viewed by many as snobbery, against Republican opponent Robert Ritchie's \"regular guy\" persona, while Donna must keep them on track and communicate with the real Americans they encounter along the way. Back at the W.H., the president deals with a terrorist attack at an Iowa college swim meet, meets with Leo, Nancy and Fitzwallace to discuss how to handle the prospect of the U.S. and/or Israel being accused of a conspiracy in the assassination of Qumari defense minister Abdul Shareef, and interviews secretarial candidates, including a second round with Debbie Fiderer; the wandering party finally arrive at a city with an airport (presumably South Bend) and stop briefly at a nearby hotel, where they learn about the Iowa attack and Donna chastises the two men for caring only about the campaign and not the people it affects; later in the hotel bar, Josh and Toby meet a man trying to figure out how to pay his daughter's tuition to Notre Dame, and he inspires them to initiate new tax policy.",
          "date": "2002-09-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjAwOTUwMTUzNV5BMl5BanBnXkFtZTgwMjAzNDE1NTE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "2145ef6a-99c8-4a71-a240-beb4bcf041fa",
          "title": "20 Hours in America: Part II",
          "episode": 2,
          "description": "Donna teaches Toby and Josh an important lesson as their trek homeward continues; Sam staffs the President in Josh's absence and welcomes an old friend home; Bartlet hires a secretary and C.J. finds a Big Brother for Anthony; the situation in Qumar continues to escalate; Bartlet gets spooked by a photo op as the Dow continues its dive; and a pipe bomb kills 44 students at a Midwest university swim meet.",
          "date": "2002-09-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZWY0YmEzMjUtNDI2NC00YjM0LWI1MWUtNzhhYzY2NTYwOTQxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "f483e2b4-552a-425f-8310-ebb704efb523",
          "title": "College Kids",
          "episode": 3,
          "description": "Josh and Toby have a plan to make college cheaper. Leo starts talking to a lawyer about the Shareef assassination. A judicial ruling on third-party candidates has troubling implications for the campaign.",
          "date": "2002-10-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM1MzI2MDg4Nl5BMl5BanBnXkFtZTgwOTIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "3464d3d0-767a-4628-b8b3-54af8e3f919b",
          "title": "The Red Mass",
          "episode": 4,
          "description": "A possible third-party candidate threatens to upset the President's lead in the polls. As Qumar threatens to blame Israel for Shareef's death, Leo must convince the Israeli ambassador not to respond. Charlie teaches his new ward a lesson in basic government. When the committee in charge of presidential debates rules that there will only be two, Sam and CJ propose a risky strategy.",
          "date": "2002-10-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NDAzODIzMF5BMl5BanBnXkFtZTgwNDQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "15453e91-a6c6-4d4a-b6ad-041e5e004fef",
          "title": "Debate Camp",
          "episode": 5,
          "description": "Sequestered in North Carolina to prepare for the one and only debate between Bartlet and opponent Robert Richie, the staff and several consultants (incl. Andrea Wyatt and Joey Lucas) flash back to the days just before and after the president's first inauguration, which were marked by an ill-advised choice for attorney general and ongoing concerns about fertility for then-married Toby and Andrea. In the present, Sam plays Richie in mock debates and raises Bartlet's ire, while Leo and the joint chiefs try to convince the president not to treat increasingly aggressive Qu'mar, whose defense minister Bartlet ordered assassinated (late last season), with kid gloves, and the staff keeps pestering Toby about his on-again, off-again relationship with Andrea, until he makes a startling revelation.",
          "date": "2002-10-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEyMDMxNzI5Ml5BMl5BanBnXkFtZTgwMzIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "79a0b4f2-45a3-4b3b-bd1d-d55ef1091528",
          "title": "Game On",
          "episode": 6,
          "description": "Toby falls prey to a practical joke by the rest of the staff, after which everyone but Leo takes off for the debate in San Diego. Sam makes a side trip to Newport Beach to explain to the congressional campaign manager of the late Horton Wilde why the campaign has to fold even though Wilde is still on the ballot; what Sam doesn't expect is a stalwart named Will Bailey who, determined to keep the ideas of the campaign alive, continues to hold campaign events and do door-to-door canvassing. In San Diego, a nervous w.w. staff readies itself to spin for the president, but when Bartlet and Richie go head to head in a unique debate format, Bartlet tears Richie apart on states' rights, education, taxes, etc., by being precisely the intellectual snob everyone had accused him of being and using it to his own advantage. Back in DC, Leo and Jordon Kendall meet with the Qu'mari ambassador to the U.N., and Leo warns Qu'mar to back off its campaign to charge Israel with the assassination of Defense Minister Abdul Shareef. After the debate, Sam returns to Newport to meet once more with Will at a bar, during which Sam makes a surprising offer.",
          "date": "2002-10-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ4OTM0NjY3OV5BMl5BanBnXkFtZTgwNTQxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "179313e9-987a-4d14-a392-afb1efb91b20",
          "title": "Election Night",
          "episode": 7,
          "description": "As results come in across the country, Sam is focused on a single congressional election that will determine his own future. After realizing she accidentally voted for the Republican nominee, Donna tries to find a Ritchie supporter who will \"swap votes\" with her. The President tries to hide a recurrence of his M.S.",
          "date": "2002-11-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTMyNzQ5Mjg3Ml5BMl5BanBnXkFtZTgwNDIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "30df7d83-b932-49d2-8f9f-3815c69a0cc7",
          "title": "Process Stories",
          "episode": 8,
          "description": "Sam finds himself in a tricky position after the election in Orange County takes an unexpected turn. Toby and his ex-wife also find themselves in a delicate position, but decidedly one of their own making. And CJ tracks down the self aggrandizing source of some Process Stories.",
          "date": "2002-11-12T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTg1ODIxOTg2OV5BMl5BanBnXkFtZTgwMTEwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "082f6fce-c0ba-427e-85ac-1bad5e86e42c",
          "title": "Swiss Diplomacy",
          "episode": 9,
          "description": "A 15 year old boy needs a heart and lung transplant. He also happens to be the son of the Iranian Ayatollah who is not a supporter of the Bartlet Administration.",
          "date": "2002-11-19T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQxNzY1NTQ2NF5BMl5BanBnXkFtZTgwMjYwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bebf82fb-3794-4380-825d-973fc829d37d",
          "title": "Arctic Radar",
          "episode": 10,
          "description": "Women's groups, by default including the majority of the First Family, react passionately as a renowned female fighter pilot is sanctioned for an affair with a senior officer. Meanwhile Sam prepares for his campaign.",
          "date": "2002-11-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjgxNDk0NzgzN15BMl5BanBnXkFtZTgwNzcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "7068d0c1-2916-4781-bc0b-5e06ffef244c",
          "title": "Holy Night",
          "episode": 11,
          "description": "Toby's estranged father appears in his office a couple of nights before Christmas. Leo and Jed find themselves trying to fix problems as well as their consciences.",
          "date": "2002-12-10T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTgyMjIxNzAwM15BMl5BanBnXkFtZTgwNTAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6931b76e-813c-4932-9aa4-c3f9f12e9c1a",
          "title": "Guns Not Butter",
          "episode": 12,
          "description": "A fight for Foreign Aid brings the staff together. Meanwhile Danny is uncovering evidence that is making certain members of the administration increasingly uncomfortable.",
          "date": "2003-01-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTcwNjkzMjYxOF5BMl5BanBnXkFtZTgwMTUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "57b60c57-f113-4c11-a85a-bc5e5a211fe5",
          "title": "The Long Goodbye",
          "episode": 13,
          "description": "C.J. takes a short trip to her home in Dayton to check on her father, who is suffering from Alzheimer's Disease, and to give a speech at her high school reunion; at the Dayton airport, she meets an old high school acquaintance and they have a quick fling.",
          "date": "2003-01-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODg1ODg2MTcxN15BMl5BanBnXkFtZTgwOTMyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "7358bb6c-4337-49c6-9c54-9604268f9409",
          "title": "Inauguration: Part 1",
          "episode": 14,
          "description": "It is the day of Bartlet's second inauguration and yet the celebrations stutter as the staff are stunned by a betrayal in their midst.",
          "date": "2003-02-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTg0NTQwODQ1N15BMl5BanBnXkFtZTgwMjgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "a29f03ee-d458-4f45-87e2-6b383bc64ee9",
          "title": "Inauguration: Part 2 - Over There",
          "episode": 15,
          "description": "Will struggles to find the words when the Inauguration speech seems to avoid current heart breaking issues.",
          "date": "2003-02-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTYxOTMxNjk2MV5BMl5BanBnXkFtZTgwMDgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "32f28aa8-ac5f-4693-baf2-8682c347b804",
          "title": "The California 47th",
          "episode": 16,
          "description": "The president, first lady and w.w. staff travel to Orange County, Calif., to campaign for Sam's bid to win the 47th District congressional seat -- the Nov. winner in the heavily Republican district was, amazingly, a liberal Democrat who, more amazingly, had died a few weeks prior. The president orders Toby to fire Sam's campaign manager, a staunch realist, and take over the campaign with a more idealistic approach. Some conservative voters approach Andrea Wyatt in a bar and give her grief about her out-of-wedlock pregnancy, and Toby and Charlie step in forcefully, landing them in jail. Donna talks, on behalf of Sam's campaign, with a state labor leader who turns out to be a Communist.",
          "date": "2003-02-18T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA0NjAwMDgxNV5BMl5BanBnXkFtZTgwMjMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ae03c8e8-93fb-4742-8ae2-406666bd544f",
          "title": "Red Haven's on Fire",
          "episode": 17,
          "description": "Military action in Africa has unforeseen repercussions. Sam and Toby work together on the Orange County Campaign. Will has to find his leadership skills quickly as he is left with no one but interns to prepare remarks on the dry subjects of Taxes.",
          "date": "2003-02-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUwNDgzMDIxNl5BMl5BanBnXkFtZTgwNjIwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "0efd41df-3e79-4e65-90fb-4a0969b24595",
          "title": "Privateers",
          "episode": 18,
          "description": "Amy is challenged and tormented from all sides in her first day as Chief of Staff to the First Lady. Her first task is to prove that Abbey's relative was a privateer and not a pirate. And a glacier melts!",
          "date": "2003-03-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUwNDQyMjk3OV5BMl5BanBnXkFtZTgwMDIwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "3269fa64-8290-4cdf-87b7-a5b6399bb2da",
          "title": "Angel Maintenance",
          "episode": 19,
          "description": "The President, C.J. Cregg, Will Bailey, and others are returning from a long flight overseas. As Air Force One is about to land, the indicator light for the nose wheel fails to come on, prompting pilot Colonel Jessie Weiskopf to call off the landing, and notify the President of the possibility of terrorism. The White House Press Corps is on board, therefore CJ and Will must keep the story under wraps, due to it being a world market event. This becomes a challenge when a F-15 Eagle jet is sent to inspect the nose wheel on AFO. Meanwhile on the ground, Josh is working with Congressman Tom Landis (R-MD) on legislation to Clean-up Chesapeake Bay, which angers Congressional Democrats. Toby meets with Congressman Mark Richardson (D-NY) who has introduced legislation to reinstate the draft, furthermore Toby notifies the Congressman a soldier from his constituency was killed in action in Equatorial Kundu. Donna works with members of the 1st Airlift Squadron, 89th Airlift Wing to learn about \"Angel Maintenance,\" in order to brief CJ, when she returns. Angel is the code word for the President's plane.",
          "date": "2003-04-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODEyMjYyOWMtNWEwYS00ZjdjLTg2NDAtMWExZWFmN2VhYzgzXkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b829d3d3-5e97-4b11-9e9b-fbe21a4499cb",
          "title": "Evidence of Things Not Seen",
          "episode": 20,
          "description": "Trying to participate in a late-night staff poker game proves difficult as news arrives that an unmanned U.S. spy plane has crashed in a remote part of Russia, and Bartlet and Leo have to deal with an incensed Russian President Chagorin and convince him via phone to let the military go in and recover the plane; C.J. obsesses over the fact that on the exact moment of the spring equinox (today), you can stand an egg on end; Toby and Will have a card-flipping contest in the press room, during which someone from the street fires several bullets into the room; Debbie must \"crash\" the West Wing for the first time when the bullets fly; at the same time, Josh is interviewing associate counsel applicant Joe Quincy, and there's something about the well-qualified lawyer that bothers Josh, which he deduces during the lock down.",
          "date": "2003-04-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZWVjOTNlMzItN2ZlZC00NTNhLTg3YjYtOTYwYjE1NjFlMDA5XkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "adc0b3e6-dfc1-479c-b37d-420fa1cec105",
          "title": "Life on Mars",
          "episode": 21,
          "description": "On his first day on the job, the new deputy counsel uncovers a trail of clues to a scandal that will end one person's career.",
          "date": "2003-04-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjI2Njk4NzI2NV5BMl5BanBnXkFtZTgwNzExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4845c60d-4174-4b30-bdbe-eab414097662",
          "title": "Commencement",
          "episode": 22,
          "description": "The assassination of Shareef threatens to become public, the president speaks at Zoe's graduation, and the unthinkable happens.",
          "date": "2003-05-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjY2OWUyYmQtNmM2OC00ZDc4LWJmZTgtZjEyZmRlMTI2MzljXkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e7631b09-2144-4515-bed1-b1844fc7663b",
          "title": "Twenty Five",
          "episode": 23,
          "description": "In the wake of his daughter's kidnapping, Bartlet must make a decision between being a father and being President.",
          "date": "2003-05-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNDE2MDAyNDE0Nl5BMl5BanBnXkFtZTgwNjYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "29d6131d-3e9e-44e8-b974-71cc54b6a874",
      "season": 5,
      "episodes": [
        {
          "id": "de1e27e7-f02b-4269-8d97-e4142917fdd4",
          "title": "7A WF 83429",
          "episode": 1,
          "description": "Seven hours have passed since Zoey's kidnapping and and the Republicans are in charge of the White House. Rifts are appearing in the leadership of both parties further complicated by the arrival of a ransom note demanding the release of terrorists.",
          "date": "2003-09-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjQxMjQyMzkzNl5BMl5BanBnXkFtZTgwNzgxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "84feb9fb-9e79-4c54-8869-e8985d10848d",
          "title": "The Dogs of War",
          "episode": 2,
          "description": "Zoey Barlet has been held for over a day. An international crisis looms that could have serious repercussions for the administration, let alone the hostage.",
          "date": "2003-09-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE2OTQ2NDk3N15BMl5BanBnXkFtZTgwNDExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "62678fab-be19-4049-81f3-08b2f320dada",
          "title": "Jefferson Lives",
          "episode": 3,
          "description": "With Bartlet back in the Oval Office, and back in his wife's bad books, the hunt for a Vice President begins.",
          "date": "2003-10-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM2NjY5NzEyNV5BMl5BanBnXkFtZTgwODcwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "8c11eb57-a73c-42cb-9911-c2fdfc254914",
          "title": "Han",
          "episode": 4,
          "description": "A North Korean pianist announces his intention to defect in the Oval Office. While the staff passionately debate his request they also fight to get the President's choice of Vice President nominated by a new and hostile Speaker of the House.",
          "date": "2003-10-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BZDkzNDEzYTgtYzViMS00NTVmLTg2NGQtZjllZGRkZDk4NmY1XkEyXkFqcGdeQXVyMDgyNjA5MA@@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ef9c8e97-01fe-4420-bc29-c29e33f577fb",
          "title": "Constituency of One",
          "episode": 5,
          "description": "Multiple members of the team start questioning the direction of the White House, including one member entertaining job offers. Those who aren't are starting to stumble, including Josh and Amy.",
          "date": "2003-10-28T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI5MjgzMjQzN15BMl5BanBnXkFtZTgwODIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "be0f59df-2257-46e5-9414-fc7e62708cca",
          "title": "Disaster Relief",
          "episode": 6,
          "description": "Leo is left manning the fort when the President goes AWOL whilst visiting tornado victims. Josh is not in the position to lend a hand as he deals with the fallout from a gross miscalculation and lack of judgment.",
          "date": "2003-11-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU2NzQ3MzA4NV5BMl5BanBnXkFtZTgwMTIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "181f1bb2-5bdf-4f32-b1cc-fa893344037f",
          "title": "Separation of Powers",
          "episode": 7,
          "description": "Deputy counsel Joe Quincy is quietly enlisted by Toby to approach the ailing Chief Justice about possible retirement. With Josh still incapable of lobbying effectively, Leo brings in help to hammer out the budget, but success looks a long way off with a hostile Speaker making negotiations tricky.",
          "date": "2003-11-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NjQ1NDI1NV5BMl5BanBnXkFtZTgwMzQwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "c0e22871-bb0a-4fc6-bf1e-448f5e931e2b",
          "title": "Shutdown",
          "episode": 8,
          "description": "President Bartlet refuses to let Speaker of the House Haffley hold him hostage on the budget and allows the government to be shut down.",
          "date": "2003-11-18T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU4NjU5ODQ1NF5BMl5BanBnXkFtZTgwMzMwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "1b732562-cbe1-4486-8fee-41ff580b5407",
          "title": "Abu el Banat",
          "episode": 9,
          "description": "The entire Bartlet family tries to gather for an early Christmas dinner at the White House, but inevitable delays occur as the president must deal with an overseas crisis. Ellie is held up at her lab, and five-year-old grandson Gus is having tantrums. In addition, Doug Westin (Jed and Abby's son-in-law) approaches Josh about running for an open congressional seat in his home district. Josh, Leo and the New Hampshire Democratic Party have already chosen a viable local candidate, but Doug persists. Jed, who likes and respects Doug, still thinks it's should be Liz who should run for the open seat.",
          "date": "2003-12-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTkwMjYzODE5NV5BMl5BanBnXkFtZTgwMzcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "9b8b4844-8ff3-403c-8fe1-231999167110",
          "title": "The Stormy Present",
          "episode": 10,
          "description": "Bartlet travels with former presidents Newman and Walken aboard Air Force One to the funeral of another former president. Meanwhile, Leo sits in the situation room dealing with demonstrations that are wracking Saudi Arabia and threatening to topple the royal family and CJ tries to deal with rumors of military mind control experiments. On board the plane, Toby tries to write Bartlet's eulogy as the crisis in Saudi Arabia grows worse.",
          "date": "2004-01-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU1Nzk1NzY5MV5BMl5BanBnXkFtZTgwODQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bbd76212-02de-4c5c-bbb4-67d49376bec6",
          "title": "The Benign Prerogative",
          "episode": 11,
          "description": "In inexplicably finishing the speech early Toby is left with nothing to do. However, the State of the Union speech needs testing, so Toby flies out to meet Joey Lucas to perform mall tests.",
          "date": "2004-01-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTM2NDg4ODMxMF5BMl5BanBnXkFtZTgwNTQwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "0e77c707-cccd-46bf-afc8-18a8022b3944",
          "title": "Slow News Day",
          "episode": 12,
          "description": "Toby awakens at 3 a.m. with an idea of how to save the social security program for future generations, leading him to meet in secret with the president and volunteer to \"touch the third rail\" of American politics. Toby meets with influential Republican senator Gaines about putting aside partisanship in the interest of preserving the critical safety net, and he gets a favorable response, but someone who saw them together leaks the meeting to the press. Toby also gets Dem. senator Brainerd on board with assurances that both sides need to compromise and that the Republican agreed. Elsewhere, Josh tries to help boost the new v.p.'s profile and bland image by having him comically attack the same senator for his weak fundraising efforts. By day's end, both Gaines and Brainerd have publicly withdrawn from Toby's previously secret plan and publicly refused to consider the compromises they'd initially offered. The president angrily orders Toby to fix what he's broken, in response to which Toby submits his resignation letter to Leo. Toby finally sits down with Josh, who is livid at having been kept out of the loop on the s.s. matter, and they discuss the president's legacy and the greater issue of making a lasting impact for the American people, after which Josh recommends turning to Dem. senator Turner to reignite the agreement, leading to a bipartisan negotiation and the White House's realization that the good of the people has to trump any presidential legacy.",
          "date": "2004-02-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA2NzMwNTY3Nl5BMl5BanBnXkFtZTgwMTcwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "8a22313c-1537-4a5f-aa42-e7a875dad42c",
          "title": "The Warfare of Genghis Khan",
          "episode": 13,
          "description": "A nuclear device is tested in the Indian Ocean, but none of the known nuclear powers will claim responsibility, leading to the possibility of a terrorist group holding missile tests. Vice President Russell, heretofore dismissed by west wing staff as a joke, a four-term congressman alleged to be securely in the pocket of a large Colorado mining company, recalls a junket he'd taken early in his political career in which a drunken Israeli statesman confessed to secret missile tests. Russell visits the sit. room and puts the military and national security leaders at ease, leading the president and Leo to reassess the man's political gravitas. Bartlet then drags the Israeli p.m. to the White House, where they debate the power of the U.S. to dictate which states should have nuclear capabilities.",
          "date": "2004-02-10T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU1NTIyNTYwMl5BMl5BanBnXkFtZTgwMzYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "5d794a89-a8e8-4bc1-95e6-98c094d9d420",
          "title": "An Khe",
          "episode": 14,
          "description": "A Navy Hawkeye AWACS crew is missing in North Korea, a Broadcaster has called CJ a chicken and a proposed tax break for stay at home moms causes Josh stress. Amidst the usual West Wing mêlée, Leo finds himself hearing things about the man who saved his life in Vietnam, that he doesn't believe.",
          "date": "2004-02-17T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA4MjEwMzYyOV5BMl5BanBnXkFtZTgwODcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "25368c3c-b420-4613-8489-fc64a4891ffc",
          "title": "Full Disclosure",
          "episode": 15,
          "description": "Press leaks lead to the revelation that former VP John Hoynes is about to release a tell-all book about the administration.",
          "date": "2004-02-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA2OTczNzA3Nl5BMl5BanBnXkFtZTgwMTMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bffa3db0-8dbb-4dd8-be3e-a3bd6a508b6a",
          "title": "Eppur Si Muove",
          "episode": 16,
          "description": "A Republican Congresswoman targets Ellie in an attempt to discredit the President; C.J. urges Abby to appear on Sesame Street; Josh works to keep a judicial nominee from withdrawing.",
          "date": "2004-03-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODIyMTM1MTUxOF5BMl5BanBnXkFtZTgwODUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "942e0ce9-1749-444e-be56-25d1aa68d91d",
          "title": "The Supremes",
          "episode": 17,
          "description": "A Supreme Court Justice dies, forcing the administration's hand on picking a desirable replacement who can be confirmed by a hostile Congress.",
          "date": "2004-03-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM0MDE0NjQ5Nl5BMl5BanBnXkFtZTgwNTQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e375ca71-2b43-4476-9261-5a20177699be",
          "title": "Access",
          "episode": 18,
          "description": "A documentary-style look at the day in the life of press secretary C.J. Cregg on a day that turns out to be anything but normal due to a FBI/terrorist standoff.",
          "date": "2004-03-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUyNTE0MjIzM15BMl5BanBnXkFtZTgwMjcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "375799b0-4845-4616-960b-656d06d38686",
          "title": "Talking Points",
          "episode": 19,
          "description": "The president and staff are about to head for Brussels to sign an international free trade deal that Josh has just spent a lot of time and effort negotiating, to nearly everyone's satisfaction; at the 11th hour, the CEO of an IBM-like company tells Josh that the first effect of the new agreement, of which his company is a huge beneficiary, will be the immediate transfer of 17,000 programming jobs to India; the head of the communications workers' union, which is representing the affected programmers, brings one of the programmers to Josh's office, and they refuse to leave, leading Josh to question the underlying adverse effects of the trade deal. Throughout the episode, Ryan tries to make Josh care that he's completing his internship that day, while Donna pesters Josh to bring her on the Brussels trip in an effort to make her a more active player in west wing activities, eventually leading to a trade-off that will mean even bigger things for Donna in the long run.",
          "date": "2004-04-20T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUwMDAzODM5Ml5BMl5BanBnXkFtZTgwMzUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "4ceec509-ffc9-42dc-8385-a49ddeed805d",
          "title": "No Exit",
          "episode": 20,
          "description": "When a bio-hazard alarm goes off in the White House, the staff are locked down where they are - forcing them to have conversations they would have otherwise avoided.",
          "date": "2004-04-27T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTExMTE5Mjk2ODBeQTJeQWpwZ15BbWU4MDEzMDI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "d45ac59d-9c02-44f4-9e00-b30490851ea6",
          "title": "Gaza",
          "episode": 21,
          "description": "A fact finding codel to the Middle East is torn apart by an explosion. Key members of the administration and their loved ones are caught in the mess. The President is forced to consider retaliatory military action in the unstable area, with possible repercussions that could last decades.",
          "date": "2004-05-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTcyMjYwNDU4M15BMl5BanBnXkFtZTgwMTQxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "eb9c5528-b43b-4701-8ece-3326d1ee026f",
          "title": "Memorial Day",
          "episode": 22,
          "description": "The President finds himself at odds with Leo, and the entire country, on his position regarding retaliation for the bombing in Gaza.",
          "date": "2004-05-18T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTA2MjQ0NTA1OF5BMl5BanBnXkFtZTgwMTAxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "6faee343-bee5-44c9-a9c1-1eac63d93990",
      "season": 6,
      "episodes": [
        {
          "id": "39e8ce53-96ec-4f0b-acc7-0793a813a49a",
          "title": "N.S.F. Thurmont",
          "episode": 1,
          "description": "Josh maintains a vigil beside Donna's bed in hospital, and needles Colin over his background and relationship with Donna. President Bartlet is determined to reject the unanimous demands of Congress, the American public, and his entire staff to retaliate for the roadside bombing. Leo tries to find a way to talk the President around while Kate tries various long-shot attempts at getting the Israelis and Palestinians to negotiate at Camp David.",
          "date": "2004-10-19T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjQ1NzY4MjQ0OV5BMl5BanBnXkFtZTgwNjkwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "1684f2b2-4695-4738-a6f8-e3e8fdd5d9dc",
          "title": "The Birnam Wood",
          "episode": 2,
          "description": "Josh returns from Germany in time to voice concerns about Leo; the Israelis and Palenstinians meet at Camp David with little chance of an agreement; the President and Leo's differences over the Middle East crisis reach a breaking point.",
          "date": "2004-10-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzE1OTUzNTMwNl5BMl5BanBnXkFtZTgwMDQwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e168fc22-7a9c-4c49-8d6f-9ef67ce8c84c",
          "title": "Third-Day Story",
          "episode": 3,
          "description": "Leo is found in the woods and rushed to the hospital; the staff struggle to hold the peace deal together without a Chief of Staff; the President neglects his duties out of loyalty and guilt towards Leo; Donna arrives back in the USA.",
          "date": "2004-11-02T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU1OTg2OTM0N15BMl5BanBnXkFtZTgwNzYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6ab01256-7510-4e6e-9bbc-6f1a9af6037c",
          "title": "Liftoff",
          "episode": 4,
          "description": "C.J.'s first day as Chief of Staff gives her a new appreciation for Leo's skill in the role. While struggling to keep up with her hectic schedule, she must handle the sudden appearance of abandoned Soviet nuclear material, counter political maneuvering within the Cabinet, and assert her authority with the staff and the President. Toby conducts a press briefing after which C.J. orders him to quickly find someone to fill the role permanently. The Democratic Party enlists Josh's help to talk Congressman Matt Santos out of taking an early retirement.",
          "date": "2004-11-09T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NzQ4MDQyNV5BMl5BanBnXkFtZTgwODExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "a74ff83a-10aa-4363-9267-8e9e9be7ad52",
          "title": "The Hubbert Peak",
          "episode": 5,
          "description": "Josh visits a car dealership and is seduced by both a hybrid and a monster SUV, despite knowing that Congress is unlikely to raise fuel efficiency standards. For political cover as well as genuine concern, he meets with representatives of the alternative energy industries. Charlie has graduated from college and is reluctant to keep his promise to the President of finding a \"real\" job. Following press complaints about Toby he agrees to take deportment lessons from Annabeth. C.J. visits Leo at his hotel and finds out why he's so insistent that the President play chess each week.",
          "date": "2004-11-16T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEyNDkxMDA1NF5BMl5BanBnXkFtZTgwMDMyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "b063795d-584b-45f5-9296-b017505262e9",
          "title": "The Dover Test",
          "episode": 6,
          "description": "The glow of the Middle East peace deal begins to fade once the hard reality of implementing change begins. Josh becomes involved in the Patient's Bill of Rights, which is becoming a political football as the Vice President and Congressman Santos both try to out-maneuver each other and the Republicans. C.J. continues to be unimpressed with Toby's performance as press secretary when he gets into a difficult position during a briefing. While working to recover from his heart attack, Leo receives a job offer from the corporate world.",
          "date": "2004-11-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTkyODYzNTQwMF5BMl5BanBnXkFtZTgwNTUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "5647c46d-0c78-44de-aa89-66fa8e72172a",
          "title": "A Change Is Gonna Come",
          "episode": 7,
          "description": "After spending months negotiating a difficult summit with China, Josh is dismayed to learn that the President accepted a flag symbolizing Taiwanese independence. Vice President Hoynes appears on television to promote his book and indicates a desire to return to politics. With the Iowa caucuses only a few months away, Vice President Russell and others begin positioning themselves to win the Democratic presidential nomination. President Bartlet finds tying his bow tie unexpectedly difficult.",
          "date": "2004-11-30T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTEyMzQ5NDczNjZeQTJeQWpwZ15BbWU4MDY4MTI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bda46a01-4dc1-4ddb-84ce-4323bf54d0c3",
          "title": "In the Room",
          "episode": 8,
          "description": "Magicians Penn and Teller give a controversial performance at Zoey's birthday party in the White House that threatens to drown out the news of the impending China trip. President Bartlet goes to New Orleans on his way to China after unexpectedly requesting briefings be postponed until they are in the air. Josh tries to decide which Democratic presidential candidate he wants to support, and is alarmed that Bartlet wants to appoint California Republican Senator Arnold Vinick to be Ambassador to the United Nations.",
          "date": "2004-12-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEzNjE3ODIxOV5BMl5BanBnXkFtZTgwNTgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e01620ca-a8cb-4f6e-97d6-a6c58f8bd454",
          "title": "Impact Winter",
          "episode": 9,
          "description": "President Bartet's attack of multiple sclerosis requires hasty reorganization of the summit in China. Unable to endure the long meetings, he becomes frustrated when the Chinese take advantage of his absence to drag their feet over North Korea. Back at the White House, Josh is told by NASA that a large asteroid is on a collision course with earth; staffers are unsure whether to prepare for the end of the world or not. Donna becomes frustrated when Josh continually postpones what she says is an important conversation. With the New Hampshire primary looming and Vinick looking like a formidable opponent, Josh and Leo try to find a Democratic presidential candidate they can believe in.",
          "date": "2004-12-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU5NjM5ODkwOV5BMl5BanBnXkFtZTgwMDkwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "d877ff38-7dfc-4fc1-992d-6efae6025fac",
          "title": "Faith-Based Initiative",
          "episode": 10,
          "description": "On the same day that an anti-gay-marriage amendment is attached to the federal budget, an Internet rumor surfaces that C.J. is a lesbian. Josh and Toby attempt to kill the amendment without forcing the President to publicly take a position on this unwinnable issue. Congressman Santos considers Josh's proposition that he run for President despite having told his wife that he's done with politics. Donna begins her new job while Josh struggles to cope with her difficult replacement. Abby and C.J. meet with the President's doctors to decide how to adapt his schedule to the increasingly debilitating effect of multiple sclerosis.",
          "date": "2005-01-04T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTAwMDIxNzc1OTleQTJeQWpwZ15BbWU4MDA2MTI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "1319bcbf-7b8a-4eb8-86f6-454e6b1e8468",
          "title": "Opposition Research",
          "episode": 11,
          "description": "Josh and Santos visit New Hampshire to launch the presidential campaign. Josh has experience running national campaigns and has a clear idea about what candidates should and shouldn't do to get elected, but Santos's approach differs dramatically: he believes in talking about big ideas rather than saying whatever he needs to do in order to win votes. This difference in opinion combined with conventional wisdom that says Santos has no chance of winning threaten to sink the campaign before it's begun. Will and Donna are also in New Hampshire, running Vice President Bob Russell's campaign - which puts their interests at odds with those of the Santos campaign.",
          "date": "2005-01-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUwMjgzMDA5OV5BMl5BanBnXkFtZTgwMDUwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "fb9115f8-7fc4-453d-b1e4-a4b5cf5e32c7",
          "title": "365 Days",
          "episode": 12,
          "description": "Leo returns to the White House to help bolster the administration, which is suffering from the loss of Josh, Donna, Will, and the Vice President to the next election campaign. Leo's first day back follows President Bartlet's last State of the Union address, and unlike in previous years there appears to be little momentum on bold, large-scale initiatives. Amidst numerous distractions that dilute the focus of the staff (kidnappings in Colombia, the First Lady's appearance at a NASCAR race, and petulant Congressmen), he challenges the administration on their agenda for their remaining year in office.",
          "date": "2005-01-18T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA4NjE4MzEyOV5BMl5BanBnXkFtZTgwODgxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "14d1f8c4-bb61-4aeb-b1c5-c9aa34c34276",
          "title": "King Corn",
          "episode": 13,
          "description": "A day in the lives of presidential candidates Bob Russell, Matt Santos, and Arnold Vinick, who are in Iowa trying to gain support for their campaigns. Iowa is the first state in the nation to hold their presidential caucuses, and issues affecting farmers and rural areas are the focus. The most important issue on the table is the large federal subsidies for ethanol fuel given to corn growers, which is supported by Iowa residents but seen as naked pandering by the rest of the country. Josh continues to clash with Santos over winning votes instead of proposing radical policy. Donna and Josh continue to avoid speaking about the state of their relationship.",
          "date": "2005-01-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjEzNjgwMjgxMF5BMl5BanBnXkFtZTgwNjExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "17479e8b-ba6d-4ce9-a7ff-af60f79b4d8a",
          "title": "The Wake Up Call",
          "episode": 14,
          "description": "CJ and Abbey go twelve rounds on how to handle President Bartlett and his disease. Lord Marbury makes his return to the White House after a British commercial plane gets shot down by Iran. Toby splits his time between helping write a Belarus constitution and the yearly meeting with Miss World",
          "date": "2005-02-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjMxNTMxMTc3MF5BMl5BanBnXkFtZTgwMjUyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "78a1c162-47f6-4358-89a6-ee2cd842bb8a",
          "title": "Freedonia",
          "episode": 15,
          "description": "Five days before the New Hampshire Democratic primary, the Santos campaign risks extinction as Matt has not been invited to the last debate. Josh proposes a number of strategies to get Santos into the debate, including deal-making, legal challenges, attack ads, and publicity stunts - but the Congressman is reluctant to play along. With Josh scrambling to keep the campaign alive, Santos calls in help from Washington to tune his message. Hoynes and Russell launch attack ads on each other's records, and Josh realizes that a desperate long-shot is needed to keep Santos in the race.",
          "date": "2005-02-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUzODM3MzU2M15BMl5BanBnXkFtZTgwNzUxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "22d17662-2d4c-4451-834f-77a5fc04d5a4",
          "title": "Drought Conditions",
          "episode": 16,
          "description": "Back in Washington briefly, Josh visits the White House and is surprised to discover that as a campaign manager he is no longer part of the inner circle in an administration that wants to remain neutral in the Democratic primary. Toby is the focus of some concern after being more withdrawn than usual and also because he is nursing a cut on his face that he doesn't want to talk about. Charlie tells Kate that a guy at his gym has been asking about her, but she's unsure if she's ready to date again. A multi-state water rights fight pitches C.J. against lobbyist Cliff Calley, who proves to be both infuriating and intriguing. Josh and Donna are both suspicious when far-left Senator Rafferty joins the race, obviously as a spoiler candidate.",
          "date": "2005-02-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU4NjE5MDYyMV5BMl5BanBnXkFtZTgwNzIxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "85cdb8c5-8830-4ad2-ac96-1f8936f364c2",
          "title": "A Good Day",
          "episode": 17,
          "description": "The Speaker of the House deliberately calls a vote on stem cell research when he knows that Democrats will be away from Washington; Donna, Cliff, Matt, and Josh must put aside their differences to foil the plan. Kate is shocked when a minor hunting mishap on the Canadian border threatens to become a major international incident. A Japanese economist who has been President Bartlet's arch-rival since college is attending a formal dinner at the White House, creating a potentially explosive situation. Toby tries to avoid meeting with a group of middle school children who want a constitutional amendment lowering the voting age.",
          "date": "2005-03-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU5MDgxNDg0OV5BMl5BanBnXkFtZTgwNDcxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ed1ab40d-2219-4d30-84e8-e01c3a33525b",
          "title": "La Palabra",
          "episode": 18,
          "description": "Hoynes and Russell are campaigning in New York, confident of their prospects in the California primary. Santos needs to do unexpectedly well in California in order to stay financially afloat; another third place finish will see his donors shift their money elsewhere, finishing his campaign. Santos's message of education and health care is overshadowed when California passes a law prohibiting drivers licenses for illegal immigrants. Despite the bill being widely supported by most voters, Matt cannot publicly endorse it as he's counting on the support of Latino voters, who expect him to denounce it.",
          "date": "2005-03-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODkyNjY3NDQxMl5BMl5BanBnXkFtZTgwMzMxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "3e3d4064-caf6-46fb-963a-7f49798ad994",
          "title": "Ninety Miles Away",
          "episode": 19,
          "description": "Rumors circulate in Washington yet again about the state of Fidel Castro's health. As C.J. begins to look into the issue she uncovers some dark secrets regarding the United States' relationship with Cuba which appear to involve Leo, the President, and Kate Harper. Despite how closely guarded and potentially explosive this information is, a startlingly large number of government agencies and officials appear to know bits and pieces of the story. This results in undercover political maneuvering to avoid what is expected to be an enormous political disaster. Meanwhile, Charlie calls in different professionals to deal with a suspected termite problem in the White House.",
          "date": "2005-03-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc3NTg1NzU5M15BMl5BanBnXkFtZTgwOTIwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "77743d9e-e4ba-4d89-ba27-77b104bebfb3",
          "title": "In God We Trust",
          "episode": 20,
          "description": "Senator Arnold Vinick easily wins the Republican nomination on the night of the New Jersey primary, but has difficulty picking a running mate. Choosing Reverend Don Butler would virtually guarantee him the presidency, but their differing views on abortion and religion would make it a political union rather than one based on shared ideology. The Democratic nomination is a toss-up between Santos and Russell; Hoynes is running a distant third. With no clear nominee going into the convention, the Democratic party risks appearing unsure about both Santos and Russell - a position that President Bartlet does not want the Republicans to be able to exploit.",
          "date": "2005-03-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM1NzkwNjI1NV5BMl5BanBnXkFtZTgwNzgwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "388cbcda-795b-4def-bd7c-404748038e2d",
          "title": "Things Fall Apart",
          "episode": 21,
          "description": "While Vinick and the Republicans deliver a flawless albeit predictable convention, the Democratic convention looks to be more like a pie fight as there is no clear favorite. Russell tries to preempt the floor vote by hinting offers of the vice presidential nomination to both Santos and Governor Baker of Pennsylvania. Charlie and Zoey's relationship is becoming more serious, resulting in different reactions from the President and the First Lady. An air leak on the International Space Station will kill all three astronauts unless a rescue mission can be launched. NASA advises that their shuttles are unfit for flight, but then hints at another solution.",
          "date": "2005-03-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU5MTExNzYyMF5BMl5BanBnXkFtZTgwODYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "3cf4ca89-e1b4-4118-ac67-dfa08a48d92f",
          "title": "2162 Votes",
          "episode": 22,
          "description": "WHO WILL BE THE DEMOCRATIC PRESIDENTIAL CANDIDATE? - It's the Democratic National Convention and the race to become the Democratic Presidential candidate has narrowed to three candidates: Russell, Baker and Santos. Also, Bartlet must wrestle with the decision to launch the super-secret defense shuttle to rescue the astronauts trapped at the space station and risk national security or let them die.",
          "date": "2005-04-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BOTY3Nzg5MDc1N15BMl5BanBnXkFtZTgwOTgxMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    },
    {
      "id": "a52ee1f9-5644-4d91-b0eb-1bf1d8a4bc7e",
      "season": 7,
      "episodes": [
        {
          "id": "0a77fb91-0734-48a1-aa45-c7f901a522e5",
          "title": "The Ticket",
          "episode": 1,
          "description": "Four days after the Democratic convention, Josh begins to staff up the Santos campaign. With Santos and Leo effectively strangers - and Leo not an experienced campaigner - adjustments of roles and responsibilities are required in order to deliver a strong and consistent message. The White House prepares to launch the military Space Shuttle on its rescue mission to the Space Station amidst growing suspicion that proof of its existence was deliberately leaked by someone in the Administration. The Republicans offer Bartlet a concession on an education bill in an attempt to drive a wedge between him and the Santos campaign.",
          "date": "2005-09-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTUzMTMwMzI5NV5BMl5BanBnXkFtZTgwNjQyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "468ca4f5-ddcb-4fc5-93e9-342ecf8721e4",
          "title": "The Mommy Problem",
          "episode": 2,
          "description": "Despite vigorous campaigning, the Santos campaign still struggles to articulate its message and keep the focus on domestic issues rather than gossip and trivia. Although Santos served decades in the military and remains in the reserves, Vinick still appears the stronger candidate on national security issues due to stereotypes about Republicans and Democrats. The White House's decision to halt their own investigation into the leak is a savvy legal move, however it could prove to be costly politically: while Vinick can slam the President for this decision, it's not so easy for Santos to do so. Josh reluctantly recruits help with running the campaign when it becomes obvious that he's trying to do too much himself.",
          "date": "2005-10-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjAxNTEyOTkxNF5BMl5BanBnXkFtZTgwNTMyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "09749363-8128-4d9c-b1ff-178e7b56c97c",
          "title": "Message of the Week",
          "episode": 3,
          "description": "With Santos gaining momentum, the Vinick campaign devises a strategy to catch them off-guard by focusing on immigration issues: by taking a pro-immigration stance, they force Santos to spend time courting the Latino vote. A powerful Christian group is nervous about supporting a Republican presidential candidate who is pro-choice, and demands a guarantee that Vinick only appoint pro-life judges. Vinick hopes that the strong religious credentials of his running mate Sullivan will be enough to satisfy the Christian base, but inevitably finds himself in a difficult situation.",
          "date": "2005-10-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI2NTQ2NzA0Nl5BMl5BanBnXkFtZTgwODkwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "7493a9be-597d-4b65-9e56-680aa90bb410",
          "title": "Mr. Frost",
          "episode": 4,
          "description": "The Santos campaign faces questions on intelligent design and evolution during a campaign stop focusing on education in Pennsylvania. Margaret testifies before the committee investigating the leak, which has also served most current and former members of the Bartlet administration with subpoenas. A suicide bombing in the Middle East throws the region into chaos and threatens to postpone all campaigning. An intelligence analyst assigned to brief the Vinick campaign demands to speak with CJ.",
          "date": "2005-10-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTc2NTQ0MTI0MV5BMl5BanBnXkFtZTgwMzExMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "186350b6-5b36-4a14-bd74-a8a10ddd1535",
          "title": "Here Today",
          "episode": 5,
          "description": "Toby's confession sends shock waves through the White House; Kate tracks developments following the assassination in Kazakhstan; the Santos campaign appears stalled.",
          "date": "2005-10-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI4NDM1MzM3NV5BMl5BanBnXkFtZTgwOTkwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "bdd5e1a8-4fe9-4fde-942e-777603b84a22",
          "title": "The Al Smith Dinner",
          "episode": 6,
          "description": "A pro-life special interest group launches an ad attacking Santos for his abortion stance, but Vinick also sees it as trouble since he's also pro-choice and doesn't want to draw attention to the issue. With Vinick ahead in the polls, he has no incentive to debate Santos and thus continues to drag his feet over negotiations. Back at the White House, C.J. orders new Communications Director Will Bailey to not answer questions from the press about the leak investigation.",
          "date": "2005-10-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTU1NTQ3OTcyNF5BMl5BanBnXkFtZTgwNDYwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "07dd7613-2ce6-460b-945d-bec7c2396cf1",
          "title": "The Debate",
          "episode": 7,
          "description": "A live debate between Santos and Vinick, performed once for the east coast and once for the west.",
          "date": "2005-11-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjAyNzI0NjI1NV5BMl5BanBnXkFtZTgwODMwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "1a32814c-4a6a-46ed-8501-80145724f37d",
          "title": "Undecideds",
          "episode": 8,
          "description": "The Santos campaign's difficulties with the black community continue when a Latino police officer shoots a black child; C.J. offloads preparations for Ellie's wedding to Will when Kate needs her help with Kazakhstan; Josh visits Toby.",
          "date": "2005-12-03T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNTA3MDE3MjgzMl5BMl5BanBnXkFtZTgwMjcyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "0cd95163-69a5-48db-8e1b-d0e066ff5ac9",
          "title": "The Wedding",
          "episode": 9,
          "description": "President Bartlet's plan to attend his daughter Ellie's White House wedding is jeopardized when Russia and China mobilize troops over growing chaos in Kazakhstan. The Santos campaign has gained ground on Vinick over the last few weeks, but with less than two months until the election it's not clear that the gap can be closed. As Josh obsesses over the electoral math, tracking polls, and decisions on where to spend advertising money, some Democrats are nervous that the election is slipping away, and urge Santos to fire Josh as campaign manager.",
          "date": "2005-12-10T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzc5NjgzNDcyMl5BMl5BanBnXkFtZTgwMjYyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "48c45c3b-daef-4e1a-b7e8-f1ebe2ec0429",
          "title": "Running Mates",
          "episode": 10,
          "description": "Leo's preparation for the Vice Presidential debate is going badly; Santos makes his last trip home before the election; Will and Kate continue to flirt.",
          "date": "2006-01-07T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ3NDAzMjI5NF5BMl5BanBnXkFtZTgwNjEwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "398bc63d-6ccf-46da-b003-4612512cc735",
          "title": "Internal Displacement",
          "episode": 11,
          "description": "Danny tells C.J. some important news about the President's son-in-law over dinner; C.J. attempts to broker an international deal to stop genocide in Darfur; Josh twists C.J.'s arm to get her to help the Santos campaign.",
          "date": "2006-01-14T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTkzMTI1ODE5N15BMl5BanBnXkFtZTgwNTcwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "e4c18723-21d0-40f6-8408-8a864efca4a5",
          "title": "Duck and Cover",
          "episode": 12,
          "description": "A nuclear accident in California sends the White House and both campaigns into overdrive. Meanwhile, China and Russia appear headed for a showdown over elections and oil in Kazakhstan.",
          "date": "2006-01-21T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTAxNzE4OTUxMzdeQTJeQWpwZ15BbWU4MDg2MTI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "33ac14d4-3577-437a-b71c-46b63183b207",
          "title": "The Cold",
          "episode": 13,
          "description": "The Vinick campaign struggles with the impact of the nuclear accident in California; Josh and Donna have a \"moment\".",
          "date": "2006-03-11T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI2OTU4ODE0MV5BMl5BanBnXkFtZTgwMDYwMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "192a48e6-a370-400a-b6ab-7c0c871dd3fe",
          "title": "Two Weeks Out",
          "episode": 14,
          "description": "Both candidates face vital choices about which states to campaign in; Vinick tries to put the nuclear issue behind him; Bruno finds Santos's briefcase.",
          "date": "2006-03-18T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI0ODg0ODUyN15BMl5BanBnXkFtZTgwMzcyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "2af31ca9-da12-428b-a412-7ea8bd954962",
          "title": "Welcome to Wherever You Are",
          "episode": 15,
          "description": "A federal prosecutor's threat to indict Toby on another charge has the potential to affect the impending election.",
          "date": "2006-03-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ3NDE2MDk0N15BMl5BanBnXkFtZTgwMzEyMjY1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "591d834f-e5aa-488d-b559-ebd92231a414",
          "title": "Election Day: Part 1",
          "episode": 16,
          "description": "Election day finally arrives; C.J. ponders job offers; the election looks too close to call.",
          "date": "2006-04-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTAxMjQzMjk4ODZeQTJeQWpwZ15BbWU4MDAzMTI2NTIx.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "d9481db0-78e9-42e5-8c14-729332e49a05",
          "title": "Election Day: Part 2",
          "episode": 17,
          "description": "Polls are closing across the country, and the race is too close to call; friends and colleagues react to the news about Leo.",
          "date": "2006-04-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjA3MTkxMTY1NV5BMl5BanBnXkFtZTgwMDIyNjU1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "619acaa0-58a3-4e3d-8e2e-5e0e348b4cb7",
          "title": "Requiem",
          "episode": 18,
          "description": "President Bartlet and his current and former staffers come together for Leo's funeral.",
          "date": "2006-04-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQxNDY4ODYxM15BMl5BanBnXkFtZTgwMDU0NzQ1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "5cbfddba-5336-4909-96c4-6cb49e3a5d0e",
          "title": "Transition",
          "episode": 19,
          "description": "Eyebrows are raised when the President-elect places a call to the president of China and offers a different position than that of Bartlet. Meanwhile, Josh picks his deputy chief of staff.",
          "date": "2006-04-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQyOTI4NTY4N15BMl5BanBnXkFtZTgwNTIyNjU1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "df885ce4-1a78-42c6-bb86-4d1e43052875",
          "title": "The Last Hurrah",
          "episode": 20,
          "description": "While Santos is wrapped up in choosing his new Vice President, Helen is overwhelmed by the issues facing the new First Family. Meanwhile, Vinick must find a new road now that the election is over.",
          "date": "2006-04-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE1ODU3MDc2N15BMl5BanBnXkFtZTgwOTcxNjU1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "9fe1691e-a0d5-4653-946f-60c784dac04e",
          "title": "Institutional Memory",
          "episode": 21,
          "description": "Two weeks before the inauguration, CJ and the rest of the Bartlett administration consider what they will do next. CJ examines her relationship with Danny and considers whether or not to suggest to the President pardoning Toby.",
          "date": "2006-05-06T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjM2MTEyMjIzNF5BMl5BanBnXkFtZTgwMDI0OTU1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "27aa8d2d-6f7b-4a62-8a21-f5d5ee37ffae",
          "title": "Tomorrow",
          "episode": 22,
          "description": "Santos and his staff prepare for the inauguration as Bartlet and his team look back on their years in the White House.",
          "date": "2006-05-13T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjIzOTQwNzUzMF5BMl5BanBnXkFtZTgwMjQ0OTU1MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    }
  ]
}