{
  "id": "b8368045-671e-4837-85ce-d6f18cd8fa4a",
  "description": "A comprehensive survey of the American Civil War.",
  "title": "The Civil War",
  "image": "https://m.media-amazon.com/images/M/MV5BZjE1ODNkYzctNjM0Ni00MmM3LTkyMjctZGRhYzA3YzhjMTFlXkEyXkFqcGdeQXVyNjAwNDUxODI@.jpg",
  "genres": [
    4,
    7,
    6
  ],
  "seasons": [
    {
      "season": 1,
      "episodes": [
        {
          "title": "The Cause (1861)",
          "episode": 1,
          "description": "Slavery began to flourish in the U.S. at the end of the 18th century with Eli Whitney's invention of the cotton gin. Whereas it would take one person a day to produce a pound of clean cotton, the cotton gin could produce 1000 lbs per day. Business boomed and the demand for slaves to work new cotton fields rose accordingly. Serious objections to slavery began as early as 1831 and the abolitionist movement in the North grew quickly. There was particular concern about whether new States entering the Union would be free or slave States. Some, like John Brown, added religious zealotry to the cause and his raid on the federal at Harper's Ferry in 1859 ended in failure. The Southern States were genuinely concerned that the Union would outlaw slavery altogether. There were 21 million people living in the North compared to only 9 million in the South, which included 4 million slaves. The turning point came in the election of 1860 which essentially became a referendum on slavery. The South reacted swiftly to the election of Abraham Lincoln, burning him in effigy. Between Lincoln's election and his inauguration, 7 southern States seceded from the Union. The expected war began with the attack on fort Sumter. At the time, the Union Army had only 17,000 men and only 2 generals had combat experience. Thus began a massive recruitment campaign on both sides. In July 1861, the first battle of the war took place at Manassas, Virginia just across the Potomac from Washington. It proved to be a disaster for the North.",
          "date": "1990-09-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjExNTg4NjI3N15BMl5BanBnXkFtZTgwMjA2ODc3MjE@.jpg"
        },
        {
          "title": "A Very Bloody Affair (1862)",
          "episode": 2,
          "description": "By 1862, both sides had 1 million men in uniform across a 1000 mile battle front ranging from Manassas, Virginia to Missouri. Battles had taken a horrendous toll in human lives on both sides. Lincoln and his Cabinet were frustrated by the slow pace of the war and with Gen. George B. McClellan who apparently did not want to engage the enemy. The eventual attack on the Confederate capital, Richmond - by transporting Union troops by boat to the peninsula southeast of Confederate capital - was met by stiff resistance from a force one-tenth its size. McClellan dug in at Yorktown and the battle dragged on. Meanwhile, the South had a new weapon in the form of the Merrimack, the first ironclad ship far more powerful that anything the North had immediately available but they eventually responded with the Monitor, which won the epic battle of iron ships when the Merrimack withdrew. In the West, Union Gen. U.S. Grant won two crucial victories and enhanced his reputation as well by demanding unconditional surrender. Although the Battle of Shiloh in April 1862 resulted in a Union victory, that was certainly not obvious at the end of the first day. Adm. David Farragut went down the Mississippi and claimed New Orleans, splitting the Confederacy in two.",
          "date": "1990-09-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMzU2Mzk1NTg4NF5BMl5BanBnXkFtZTgwNjk1ODc3MjE@.jpg"
        },
        {
          "title": "Forever Free (1862)",
          "episode": 3,
          "description": "While Gen. McClellan sat outside Richmond, three Union armies were being kept occupied by Stonewall Jackson and J.E.B. Stuart in northwestern Virginia. Lee was named commander of the army of Northern Virginia and immediately seized the initiative and attacked McClellan at Mechanicsville. Growing increasingly frustrated at McClellan's lack of progress, Lincoln visited him on the battlefield. When the general told the President that hew needed yet more troops, Lincoln ordered him to withdraw. Cotton production was cut in the south hoping this would spur the major European powers, England and France, to recognize and perhaps even aid the Confederacy. Progress was being made on the issue of emancipating the slaves. Congress forbade the return of runaway slaves and in New Orleans, the military Governor would free the slaves of any landowner who complained. Lincoln realized that emancipation would have to be delayed until the Union had a major victory on the battlefield. That would not come until the battle of Antietam in September 1862.",
          "date": "1990-09-23T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQzNDg1NTA2MV5BMl5BanBnXkFtZTgwNzk1ODc3MjE@.jpg"
        },
        {
          "title": "Simply Murder (1863)",
          "episode": 4,
          "description": "By early 1863, Union soldiers with the Army of the Potomac had not been paid for 6 months and supplies were thin. Some 200 men were deserting every day and by January one-quarter of the men were AWOL. Gen. Ambrose Burnside, the new Union commander, wanted to take Fredericksburg but delays in getting the pontoon boats to cross the Rappahannock river allowed Lee to amass 75,000 men. The Union army was blown away and 9,000 men were killed. Elsewhere, the Confederate army was matching this success and a Union flotilla was captured. Lincoln called for more troops and in February, pushed a conscription bill through Congress. Both conscription and the freeing of the slaves were not universally popular and anti-war sentiment was growing. Jefferson Davis had his own problems however. His need to centralize authority did not sit well those who supported States rights. The economy began to collapse with high inflation and resulting protests. By the end of the year, 40% of the Confederate army was absent with or without leave. Lincoln replaced Burnside with General Hooker whose main force met Lee at Chancellorsville. The Union army suffered another massive defeat with the loss of 17,000 men. The Confederate army however lost 13,000 men killed or wounded including Gen. Stonewall Jackson who lost an arm and died of pneumonia. While Grant laid siege to Vicksburg, Lee invaded the north once again.",
          "date": "1990-09-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ3NzY3ODQwM15BMl5BanBnXkFtZTgwMDA2ODc3MjE@.jpg"
        },
        {
          "title": "The Universe of Battle (1863)",
          "episode": 5,
          "description": "In trying to draw Union troops away from the siege of Vicksburg, Robert E. Lee invaded Pennsylvania and over three days 150,000 men would do battle at Gettysburg. Confederate soldiers had gone into Gettysburg as they had heard there was a large supply of shoes available. The town soon became the focus of the battle that would shape the rest of the conflict. On the first day at Gettysburg, the Union forces were pushed back and by mid-afternoon, Confederate soldiers occupied the town. The second day focused on positioning leading to the battle of Little Round Top. an ideal position from which to gain the high ground and battlefield. The Union quickly gained control of the site and repelled several Confederate attempts to oust them. On day three, Lee ordered Gen. George Pickett to lead the charge against the Union forces on Cemetery Hill. Gen. Meade anticipated the attack and the rout of Confederate forces was complete with 6,500 casualties including most of the commanders. The next day, Lee began the retreat to Virginia and wrote to Jefferson Davis offering to resign; Davis declined the offer. In Vicksburg meanwhile, Grant's artillery bombarded the city daily leading to the Confederate surrender. In the North, Lincoln's conscription bill allowed those who paid $300 to be exempted. It led to the New York draft riots where for three days the mob was in control, killing blacks at every turn. The first black regiments when into battle and fought and died with honor. In the battle of Chickamauga, the Union forces again prevailed.",
          "date": "1990-09-24T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE2Mjc3MDY5OF5BMl5BanBnXkFtZTgwNDA2ODc3MjE@.jpg"
        },
        {
          "title": "Valley of the Shadow of Death (1864)",
          "episode": 6,
          "description": "By 1864, Union forces had the upper hand, though the end of war was not yet in sight. President Lincoln named U.S. Grant the overall commander of the Union army, 533,000 strong and the largest army in the world. He was made a three star Lieutenant General, a rank last held by George Washington. He brought a different approach than his predecessors, choosing to aggressively pursue Lee's army, realizing that to do so would likely see them take control of Richmond. Success was not assured and did not come quickly. Their first encounter went to Lee, but Grant used a flanking maneuver to push Lee's army ever closer to Richmond. The Confederate side suffered a major blow with the death of J.E.B. Stuart, perhaps Lee's most trusted General. At Cold Harbor, Grant suffered a terrible defeat, losing thousands of men. He subsequently bypassed Richmond and went further south to Petersburg and dug in, leading to a long siege. Grant ordered Gen. Sherman to push toward and eventually attack Atlanta. Time was running out for Lincoln, who was facing reelection and would likely lose if Union forces did not soon have a major victory.",
          "date": "1990-09-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTY5OTEwMjgyOF5BMl5BanBnXkFtZTgwNTA2ODc3MjE@.jpg"
        },
        {
          "title": "Most Hallowed Ground (1864)",
          "episode": 7,
          "description": "By the summer of 1864, the Union push had been stopped. At Petersburg, Union troops had been entrenched in an intricate network trenches for two months. The key to victory lay in Sherman capturing Atlanta and on July 22, the battle began and by September, Confederate Gen. Hood abandoned the city. In Virginia, Gen. Sheridan was laying waste to the Shenandoah Valley. For Lincoln, he faced an election in the midst of a civil war, something unknown at the time. Lincoln seemed unelectable and the Democrats were running the ousted Gen McClellan as their candidate. The Democrats had as their platform the immediate cessation of all hostilities. The election became a referendum on the war itself. By November, Lincoln and his running mate won a resounding victory with 55% of the popular vote. In the South, discouragement set in with the realization that they could not win the war.",
          "date": "1990-09-25T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjc1MDU5OTU3Nl5BMl5BanBnXkFtZTgwOTk1ODc3MjE@.jpg"
        },
        {
          "title": "War Is All Hell (1865)",
          "episode": 8,
          "description": "By the beginning of 1865, the Confederacy was coming to an end. Atlanta had been overrun and Sherman was marching to the sea. Lincoln approved Sherman's plan against the advice of those around him. Sherman set fire to Atlanta, burning anything that could be of use to the opposition. With 62,000 men, he set off toward Savannah. While Sherman went south, the bulk of the Confederate army outside Virginia was destroyed at the battle of Franklin, Tenn. and by early January, Sherman turned northward into the Carolinas. In Virginia meanwhile, Lee's army was under-equipped and underfed. He called on the legislature to arm slaves promising them freedom after the war ended. They complied. On March 4, 1865, Lincoln was inaugurated for his second term. Grant's army was firmly entrenched outside Petersburg for some 9 months. Lee's army was dwindling with an ever increasing number of deserters and when the battle eventually came, it was only a matter of time until the Union won. Richmond was evacuated and on April 3, Lincoln and his son visited the conquered city. By April 9, Lee was surrounded and outnumbered 5 to 1 and he surrendered. Living in Washington, the actor John Wilkes Booth was a supporter of the Confederacy and a white supremacist. His original plan to kidnap Lincoln failed but by the time the war ended, he had devised a new plan.",
          "date": "1990-09-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NTE3NTk3M15BMl5BanBnXkFtZTgwNjA2ODc3MjE@.jpg"
        },
        {
          "title": "The Better Angels of Our Nature (1865)",
          "episode": 9,
          "description": "The North celebrated Lee's surrender and the end of the war. On April 14, Good Friday, John Wilkes Booth learned that President Lincoln, General Grant and others were to attend a play at the Ford theater. The Grants decided not to attend and left Washington for Philadelphia. Booth shot the President in the back of the head, and Lincoln died the next day at 7:22 a.m. The news flashed across the country via the telegraph and celebration turned to sorrow. Scattered fighting continued into May but on May 23, a victory parade was held in Washington. By July, eight of Booth's co-conspirators were found guilty and four of were hanged. Those who survived the war returned home and resumed their lives. Sherman was frequently sought as a political candidate bur flatly refused to serve in any capacity. Sheridan remained in the army and was active in the Indian wars that followed. In the South, Jefferson Davis was vilified as the true villain of the war and spent two years in custody, but was never convicted and released. Robert E. Lee maintained a low profile, becoming a college president. U.S. Grant served two terms as President of the United States but his time in office was marred by scandal and corruption.",
          "date": "1990-09-26T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BNjkyMjk4MTM3OF5BMl5BanBnXkFtZTgwMTA2ODc3MjE@.jpg"
        }
      ]
    }
  ]
}