{
  "id": "d37ce52c-d2f1-4c37-8270-723b57af85cb",
  "description": "Africa, the world's wildest continent. David Attenborough takes us on an awe-inspiring journey through one of the most diverse places in the world. We visit deserts, savannas, and jungles and meet up with some of Africa's amazing wildlife.",
  "title": "Africa",
  "image": "https://m.media-amazon.com/images/M/MV5BNDdkZGViNzctZTJkMy00N2ZmLTg4NTUtZWM3YTE3ZTE3NjYwXkEyXkFqcGdeQXVyNjAwNDUxODI@.jpg",
  "genres": [
    4,
    5
  ],
  "seasons": [
    {
      "id": "85b644e7-338f-4dfb-bbf1-f45402feaffe",
      "season": 1,
      "episodes": [
        {
          "id": "acb0868c-3725-4fa1-9171-1ef9aa6c9206",
          "title": "Kalahari",
          "episode": 1,
          "description": "Deserts, like southern Africa's Kalahari and Namib, are strange and by definition are particularly dangerous and demanding environments, requiring elaborate adaptations. Some are behavioral, like tricks to steal food or even lay eggs in live hosts. other are anatomical. All the more precious is the rare water, so drinking pools are crucial for carnivores and preys. Astonishingly, vast quantities are trapped in huge cave systems underground, where aquatic life is scarce due to little food and light dripping in.",
          "date": "2013-01-01T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MDEyNTA2Nl5BMl5BanBnXkFtZTgwMDE4OTM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "6e585775-aba8-4888-95ea-76e38017a2f9",
          "title": "Savannah",
          "episode": 2,
          "description": "Volcanoes, some still active, shape East Africa's vast savannas, mainly consisting of grasslands where huge wildebeest and other herds roam and their annual migration steers the habitat type's complex life cycle. Some areas still remain primeval jungle, or became marshes or even hostile salt zones, yet all harbor intensive wildlife,whose lives are a merciless struggle for life, for elephants as well as insectivores.",
          "date": "2013-01-08T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjE4ODA3MjAwM15BMl5BanBnXkFtZTgwMTE5MDM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "9d8e9d7f-8761-4db5-bb1a-50d505db546a",
          "title": "Congo",
          "episode": 3,
          "description": "The rain forest in and around equatorial Africa's Congo basin is the continent's richest and most varied environment. The abundance of food however also means extremely competition for it, while plants race to the light, using surprisingly dirty trick to 'cheat' for a spot in one of many stories from the ground to the tower-high canopy.",
          "date": "2013-01-15T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BODkyODk5OTc4OF5BMl5BanBnXkFtZTgwNTY4MDM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "aa6dbe4c-fc71-4c63-b391-cf027d13ac8b",
          "title": "Cape",
          "episode": 4,
          "description": "Southern Africa is a riot of life and color. But if it was not for two great ocean currents that sweep around and shape the continent's Great Cape it would be a desert. This episode celebrates the rejuvenating powers of the ocean.",
          "date": "2013-01-22T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjI0NjUxNjIwMF5BMl5BanBnXkFtZTgwMjg4MDM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "0cd49088-0584-4895-94a6-dd768d87aac8",
          "title": "Sahara",
          "episode": 5,
          "description": "The Sahara. Covering a vast swathe of Northern Africa, it is the largest desert in the world. On the surface, it appears to be a desolate empty land, but there are a few specialist species who have adapted to this harsh landscape.",
          "date": "2013-01-29T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMjMzNDc2NzMzNF5BMl5BanBnXkFtZTgwMzE5MDM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        },
        {
          "id": "ee8fbdaa-b789-4439-b13c-9d0055c66263",
          "title": "The Future",
          "episode": 6,
          "description": "David Attenborough takes a look at the future of the world's warmest and wildest continent, which like our planet saw more change in the last half-century then ever before, and must expect even more. Problems like demography and climate change are immense, exacerbating others like poaching and habitat loss. Nevertheless he sees positive things too, like growing conservation awareness and efforts from native tribes.",
          "date": "2013-02-05T22:00:00.000Z",
          "image": "https://m.media-amazon.com/images/M/MV5BMTcxNjM3MTMwNl5BMl5BanBnXkFtZTgwNzY4MDM0MjE@.jpg",
          "file": "https://epic-stream-api.netlify.app/placeholder.mp4"
        }
      ]
    }
  ]
}