{
  "seasons": 1,
  "episodes": [
    {
      "title": "Episode 1",
      "season": 1,
      "episode": 1,
      "description": "Two rich, eligible and handsome young bachelors gallop into Hertfordshire and the lives of every hopeful young maiden and her ambitious mother in the neighborhood. Mr Bingley has bought Netherfield Park and has brought his sisters and friend, Mr Darcy, with him. To Mrs Bennet at Longbourn House, they are the answer to her prayers. She has five daughters to marry, and their dowries are not large.",
      "date": "1996-01-13T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNTQ3MjU2MTAzNF5BMl5BanBnXkFtZTgwMDEwMjIyMjE@.jpg"
    },
    {
      "title": "Episode 2",
      "season": 1,
      "episode": 2,
      "description": "The Bennets are expecting a visitor - Mr Bennet's clergyman cousin, who will inherit the estate in the absence of any direct male heirs. Mr Collins is coming to Longbourn with the intention of healing the rift between his branch of the family and the Bennets. Though Mrs Bennet cannot help thinking he has come to check over the place, he arrives with the best of intentions.",
      "date": "1996-01-13T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc5NjYyNDIzN15BMl5BanBnXkFtZTgwODAwMjIyMjE@.jpg"
    },
    {
      "title": "Episode 3",
      "season": 1,
      "episode": 3,
      "description": "Less than three days after Mr Collins' proposal to her, Elizabeth is shocked to discover that he has been accepted by her best friend, Charlotte Lucas. Elizabeth cannot believe Charlotte can demean herself so, but her friend tells her that she cannot afford to be choosy and Mr Collins is a good catch. The marriage is to be soon, but Charlotte begs her to visit them at Hunsford Parsonage in March.",
      "date": "1996-01-14T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY4NjE3MDIyMV5BMl5BanBnXkFtZTgwNzEwMjIyMjE@.jpg"
    },
    {
      "title": "Episode 4",
      "season": 1,
      "episode": 4,
      "description": "Angry and upset over his rejection, Darcy decides to defend himself. He waylays her on her morning walk, hands her a letter and leaves. The contents leave Elizabeth reeling. Darcy indeed had good cause for his behavior towards Wickham, but Elizabeth can only shake her head in sorrow and disagreement as she reads that, when he separated Bingley from Jane, he believed her to be indifferent to him.",
      "date": "1996-01-14T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUxNzQzODQzMF5BMl5BanBnXkFtZTgwNTEwMjIyMjE@.jpg"
    },
    {
      "title": "Episode 5",
      "season": 1,
      "episode": 5,
      "description": "The following day, the Bingleys and Georgiana (Darcy's sister) arrive at Pemberley. Soon after, they call upon Elizabeth, who is staying nearby at the inn in Lambton. The visit is a success: Elizabeth immediately warms to Georgiana and Mr Bingley is clearly delighted to see Elizabeth again.",
      "date": "1996-01-15T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAzODE1Mzc1MF5BMl5BanBnXkFtZTgwNDEwMjIyMjE@.jpg"
    },
    {
      "title": "Episode 6",
      "season": 1,
      "episode": 6,
      "description": "After Lydia is married, she and Wickham come to Longbourn for a visit before joining Wickham's new regiment in the North. She is as silly as ever and very proud of her success in catching Wickham, even offering to get husbands for her sisters. But she accidentally lets slip that Darcy was at her wedding. Elizabeth writes to Mrs Gardiner for an explanation.",
      "date": "1996-01-15T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkzMzQxMjU2N15BMl5BanBnXkFtZTgwMTEwMjIyMjE@.jpg"
    }
  ]
}