{
  "seasons": 1,
  "episodes": [
    {
      "title": "Ocean World",
      "season": 1,
      "episode": 1,
      "description": "The ocean's influence dominates the world's weather systems and supports an enormous range of life. This first episode demonstrates the sheer scale, power and complexity of the \"Blue Planet\".",
      "date": "2002-01-26T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc0NzY1OTk5MV5BMl5BanBnXkFtZTgwNzE3MjIyMjE@.jpg"
    },
    {
      "title": "The Deep",
      "season": 1,
      "episode": 2,
      "description": "The deep sea, which gets darker with increasing depth until no more sunlight penetrates at about a kilometer depth, and ever colder closer to the bottom of the ocean, covers most of the planet and is thus by far the largest habitat on earth, yet has been explored less than space, so most scientific expeditions, at depths requiring modern submarine technology, discover at least one new species, or even whole new branches of submarine life. Like everywhere else, evolution has over millions of years produced several amazing adaptations to even the most extreme conditions, here especially to the lack of sunlight, with its problems for procreation, searching food and fleeing hunters, such as photophore cells which produce specific light types, mimic rare light penetrating from above, etcetera.",
      "date": "2001-09-18T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNjM3ODE0MDMyNl5BMl5BanBnXkFtZTgwNjM1MjIyMjE@.jpg"
    },
    {
      "title": "Open Ocean",
      "season": 1,
      "episode": 3,
      "description": "Endless blue stretches in every direction. The sea bed is a staggering eight kilometers deeper down and the nearest island is 500 kilometers away. There is nothing save the burning sun above and the blackened abyss below. How, then, does life exist?",
      "date": "2001-09-25T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY2NzQ1MTA0Nl5BMl5BanBnXkFtZTgwNjI3MjIyMjE@.jpg"
    },
    {
      "title": "Frozen Seas",
      "season": 1,
      "episode": 4,
      "description": "Life on the edge of a frozen sea is tough. Ice at both poles is constantly moving, and in winter freezes solid with air temperatures 70 °C below freezing. Only in spring, with the retreating ice and light reaching the water, does life begin again.",
      "date": "2001-10-03T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzAxMDgyODE3N15BMl5BanBnXkFtZTgwMDU3MjIyMjE@.jpg"
    },
    {
      "title": "Seasonal Seas",
      "season": 1,
      "episode": 5,
      "description": "Shafts of sunlight are the vital source of energy used by the countless billions of plankton that grow every spring and summer in the world's temperate sea, the richest of all habitats.",
      "date": "2001-10-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA4MDcyMjk3M15BMl5BanBnXkFtZTgwMDM3MjIyMjE@.jpg"
    },
    {
      "title": "Coral Seas",
      "season": 1,
      "episode": 6,
      "description": "Coral reefs are the rainforests of the sea; fish compete for food, territory and mates within this oasis of life. Incredible time-lapse photography shows the dramatic formation of a coral reef, portraying its inhabitants and its ultimate destruction.",
      "date": "2001-10-16T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOTI0NDI1Mjk3MV5BMl5BanBnXkFtZTgwNjE3MjIyMjE@.jpg"
    },
    {
      "title": "Tidal Seas",
      "season": 1,
      "episode": 7,
      "description": "Tidal marshes are one of the most productive parts of the world. Numerous plants support numerous animals, yet life is not easy: predators are attracted to these enormous quantities of food, forcing animals to seek constant protection from attack.",
      "date": "2001-10-23T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE5ODU4MDk5NV5BMl5BanBnXkFtZTgwMzI3MjIyMjE@.jpg"
    },
    {
      "title": "Coasts",
      "season": 1,
      "episode": 8,
      "description": "The boundary between land and sea is an exciting place, with seabirds, turtles, and marine mammals constantly coming and going.",
      "date": "2001-10-30T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQyMjUwOTM5MF5BMl5BanBnXkFtZTgwNTM1MjIyMjE@.jpg"
    }
  ]
}