{
  "seasons": 5,
  "episodes": [
    {
      "title": "The Target",
      "season": 1,
      "episode": 1,
      "description": "Baltimore Det. Jimmy McNulty finds himself in hot water with his superior Major William Rawls after a drug dealer, D'Angelo Barksdale who is charged with three murders, is acquitted. McNulty knows the judge in question and although it's not his case, he's called into chambers to explain what happened. Obviously key witnesses recanted their police statements on the stand but McNulty doesn't underplay Barksdale's role in at least 7 other murders. When the judge's raises his concerns at the senior levels of the police department, they have a new investigation on their hands. Lt. Cedric Daniels is put in charge with Kima Greggs as the lead detective. As for Barksdale, he finds himself demoted to a low-level dealer after his arrest and he obviously has to prove himself yet again.",
      "date": "2002-06-01T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMGQ3NzJhMGUtMzNjZS00MjA4LWI0YTYtZDc0N2I4MzczYjYxXkEyXkFqcGdeQXVyNDIzMzcwNjc@.jpg"
    },
    {
      "title": "The Detail",
      "season": 1,
      "episode": 2,
      "description": "Lt. Daniels puts his team together but the extra help he's asked includes several less than stellar officers. It also includes McNulty, who is obviously in the doghouse. When one of the witnesses against D'Angelo Barksdale is found dead, McNulty and his homicide partner 'Bunk' Moreland bring him in for questioning. They have no evidence that he had anything to do with the killing but their instincts tell them otherwise. When news of the witnesses death hits the press, Major Rawls is convinced that McNulty is again responsible. Three of the newly assigned detectives, Hec, Prez and Carver decide to go to the towers and flex a little muscle only to have it turn into a major disaster.",
      "date": "2002-06-08T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzgwNjBmNDQtMmUzMC00ZGE0LWJkZGUtMjZhYjI0MTI2NjQxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "The Buys",
      "season": 1,
      "episode": 3,
      "description": "After two weeks on the job, the team still doesn't have a photo of their principal target, Avon Barksdale. Freamon has a solution when he hears Avon was a Gold Gloves boxer. In the aftermath of the near riot at the towers, Lt. Daniels stands by his men even though he thinks they were stupid to do what they did. He's ordered to lead a raid on the low-rise units in the projects but McNulty rebels and refuses to participate in a raid that's just being put up for show. Dissatisfied with the antiquated equipment they have to work with, McNulty asks his friend at the FBI to lend them listening devices. His friend also has some information for him about Lt. Daniels. D'Angelo isn't around when a gang led by someone called Omar robs his stash.",
      "date": "2002-06-15T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMzVhMzc0ZTQtM2JhNi00OGI1LTg1ZjItNjdlYTYwY2U1OWY3XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Old Cases",
      "season": 1,
      "episode": 4,
      "description": "Bodie walks out of detention pretending to be a janitor but Patty is recovering in hospital and is pleased that his injuries will result in a medical pension. Avon Barksdale puts a contract out on Omar and others who robbed him. He wants to make sure everyone on the street knows he's not to be messed with. Judge Phelan keeps the pressure on and Daniels recommends to the Deputy that they need a wire. McNulty suggests they get a warrant to clone the pagers the drug runners use. Det. Fremon is one step ahead of everyone having already found D'Angelo Barksdale's pager number.",
      "date": "2002-06-22T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNDMzNzFjZjQtM2E0Mi00MmJlLWExZTktY2E1ZWIwNTk0MzUyXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "The Pager",
      "season": 1,
      "episode": 5,
      "description": "Avon Barksdale is becoming paranoid and thinks he's being watched. He's also worried his phone is being tapped. He also thinks there's a snitch in D'Angelo's crew and he's told not to pay anyone until it's sorted. D'Angelo isn't too pleased when he hears Avon has given Stinkum a new territory. Judge Phelan visits the squad to sign the warrants to clone D'Angelo Barksdale's pager. The numbers they're collecting are coded and don't make much sense. Det. Prez Pryzbylewski figures it out however. McNulty and Greggs try to get information from Omar.",
      "date": "2002-06-29T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNTFhMjcxNjgtODQ0My00MDI1LTljNWMtNzQzOGYwMjBhNGFiXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "The Wire",
      "season": 1,
      "episode": 6,
      "description": "Avon takes care of Omar's man Brandon but Wallace, who saw Brandon in the arcade, isn't too comfortable when he sees what they've done to him. Avon gives D'Angelo and Wallace a bonus for their good work. The police meanwhile get authorization to place taps for the pay phones used by D'Angelo and his crew but can only listen in when one of their suspects is using it meaning they'll have to keep the phones under constant observation. McNulty is in a tight spot when Major Rawls gives him a week to report back to his old job. When he realizes the connections McNulty's made in the various shootings, he announces he's going to arrest the Barksdales for murder and threatens to mess up the drug investigation.",
      "date": "2002-07-06T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOGMwMDY1MDMtOGQ4MC00Mzc3LTlhN2EtNTQ3NDVmMDUwMTYxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "One Arrest",
      "season": 1,
      "episode": 7,
      "description": "Burrell reluctantly sides with Daniels in the disagreement with Rawls, giving the detail more time to make a case against Avon, despite his fears the operation is beginning to sprawl. McNulty and Pearlman present the detail's findings to Phelan, who signs an affidavit for a further thirty days of electronic surveillance. Using information from the wire on the pit pay-phones, the detail catch a runner on his way to the pit with a re-up. However, they elect not to arrest the driver, Anton 'Stinkum' Artis (Brandon Price), so as to avoid giving up their evidence in the charging documents. Stinkum's apparent free pass from the police convinces Avon and Stringer that their operation has been compromised, and Stringer introduces a new set of operating procedures. Rawls gives Det. Michael Santangelo (Michael Salconi) a choice; acquire information that he can use against McNulty or solve some of the department's open homicides, whilst the owner of Avon's strip club, Wendell 'Orlando' Blocker (Clayton LeBouef), has a proposal for D'Angelo. Meanwhile, Bubbles and Johnny attend an NA meeting, and Bubbles is moved by a speech given by recovering addict Walon (Steve Earle). Investigating the murder of the witness in D'Angelo's trial, with some help from Omar, the detail target Barksdale hitman Marquis 'Bird' Hilton (Fredro Starr).",
      "date": "2002-07-20T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMDg5ZWI4MGQtNDRmMi00ZGFlLWEzMjgtZjQ5ZTQ3ZWNhNzliXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Lessons",
      "season": 1,
      "episode": 8,
      "description": "McNulty uses his children to tail Stringer after a chance encounter in a local market, with one of them getting his license plate. As the detail discuss the implications of the pit pay-phones being disconnected, speculating the crew are going to start using phones outside their immediate area of operations, Herc and Carver prepare for the sergeant's exam. Stinkum, Roland 'Wee-Bey' Brice (Hassan Johnson), and Savino Bratton (Chris Clanton) raid Omar's pad, but he is nowhere to be found. Avon is unhappy when he learns of Orlando's proposal to D'Angelo. Meanwhile, Greggs and Carver arrest a driver picking up a large amount of cash from the towers, but are surprised to learn he is an aide to State Senator Clay Davis (Isiah Whitlock Jr.). Burrell is furious with this turn of events and confronts Daniels about the direction in which the case is heading, giving him one week to charge Avon and/or Stringer. Phelan, however, tells Burrell he wants the full thirty days of surveillance assigned by the court. As Wee-Bey and Stinkum attempt to take over new territory, they encounter an unanticipated problem.",
      "date": "2002-07-27T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZWM5YjhjZjMtNGJjZC00NmEyLWJjMzItOTZmMjA4ODRiNGIwXkEyXkFqcGdeQXVyNDIzMzcwNjc@.jpg"
    },
    {
      "title": "Game Day",
      "season": 1,
      "episode": 9,
      "description": "D'Angelo speaks to Wallace, who tells him he wants to go back to school and get out of the Game. However, Malik 'Poot' Carr (Tray Chaney) discovers Wallace has started using cocaine to help him deal with his guilt over Brandon's murder. Freamon gets Sydnor and Prez started on the complex Barksdale money trail, including possible political connections, and they are surprised to find Avon's corporations have been buying up vacant buildings in run-down parts of the city. Greggs and Freamon approach D'Angelo's girlfriend, Shardene Ennis (Wendy Grantham), who works at Orlando's, in the hopes they can turn her into a CI. After Bubbles narrowly avoids a beating whilst stealing a package that turns out to be stepped on, he decides to try to get clean. Avon and Eastside kingpin 'Proposition' Joe Stewart (Robert F. Chew) stage the annual East vs. West basketball game, but when the detail follows Avon afterwards, they get something they never expected. Meanwhile, having already killed Stinkum, Omar sets in motion a plan to gain revenge on Avon for Brandon's death.",
      "date": "2002-08-03T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQyY2YwYmYtZDRlOC00MDU2LWEzZjYtYjUwZGM5ZTRjZmIxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "S1.E10 ∙ The Cost",
      "season": 1,
      "episode": 10,
      "description": "Avon, Stringer and Wee-Bey discuss how best to deal with Omar after the attempted hit on Avon, deciding to let him think they want peace, whilst secretly planning to kill him. As such, Omar and Stringer meet for a parley, with security provided by Prop Joe. Meanwhile, Stringer insists on decreasing Avon's visibility in light of the detail's attempt to follow him after the basketball game. An irritable Phelan signs an affidavit for the new phone being used by the pit crew, and Pearlman tells McNulty that he is not up for automatic re-election, possibly because of the feathers he has ruffled due to his involvement with the Barksdale case. D'Angelo tries to understand why Shardene has left him, and after being clean for three days, Bubbles gets some advice from Waylon, before turning to Greggs for support. Meanwhile, McNulty attempts to flip Wallace, and the detail identifies Barksdale's main stash house. However, when Orlando's attempt to purchase weight gets him a lot more than he bargained for, Burrell sees an opportunity for a dangerous undercover operation.",
      "date": "2002-08-10T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMGE1Njg0MTEtOTUzMC00ZTEyLThlZDUtZDAyMzU1ZGU3ZTM3XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "S1.E11 ∙ The Hunt",
      "season": 1,
      "episode": 11,
      "description": "While Greggs' life hangs in the balance, the entire department attempts to hunt down Savino. When Wallace flips, willing to testify that Stringer, Wee-Bey and Bird killed Brandon, Daniels stashes him in his grandmother's house on the outskirts of the city, but he soon becomes restless. Stringer tells Wee-Bey he needs to get out of Baltimore until the Savino investigation cools off, while Avon considers his next move. When McNulty and Pearlman try to pressure Levy into giving up Savino, he proves smarter than they gave him credit for. Meanwhile, when the detail's hand is forced, and a series of city-wide raids are ordered so as to appease Burrell's desire for \"dope on the table,\" McNulty goes to see Phelan for help, but is surprised at his reaction. Daniels decides not to raid the main Barksdale stash house, but when word of his plan gets back to Burrell, he realizes there is a snitch in the detail. Elsewhere, Bubbles finds it increasingly difficult to stay clean.",
      "date": "2002-08-17T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYjkxYTI2MzUtOGE0MC00YTExLTg1NDYtYTI4NGEyYTNjNGM1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "S1.E12 ∙ Cleaning Up",
      "season": 1,
      "episode": 12,
      "description": "Kima slowly recovers in the hospital. Stringer changes operations in the pit and the towers, rendering the wiretaps and clones useless, and prompting Burrell to begin dismantling the detail. Avon and Stringer meet Levy to discuss where their organization is vulnerable. Unbeknownst to the detail, Wallace returns to the pit to resume work. When Prez starts pulling political campaign finance reports, Pearlman is called to a meeting with a worried State's Attorney, and an angry Clay Davis confronts Daniels. Meanwhile, Stringer issues a difficult order to Bodie and Poot. With Shardene's help, the detail are able to install a camera in the strip club.",
      "date": "2002-08-31T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjdkY2RlYzMtYmRjYi00ZThmLWJhMTgtYWE1NmVlNDkxM2EzXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "S1.E13 ∙ Sentencing",
      "season": 1,
      "episode": 13,
      "description": "Due to the camera at Orlando's, the detail gather enough information to arrest Avon and many of his people, but, with Wallace dead, they are unable to bring charges against Stringer, who's left on the street. However, disgusted that Avon and Stringer had Wallace killed, D'Angelo flips on the entire organization, giving the detail more information than they could have ever hoped for. As Daniels figures out who the snitch is in the unit, Herc is shocked when he is passed over for promotion in favor of Carver, who scored lower on the sergeant's exam. In Philadelphia, Wee-Bey is arrested and gladly admits to murder after murder. Finally figuring out why Avon has been buying vacant properties in the city, Daniels, McNulty, Freamon and Pearlman take their evidence of political involvement to the FBI. Meanwhile, D'Angelo's mother, Brianna (Michael Hyatt), attempts to convince him to stand with the family.",
      "date": "2002-09-07T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMDAzYmU2ZDctMjNjZC00MTAzLWIzY2MtODA0ZWY3ZGNkN2Q4XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Ebb Tide",
      "season": 2,
      "episode": 1,
      "description": "Detective Jimmy McNulty finds the body of a woman floating in the water while carrying out his new assignment of Harbor Patrol. Major Valchek has his gift to a local parish trumped by Frank Sobotka, his rival in the local stevedores union. And on the waterfront, a shipping container destined for 'The Greek' bakes in the sun with perishable cargo.",
      "date": "2003-05-31T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOTI0ODgwNmEtODQwZC00MWU2LTg5ZmEtMzM3MTcxOTRmYjYzXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Collateral Damage",
      "season": 2,
      "episode": 2,
      "description": "Major Valchek gets back at Sobotka for the church gift fiasco, and a feud begins. Avon Barksdale continues to run his empire from a prison cell. On the waterfront, Port Police Officer Beatrice Russell gets stuck investigating the contraband in the The Greek's container. McNulty lends a hand with the investigation.",
      "date": "2003-06-07T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMmRjYjRkNWQtYjM0OC00NDIzLTk5YjctMTk0M2Q3ZGY1MmMyXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Hot Shots",
      "season": 2,
      "episode": 3,
      "description": "Lt Cedric Daniels lets it be known he is going to leave the department. McNulty pursues the identity of the Jane Doe found floating in the harbor. A pair of young longshoremen, Frank Sobotka's son Ziggy and nephew Nick, heist a container and sell its contents, digital cameras, to men working for The Greek.",
      "date": "2003-06-14T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BN2U3MWU3OTItNWZiNi00MWEwLTkzYjMtM2JmYTA4YjUyZGM2XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Hard Cases",
      "season": 2,
      "episode": 4,
      "description": "McNulty goes on a self-assigned moral mission to identify his floater, but his old partner, Bunk, says they have more pressing matter at hand: finding Omar to testify against a Barksdale trigger man in one of last year's murders. To placate Valchek, Burrell asks Daniels to lead the detail investigating Sobotka, and Daniels agrees.",
      "date": "2003-06-21T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMGIxYmU3NmEtYTUyMS00ODc1LWJlYzktNTIwMDBjZGE5NDg0XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Undertow",
      "season": 2,
      "episode": 5,
      "description": "Weak product in the pit has Bodie getting heat. Homicide detectives hand out grand jury summonses to stevedores involved in the homicide case, and Port Police Officer Beadie Russell works the lingering affections of an old boyfriend to find out how cargo disappears from the docks.",
      "date": "2003-06-28T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzdhZDI0OWEtYjhmNC00OTk5LTg0OWEtMDdlODZhMDllYWYyXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "All Prologue",
      "season": 2,
      "episode": 6,
      "description": "Trying to let go of police work and return to his marriage, McNulty gives up on identifying his Jane Doe. The detectives look into Sobotka and his money. For his union, Sobotka tries to play the political game. D'Angelo wants to live life outside of Barksdale's umbrella and Bell brings in outside help for the problem.",
      "date": "2003-07-05T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4YWFiZjMtNDk4Ny00MTVmLTg4YTEtOGJiNTExZTg1ZjQ1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Backwash",
      "season": 2,
      "episode": 7,
      "description": "Greggs and Prez tap into the circuit of Russian prostitutes. With two sets of evidence, the detail goes to Pearlman who tells them neither crime merits a wiretap, but a drug connection could give the case legs. Rawls can't persuade Daniels to take the murders, but new evidence does. Though discord grows in Barksdale's empire, Bell tries to hold it together.",
      "date": "2003-07-12T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNWU5MzgxMzktNTFhMS00ZTlkLWE1OWMtNWI1NmU0Y2IxYzM4XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Duck and Cover",
      "season": 2,
      "episode": 8,
      "description": "McNulty goes on a drunken binge of legendary proportions. Fellow stevedores convince Ziggy to fight Maui. Bunk, seeing McNulty's desperation, talks Daniels into asking for him. Daniels does so and Rawls, who has no choice, agrees. After some labor, the wiretap is up, just in time to catch another disappearing container.",
      "date": "2003-07-26T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNTg3MDk4ODUtM2U2NC00YmU1LTk1ODgtZWRjMzNmOTRiY2EzXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Stray Rounds",
      "season": 2,
      "episode": 9,
      "description": "Bodie's disastrous sales efforts result in a tongue lashing from Stringer Bell. Ziggy pulls Johnny Fifty into a new caper that makes the Greeks pay big money. McNulty goes undercover in a brothel. As Valchek fumes over the change of targets and Burrell pulls the rug from beneath him, Daniels and Pearlman maintain their composure.",
      "date": "2003-08-02T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNTAwMjkyYjEtZGMyZi00YTEyLTgzMTktZjczYTBjM2VkOWZlXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Storm Warnings",
      "season": 2,
      "episode": 10,
      "description": "The detail uses satellite technology to its advantage. Bodie is unhappy that Proposition Joe's people are selling on his turf. Valchek visits the FBI in an attempt to get real results on the docks. Ziggy's deal with Double-G goes bad in a big way. Greggs considers motherhood and Prez makes a major blunder.",
      "date": "2003-08-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BY2JiMzI1M2YtY2UxNi00ODcwLWEwZDAtMTkzZDcwNmJlNjdiXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Bad Dreams",
      "season": 2,
      "episode": 11,
      "description": "The detail makes a desperate move. Nick's deceit is in the open, as Sobotka is overwhelmed by bad news. The Greeks confidently ease out of a brief encounter with the detail and Omar's suspicions are validated. The detail hopes to find Vonda's boss. Nick hopes to repair relations with the Greeks and Sobotka is forced to make a difficult choice.",
      "date": "2003-08-16T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzY5MGY1MWQtZmJmYi00MTljLWFkZDUtNjRlOGI2NmM1MGIyXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Port in a Storm",
      "season": 2,
      "episode": 12,
      "description": "The detail has a setback. Russell and Bunk revisit Philly, looking for evidence. Brother Mouzone talks with Stringer Bell regarding their agreement, leaving Bell to contend with Avon Barksdale. McNulty and Greggs return to the Westside, where they discover new connections. Herc and Carver feel disrespected by fellow officers. Nick tries to come to terms with the Greeks, and himself.",
      "date": "2003-08-23T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZTJkODg3ZWYtYWExMy00NDM3LWFlMTctMzVmNTkxNjlhNjMzXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Time After Time",
      "season": 3,
      "episode": 1,
      "description": "After the notorious Franklin Terrace public housing towers are razed, the Barksdale drug crew searches for a new home on the streets of West Baltimore. McNulty and the detail look to make a case against Stringer Bell with a wiretap on a drug ring run by his ally, Proposition Joe. Daniels' promotion is derailed by City Hall due to his estranged wife's political ambitions.",
      "date": "2004-09-18T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzJjYzA2NTItYzE1OC00NGQ2LWE1ODMtMzBlNWZmODI3NmIxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "All Due Respect",
      "season": 3,
      "episode": 2,
      "description": "Omar continues his bold strikes on the heavily guarded Barksdale stash houses. McNulty launches his own investigation into last year's prison suicide of D'Angelo Barksdale. On the streets the bloodbath continues, prompting Burrell and Rawls to jack up the heat on their district commanders. The street violence also presents Daniels with a tough decision. A beleaguered Cutty tries to get his life back on track.",
      "date": "2004-09-25T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYjZjMGIzOTctOTg3My00NDNhLWFjOWQtZjJlNGVjMzU2ZjQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Dead Soldiers",
      "season": 3,
      "episode": 3,
      "description": "The brutality at police headquarters continues over the perceived failure of department commanders to rein in the city's crime stats. Another hit by Omar on the Barksdale stash houses goes horribly wrong. Proposition Joe summons Stringer Bell to a meeting and tells him that the cops have screwed up. Daniels reassigns his detail after the wire on Stringer Bell goes dead.",
      "date": "2004-10-02T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTRhZDk0NTYtNTQ4Yi00ZGE3LWE0YWYtOTk3MjY2MGIxMTQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Amsterdam",
      "season": 3,
      "episode": 4,
      "description": "Greggs and McNulty recruit Bubbles to gather street intelligence on the Barksdale gang. Cutty seeks out the Barksdale gang after he loses his taste for the straight life. Bunk feels the pressure to find Dozerman's gun. Daniels worries that Avon Barksdale, having cut a prison deal, will be paroled. Stringer Bell tries to make amends with Donette.",
      "date": "2004-10-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMGNjYTQyOGUtZjg5ZC00MDIyLWFhMzgtYTFjMGVmNDU2ZGYxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Straight and True",
      "season": 3,
      "episode": 5,
      "description": "Johnny pressures Bubbles to stop snitching for the detail. Cutty lies to his grandmother about going straight. McNulty realizes pursuing Barksdale and Bell is a losing cause, so he turns his attention to nailing Kintel Williamson. Colvin's free drug dealing zone, now known in the streets as Hamsterdam, scores a small victory. Avon Barksdale emerges from prison to a warm welcome from Stringer Bell.",
      "date": "2004-10-16T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMzg1NjJiYjMtZGJkYi00YTI1LWEwMjQtN2YxMjQwNmE0OTNmXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Homecoming",
      "season": 3,
      "episode": 6,
      "description": "Major Colvin instructs his men to use brute force to get the message out to street dealers about his free zone. Avon Barksdale and Stringer Bell discover that real estate development has its own pitfalls. McNulty and Greggs ask Daniels to let them renew the Bell and Barksdale investigation. On Barksdale's orders, Cutty plans to take back corners from Marlo's crew.",
      "date": "2004-10-30T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMGJiMWFlOTUtOWIwZS00ZDUxLWEwZjQtZjUxMmNjN2M3NGQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Back Burners",
      "season": 3,
      "episode": 7,
      "description": "Daniels goes ballistic when the detail gets reassigned to the Western District. Stringer Bell learns from Donette that Brianna is thinking about talking to McNulty. Bunk receives a gift wrapped surprise. A single cell phone allows Freamon to begin mapping out a communications network for the Barksdale organization. Marlo dispatches a drive-by on a Barksdale drug corner.",
      "date": "2004-11-06T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BODg3M2U1MzgtOTQwZC00MGFmLWI4ZDAtODcxNjUwN2RhMDdkXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Moral Midgetry",
      "season": 3,
      "episode": 8,
      "description": "Prez impresses the detail with what he's found out from Bodie's cell phone, information that sends McNulty and Greggs on a road trip. Colvin sees the benefits of his plan working. Carcetti confronts a hurdle he must clear if he wants to run for higher office, while Marlo appears to take the bait set by the Barksdale crew.",
      "date": "2004-11-13T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYThmNDhmN2UtYTA3NC00NmRkLWE3MTItOTViZWVmOWUzYjU3XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Slapstick",
      "season": 3,
      "episode": 9,
      "description": "Responding to an officer's call for help, McNulty and Prez turn up the wrong alley with unanticipated results. Cutty is surprised to find help from within Baltimore's power structure for his proposed boxing gym. Omar decides to go it alone against Avon Barksdale and Stringer Bell. Bubbles is wired up and sent into Hamsterdam",
      "date": "2004-11-20T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYmYxZjg1MzYtZDgzYy00MzM0LTljYmEtMGMxYmFkZTAxM2UwXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Reformation",
      "season": 3,
      "episode": 10,
      "description": "Brother Mouzone returns to Baltimore on a mission of revenge and casts a wide net in his search for Omar. Colvin manages to put off a Sun reporter inquiring about Amsterdam. Pearlman and Daniels plead their case for a new kind of wiretap. Stringer Bell falls out of the loop with Avon Barksdale, while Marlo raises the stakes against the Barksdale gang.",
      "date": "2004-11-27T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZmVmYWI3OWItMjc4Zi00NWQyLWFmZDQtZjQ4YjgyNDg0NmEzXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Middle Ground",
      "season": 3,
      "episode": 11,
      "description": "The wire begins to yield information about the Barksdale organization. Stringer and Avon reminisce on how far they have come. McNulty finds the way to a key piece of the puzzle in an unlikely place. Awaiting his fate, Colvin works behind the scenes to shape the outcome of Amsterdam, while protecting his men from possible repercussions. Bubbles considers a new partner.",
      "date": "2004-12-11T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOTM0YmViZTUtNWZjMC00YWVjLWI2NTQtNDc3OTFkZjU5N2UyXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Mission Accomplished",
      "season": 3,
      "episode": 12,
      "description": "Avon readies his troops for a seemingly endless war against Marlo. The detail works towards the top rungs of the Barksdale organization with the information garnered from the wire. While Royce continues to grapple with Amsterdam, Burrell offers a deal to minimize the fallout. Carcetti's political plans become obvious to his friend and fellow councilman Tony Gray. Bubbles offers his view of the world. McNulty changes tack.",
      "date": "2004-12-18T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BM2YwZmVkMDYtZTdiMi00MmFjLTk2ODAtMjc5ZTlhYWUyYWVkXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Boys of Summer",
      "season": 4,
      "episode": 1,
      "description": "In the Season Four premiere, four boys from West Baltimore play out their summer vacation in the streets. Meanwhile, Marlo has solved the problem that baffled Stringer Bell: how to maintain discipline--read: murders--without getting police attention.",
      "date": "2006-09-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZTY5Njc4MzQtMGZjMC00YWYxLTgwMmItMjA4NzZiOGYyNTk5XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Soft Eyes",
      "season": 4,
      "episode": 2,
      "description": "Herc's soft-duty job with the mayor takes an unexpectedly hard turn. Despite the potential damage to her career, Pearlman provides Freamon and Sydnor with subpoena ammunition for their 'grizzly bear' hunt in City Hall.",
      "date": "2006-09-16T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMTZiZDdkNDAtZGU5Yy00Zjc1LWEwN2ItYzk1NTE1NjllODY1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Home Rooms",
      "season": 4,
      "episode": 3,
      "description": "With his lead dwindling, Royce resorts to extreme measures to stall Carcetti's momentum. At Bodie's corner, Michael proves adept as a runner, with Bodie and Marlo taking notice. A re-up bodega is put under surveillance by Omar and Greggs.",
      "date": "2006-09-23T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYmIyMjY0Y2MtOTg4Yi00NGRjLTg3YmEtMjA4ODgwMzQ5NDc1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Refugees",
      "season": 4,
      "episode": 4,
      "description": "With Freamon and Greggs moved to Homicide, Herc and Dozerman join Marimow in the stripped-down Major Crimes Unit. Cutty gets a 'custodial' job at Tilghman School mopping up truants, but can't make headway in his efforts to mentor Michael.",
      "date": "2006-09-30T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYmQzYWViNWEtMjlmNC00OThiLTk4ZjgtM2YzMzA0OTRmNjczXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Alliances",
      "season": 4,
      "episode": 5,
      "description": "The ensuing negative attention turns Royce against Burrell, who takes the heat while Rawls comes to the rescue. At school, Prez's reward/punishment program meets with mixed results, and Colvin looks to restore order by separating disruptive \"corner\" kids from more attentive \"stoop\" ones. Chris tries to enlist Michael into Marlo's ranks, spooking Randy along the way. Dukie debunks Randy's \"special dead\" theory.",
      "date": "2006-10-07T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMWI3NzQ5ZjktN2E0ZC00MTZhLTlmNDQtMmQyYjU5YzgzMGFlXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Margin of Error",
      "season": 4,
      "episode": 6,
      "description": "With Election Day approaching, the three mayoral candidates make last-minute appeals. Carcetti wrangles for votes as he responds to a potentially devastating smear. Norris and Greggs get a lead on the Braddock case, but end up being detoured.",
      "date": "2006-10-14T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNDQ4NGM2OTgtNTJjZS00NWJhLTk0ODktOGE5ZDJlZGU5MjQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Unto Others",
      "season": 4,
      "episode": 7,
      "description": "With a bounty on him, Omar calls in a favor to Bunk. The election over, Royce and Carcetti make peace and contemplate their futures. At school, Prez tricks his students into learning math. Finally, Greggs uses 'soft eyes' at a crime scene.",
      "date": "2006-10-28T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYjYyNzk2ODktYjE5NC00NGQ1LThiZjAtNWFhZTY2MWQ4N2ZiXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Corner Boys",
      "season": 4,
      "episode": 8,
      "description": "To monitor the pulse on the street, Carcetti makes the rounds with members of the force. While Proposition Joe shows off his vocal range, Chris shows Snoop how to expose, and dispose of, New York infiltrators. Colvin uses \"corner\" logic in class. A newly sober McNulty attends an Irish cop wake - with a not-so-sober Bunk. Michael is dismayed by the unexpected return of a missing family member.",
      "date": "2006-11-04T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNTY0NjExZjAtN2YyYy00NTU4LWEzNTktM2I2M2Q3YWZjZmViXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Know Your Place",
      "season": 4,
      "episode": 9,
      "description": "Poot returns to the corner after a stint in prison--and is welcomed back. Carcetti engages in a testy budget battle with City Council President Campbell, promotes Daniels, and hits a snag in his efforts to relieve Burrell of his duties.",
      "date": "2006-11-11T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjY0OGVlNTYtNzI0MC00YTU5LThlZmUtMDY0NmVmMTM5MmZjXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Misgivings",
      "season": 4,
      "episode": 10,
      "description": "Acting on Clay Davis' advice, Burrell seeks to burnish his reputation by ordering the department to double their street arrests. The mandate does not sit well with McNulty, who sets his sights instead on cracking a string of church robberies.",
      "date": "2006-11-18T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZjZjYzAxYjYtMTc2NC00YTM2LWE2ZTktOTE5MmUxYzEzNWU5XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "A New Day",
      "season": 4,
      "episode": 11,
      "description": "After flexing his muscles around the city, Carcetti faces his first dilemma when a group of ministers protests Herc's mistreatment of one of their own. Randy gets the cold shoulder at school. Omar and Reynaldo pay a menacing visit to Proposition Joe, with their own proposition. Freamon has a revelation at a crime scene that promises to blow the lid off an unsolved mystery.",
      "date": "2006-11-25T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZDAyNzk5OWEtMDg3MC00NDM1LWI5NjUtYzQ1NDBhYzZmMTZhXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "That's Got His Own",
      "season": 4,
      "episode": 12,
      "description": "On the trail of missing bodies, Freamon turns to a higher authority after being rebuked by Landsman. Carcetti finds his promises of prosperity undermined by the school debt, forcing him to contemplate groveling before the Governor in Annapolis.",
      "date": "2006-12-02T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZjk4OGM1NDktMzAzOC00YTBjLTkzMmUtNGVlNGE4ZDcyNTY5XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Final Grades",
      "season": 4,
      "episode": 13,
      "description": "In the Season Four finale, the bodies from the vacants pile up while Burrell offers his support to Daniels and admonishes Rawls for crossing him. A distraught Bubbles finds himself at his wit's end after his revenge plan backfires.",
      "date": "2006-12-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMDkwYmEzOWItYzAwYy00YzMyLTllNjgtOGUzNGYwMGRmYzY1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "More with Less",
      "season": 5,
      "episode": 1,
      "description": "Season Five premiere. As McNulty and the detail continue staking out Marlo's crew, recently promoted Sergeant Carver is welcomed by a cauldron of discontent from officers coping with unpaid overtime.",
      "date": "2008-01-05T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BOGUyMWY3MmQtYzY5ZS00MTA2LTkxYjUtMGRkMTVhYWNmMDViXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Unconfirmed Reports",
      "season": 5,
      "episode": 2,
      "description": "Although he tells Sydnor the Davis investigation could be a 'career case,' Freamon keeps a wary eye out for Marlo, who takes care of some unfinished business and strikes a business deal with Barksdale.",
      "date": "2008-01-12T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYWYxOWMxYTEtYTI5YS00N2ZlLWE0MjUtMzIxYjAwOWQzYWJlXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Not for Attribution",
      "season": 5,
      "episode": 3,
      "description": "Carcetti's master plan for the police department is leaked to the press, sending the brass into a panic. Marlo turns to Proposition Joe to help with an enviable problem. Whiting and Klebanow drop a bombshell on the newspaper staff.",
      "date": "2008-01-19T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQzNGM3NmEtZmRhZC00NmI3LTg5YzQtM2VhZTBmODI0Zjg1XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Transitions",
      "season": 5,
      "episode": 4,
      "description": "Campbell tries to smooth out the transitions in the police department. The newspaper scrambles to confirm surprising news from City Hall, but lose out to the TV media in scooping a high-profile Grand Jury appearance.",
      "date": "2008-01-26T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BYmQ4ZmNiZTQtMDJiMC00NjcwLTgwOWItOGM0MjJhNjY1NjY4XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "React Quotes",
      "season": 5,
      "episode": 5,
      "description": "Marlo forges an alliance with a drug connect, who shows him a new communications trick. McNulty's case gets increased attention from the newspaper, in large part thanks to the addition of Templeton to the reporting team.",
      "date": "2008-02-02T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMDk1OTQ4NWMtOTdiZi00MmQ3LTkzNDgtYWJlYzNiNmZiYTVjXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "The Dickensian Aspect",
      "season": 5,
      "episode": 6,
      "description": "Mystified by Omar's disappearance, Marlo and Chris ramp up their efforts to locate their nemesis. After a sparsely attended waterfront ceremony, Carcetti fires away at a larger press event--and recasts himself as a champion for the homeless.",
      "date": "2008-02-09T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BMzlmZDkxN2YtNzM2NC00ZGE2LThhNmUtZDE5OWM1YzRjNGMxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Took",
      "season": 5,
      "episode": 7,
      "description": "An unexpected call puts Templeton back in the spotlight--and gets McNulty more attention than he expected. Bunk bucks at Landsman when ordered to help with the force's most recent red ball.",
      "date": "2008-02-16T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZGNlMWI0YjktOTUwMS00NTYxLWFjYmQtMjc2ZjMwNTI5MTg2XkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Clarifications",
      "season": 5,
      "episode": 8,
      "description": "Baltimore's renewed police commitment brings fresh recruits to Daniels and McNulty, starting with Carver. Facing a new political challenge, Carcetti is forced to make dangerous political deals.",
      "date": "2008-02-23T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BZTFjMDNmNWUtNDUyYS00YzM3LTk4NTgtMzVlNDA2YTYzNmRlXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "Late Editions",
      "season": 5,
      "episode": 9,
      "description": "With Steintorf ordering Rawls to initiate 'creative' remedies for the rising crime rate, Freamon's vigilance pays off with a promising lead, sending Sydnor and the department into overdrive.",
      "date": "2008-03-01T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BNzUyMjdiODEtMTc2My00YTNhLTg1N2MtMzA5OGEwNGNiMTIwXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    },
    {
      "title": "-30-",
      "season": 5,
      "episode": 10,
      "description": "Carcetti maps out a damage-control scenario with the police brass in the wake of a startling revelation from Pearlman and Daniels. Their choice: clean up the mess...or hide the dirt.",
      "date": "2008-03-08T22:00:00.000Z",
      "image": "https://m.media-amazon.com/images/M/MV5BN2QzZmNkOWEtOGU5Yy00NWQwLTkyMDQtMDBkZDZmYjRmYjgxXkEyXkFqcGdeQXVyNTgyNDM1OTU@.jpg"
    }
  ]
}